000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. Decimal.
000000 ENVIRONMENT DIVISION.
000000 CONFIGURATION SECTION.
000000 SOURCE-COMPUTER. IBM-370.
       special-names. decimal-point is comma.
000000 DATA DIVISION.
000000 working-storage section.
000000 COPY DecimalCommaCPY.
000000
000000 PROCEDURE DIVISION.
000000     GOBACK
000000     .
000000 END PROGRAM Decimal.