      *Callee contains public procedure
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Callee.

       DATA DIVISION.
       working-storage section.

       01  MyType1 TYPEDEF STRICT PUBLIC.
          05 Var1 pic X.

       01 TOto pic X.
       
       01  MyType2 TYPEDEF STRICT PUBLIC.
          05 Var2 pic X.

       01  MyType3 TYPEDEF STRICT.
          05 Var3 pic X.

       01  MyType4 TYPEDEF STRICT.
          05 Var4 pic X.

       01  MyType5 TYPEDEF STRICT PUBLIC.
          05 Var5 pic X.

       PROCEDURE DIVISION.
       
       declare procedure check public
          input mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       declare procedure check2 public
          input mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       declare procedure check2 public
          input mydate        TYPE Date
                myDate2       type date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       DECLARE PROCEDURE MyPublicProcedure PUBLIC
           INPUT mydate        TYPE Date
                 format        PIC X(08)
          OUTPUT okay          TYPE Bool
                 actual-format PIC X(08).
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM Callee.
