      ******************************************************************
       01  YFOO.
           05  var1 pic X.
           05  var1 pic X.
           05  var1 pic X.
           05  var1 pic X.
           05  var1 pic X.
           05  var1 pic X.