       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyIntrinsicFunctions.
       PROCEDURE DIVISION.
       
       declare procedure dump public
          input mymessage pic X(80)
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM MyIntrinsicFunctions.
