000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. SourceAcrossFiles1.
000000 ENVIRONMENT DIVISION.
000000 CONFIGURATION SECTION.
000000 SOURCE-COMPUTER. IBM-370.
000000 DATA DIVISION.
000000 WORKING-STORAGE section.
000000 01 myVar   COPY  SourceAcrossFiles1PictureClause.
000000    
000000
000000 PROCEDURE DIVISION.
000000     GOBACK
000000     .
000000 END PROGRAM SourceAcrossFiles1.