FD FSOR010 DATA RECORD      ENR-SOR010.
FD FSOR010 DATA RECORD  IS  ENR-SOR010.
FD FSOR010 DATA RECORD  ARE ENR-SOR010.
FD FSOR010 DATA RECORDS     ENR-SOR010.
FD FSOR010 DATA RECORDS IS  ENR-SOR010.
FD FSOR010 DATA RECORDS ARE ENR-SOR010.
FD FSOR010 LABEL RECORD      STANDARD.
FD FSOR010 LABEL RECORD  IS  STANDARD.
FD FSOR010 LABEL RECORD  ARE STANDARD.
FD FSOR010 LABEL RECORDS     STANDARD.
FD FSOR010 LABEL RECORDS IS  STANDARD.
FD FSOR010 LABEL RECORDS ARE STANDARD.