000270 01 YACMPSB.                                                      0000000
000280    05 ACMPSB-NB-PCB            PIC 9(4) COMP.                    0000000
000290 COPY UNKNOWN.
