000350        10 PAC421-EPL-REF-BQE               PIC X(5).             0000000
000360        10 PAC421-EPL-REF-CAI               PIC X(5).             0000000
000370 COPY CPY4.