002280* Sauvegarde EXTERNAL                                             02280000
002290 01 YACMPSB EXTERNAL. COPY CPY1 SUPPRESS.                         02290000
002640*----------------------------------------------------------------*02640000
002660 01 FILLER                          PIC X(8) VALUE 'YPAC711 '.    02660000
002670 01 PAC711. COPY CPY2 SUPPRESS.                                   02670000
002680 COPY UNKNOWN.                                                    02680000