000001 REPLACE == TOTO == BY == :TAG: ==.
000002 01 TOTO 
000003 REPLACE == UNKNOWN == BY == ==
000004         == KEYWORD == BY == PIC X ==.
000005 UNKNOWN KEYWORD (10).
