000001 REPLACE == PIC X == BY == PICTURE N ==.
000002 COPY CpyNested REPLACING == :TAG: == BY == TITI ==
000003                          == X(10) == BY == X(20) ==.