000320 01 PACVAR.                                                       0000000
000340     05 PAC421-EPL-REF.                                           0000000
000350     COPY CPY3.
000380          15 PAC421-EPL-REF-CPT-RAC         PIC X(9).             0000000
