       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOBCOMP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

      * should suggest: matching variables
       01 SAY-VAR1               PIC 9.
       01 REDEF-SAY-VAR1 REDEFINES SAY-VAR1
                                 PIC 9.
       01 GROUP1-SAY.
          05 VAR2-SAY            PIC X.
          66 SAY66 RENAMES VAR2-SAY.
       01 VAR3-SAY-VAR3          PIC 9.
       01 SAY-POINTER USAGE POINTER.
       01 SAY-PROCEDURE-POINTER USAGE PROCEDURE-POINTER.
       01 SAY-FUNCTION-POINTER USAGE FUNCTION-POINTER.
       01 GROUP2 OCCURS 10 INDEXED BY SAY-INDEX
                                 PIC X.
       01 GROUP-QUALIF-1.
          05 SUB-GROUP-QUALIF-1.
             10 SAY-VAR-QUALIF   PIC X.
       01 GROUP-QUALIF-2.
          05 SUB-GROUP-QUALIF-2.
             10 SAY-VAR-QUALIF   PIC X.
       77 SAY77                  PIC X.

      * should not suggest: not matching, 88
       01 VAR4                   PIC 9.
       01 NOTSAY                 PIC 9.
       01 GROUP3.
          05 VAR5                PIC X.
             88 SAY88-YES              VALUE 'Y'.
             88 SAY88-NO               VALUE 'N'.

       PROCEDURE DIVISION.
       MAIN.
           MOVE SAY
           GOBACK
           .
      * should not suggest: paragraph
       P-SAY-HELLO.
           DISPLAY "HELlO"
           .
      * should not suggest: section
       S-SAY-CONTINUE SECTION.
           CONTINUE
           .

       END PROGRAM TCOBCOMP.
---------------------------------------------------------------------------------
{"line":36,"character":19}
---------------------------------------------------------------------------------
[
  {
    "label": "SAY-VAR1 (Numeric) (SAY-VAR1)",
    "kind": 6,
    "insertText": "SAY-VAR1",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "REDEF-SAY-VAR1 (Numeric) (REDEF-SAY-VAR1)",
    "kind": 6,
    "insertText": "REDEF-SAY-VAR1",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "GROUP1-SAY (Alphanumeric) (GROUP1-SAY)",
    "kind": 6,
    "insertText": "GROUP1-SAY",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "VAR2-SAY (Alphanumeric) (VAR2-SAY)",
    "kind": 6,
    "insertText": "VAR2-SAY",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "SAY66 (?) (SAY66)",
    "kind": 6,
    "insertText": "SAY66",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "VAR3-SAY-VAR3 (Numeric) (VAR3-SAY-VAR3)",
    "kind": 6,
    "insertText": "VAR3-SAY-VAR3",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "SAY-POINTER (Alphanumeric) (SAY-POINTER)",
    "kind": 6,
    "insertText": "SAY-POINTER",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "SAY-PROCEDURE-POINTER (Alphanumeric) (SAY-PROCEDURE-POINTER)",
    "kind": 6,
    "insertText": "SAY-PROCEDURE-POINTER",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "SAY-FUNCTION-POINTER (Alphanumeric) (SAY-FUNCTION-POINTER)",
    "kind": 6,
    "insertText": "SAY-FUNCTION-POINTER",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "SAY-INDEX (Numeric) (SAY-INDEX)",
    "kind": 6,
    "insertText": "SAY-INDEX",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "SAY-VAR-QUALIF (Alphanumeric) (SAY-VAR-QUALIF OF SUB-GROUP-QUALIF-1 OF GROUP-QUALIF-1)",
    "kind": 6,
    "insertText": "SAY-VAR-QUALIF OF SUB-GROUP-QUALIF-1 OF GROUP-QUALIF-1",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "SAY-VAR-QUALIF (Alphanumeric) (SAY-VAR-QUALIF OF SUB-GROUP-QUALIF-2 OF GROUP-QUALIF-2)",
    "kind": 6,
    "insertText": "SAY-VAR-QUALIF OF SUB-GROUP-QUALIF-2 OF GROUP-QUALIF-2",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  },
  {
    "label": "SAY77 (Alphanumeric) (SAY77)",
    "kind": 6,
    "insertText": "SAY77",
    "data": {
      "start": {
        "line": 36,
        "character": 16
      },
      "end": {
        "line": 36,
        "character": 19
      }
    }
  }
]