IDENTIFICATION DIVISION.
  PROGRAM-ID. Doubles.

DATA DIVISION.
WORKING-STORAGE SECTION.
77  I-DOUBLE        PIC X(32) VALUE 'D1'.
77  I-DOUBLE        PIC X(32) VALUE 'D2'.
01  X               PIC X(32) VALUE 'X'.
77  I-DOUBLE        PIC X(32) VALUE 'D3'.

01 BIGZONE          PIC X(3000).
01 GROUP-DOUBLE REDEFINES BIGZONE.
   05 VARIANT-1A.
      10 V1A1       PIC X(500).
      10 V1A2       PIC X(500).
   05 VARIANT-1B    PIC X(800).
   05 FILLER        PIC X(1200).
01 GROUP-DOUBLE REDEFINES BIGZONE.
   05 VARIANT-2.
      10 V2         PIC X(3000).
01 ANOTHER-GROUP.
   05 VARIANT-1B    PIC X(100).

PROCEDURE DIVISION.