IDENTIFICATION DIVISION.
  PROGRAM-ID. perform-program.
  
PROCEDURE DIVISION.

*  // Basic PERFORM with scope
* //////////////////////////////
PERFORM
  DISPLAY 'test'
END-PERFORM

*  // Basic PERFORM procedure
* /////////////////////////////
PERFORM procedurename

.