IDENTIFICATION DIVISION.
************************
  PROGRAM-ID. Simple IS INITIAL PROGRAM.
  AUTHOR.       WIZTIGERS.
  DATE-WRITTEN. NOVEMBER 2015

ENVIRONMENT DIVISION.
*********************
CONFIGURATION SECTION.

DATA DIVISION.
**************
WORKING-STORAGE SECTION.
01  STR    PIC X(08) VALUE 'THIS'.
01  GROUP  PIC X(08).
 77  VRAI  PIC 9 VALUE 1.
 77  FAUX  PIC 9 VALUE 0.
 77  NUM   PIC 9.
 77  STR   PIC X(15) VALUE 'THAT'.

LINKAGE SECTION.

PROCEDURE DIVISION.
*******************
DISPLAY 'TEST'
MOVE 0    TO NUM
MOVE FAUX TO NUM

EVALUATE VAR-A
  WHEN X
    DISPLAY 'I CAN HAS X'
	CALL 'XXX'
  WHEN Y
  WHEN V
    DISPLAY 'BOUNCE! BOUNCE!'
	CALL 'VVVVVVV'
  WHEN OTHER
    DISPLAY 'ERROR'
    CALL 'ABENDS'
END-EVALUATE
.