IDENTIFICATION DIVISION.
************************
  PROGRAM-ID. Simple IS INITIAL PROGRAM.
  AUTHOR.       WIZTIGERS.
  DATE-WRITTEN. NOVEMBER 2015

ENVIRONMENT DIVISION.
*********************
CONFIGURATION SECTION.
  SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
  SOURCE-COMPUTER. IBM-3033.
INPUT-OUTPUT SECTION.

DATA DIVISION.
**************
WORKING-STORAGE SECTION.
01  str    PIC X(08) VALUE 'THIS'.
01  group  PIC X(08).
 77  vrai  PIC 9 VALUE 1.
 77  faux  PIC 9 VALUE 0.
 77  num   PIC 9.
 77  str   PIC X(15) VALUE 'THAT'.

01  sqlcode  PIC ZZ9+ BLANK WHEN ZERO.
  EXEC SQL DECLARE tablename TABLE
  (
    num  DECIMAL(45) NOT NULL,
    str  VARCHAR(256) NOT NULL
  ) END-EXEC

01  toto  PIC X(08).


LINKAGE SECTION.

PROCEDURE DIVISION.
*******************
DISPLAY 'TEST'
MOVE faux TO num
.