       01 :DVZOSM:.
           05 :DVZOSM:-Zone pic X(120).
           05 :DVZOSM:-Zone-Redef REDEFINES :DVZOSM:-Zone.
              10 Var1 PIC X(20).
      * Should be 100 but won't be altered by refactor on including pgm
              10 FILLER PIC X(50).
