JSON GENERATE x FROM y END-JSON

JSON GENERATE x FROM y
EXCEPTION MOVE 1 TO ret-code
END-JSON

JSON GENERATE x FROM y
ON EXCEPTION MOVE 1 TO ret-code
END-JSON

JSON GENERATE x FROM y
NOT EXCEPTION MOVE 0 TO ret-code
END-JSON

JSON GENERATE x FROM y
NOT ON EXCEPTION MOVE 0 TO ret-code
END-JSON

JSON GENERATE x FROM y
EXCEPTION MOVE 1 TO ret-code
NOT EXCEPTION MOVE 0 TO ret-code
END-JSON

JSON GENERATE x FROM y
ON EXCEPTION MOVE 1 TO ret-code
NOT EXCEPTION MOVE 0 TO ret-code
END-JSON

JSON GENERATE x FROM y
EXCEPTION MOVE 1 TO ret-code
NOT ON EXCEPTION MOVE 0 TO ret-code
END-JSON

JSON GENERATE x FROM y
ON EXCEPTION MOVE 1 TO ret-code
NOT ON EXCEPTION MOVE 0 TO ret-code
END-JSON
