       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHAPEFCT.
       AUTHOR. JCM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370
           .
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TRANSFORM TYPEDEF STRICT PUBLIC PIC 9(01).
           88 TRANSLATE VALUE 1.
           88 ROTATE VALUE 2.
       PROCEDURE DIVISION.
       DECLARE PROCEDURE ComputeArea PUBLIC
               INPUT    InputData         Type SHAPETYP::POINT
               OUTPUT   Val               PIC 9(4) COMP-5.
               .
       END-DECLARE.
       DECLARE PROCEDURE ComputeArea PUBLIC
               INPUT    InputData         Type SHAPETYP::LINEAR
               OUTPUT   Val               PIC 9(4) COMP-5.
               .
       END-DECLARE.
       DECLARE PROCEDURE ComputeArea PUBLIC
               INPUT    InputData         Type SHAPETYP::TRIANGLE
               OUTPUT   Val               PIC 9(4) COMP-5.
               .
       END-DECLARE.
       DECLARE PROCEDURE ComputeArea PUBLIC
               INPUT    InputData         Type SHAPETYP::RECTANGLE
               OUTPUT   Val               PIC 9(4) COMP-5.
               .
       END-DECLARE.
       END PROGRAM SHAPEFCT.
      