000280*01  YISCTST.                                                     00280000
000290     05 TST-ISC-LL                          PIC 9(4) COMP.        00290000
000300     05 TST-ISC-CODE-MVS                    PIC XX.               00300000
000310     05 TST-ISC-CODE-IMS                    PIC XX.               00310000
000320     05 TST-ISC-CODE-CENTRE                 PIC XX.               00320000
000330     05 TST-ISC-NOM.                                              00330000
000330         10 TST-ISC-NOM-FULL                PIC X(10).            00330000