       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY YData01.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM MyPgm.