       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       replace ==A== by ==
       01==.
       A Group1.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM MyPgm.