       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 Group1. COPY YData05.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM MyPgm.