       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 a pic X.
       01 b pic X.
       PROCEDURE DIVISION.
           COPY YCode.
           GOBACK
           .
       END PROGRAM MyPgm.