Simplified Codegen for reference only. DO NOT ATTEMPT TO BUILD, DO NOT DEPLOY !
      *TypeCobol_Version:[[ParserVersion]]
       identification division.
       program-id. TCOSMPL2.
       data division.
       working-storage section.
       01 TypeCobol-Generated.
           05 TC-DVZTEST1 pic X(08) value 'DVZTEST1'.
           05 DVZTEST1-Fct-a93b0351-GetTecMs pic X(30)
                value 'Fct=a93b0351-GetTecMsg'.
                               
      *01 type1 typedef strict private.
      *05 blabla pic X.
      *01 NSpan     TYPE DVZTEST1::NamedSpanArray.
       01 NSpan.
           02 namedSpan.
             03 name pic X(10).
             03 group1.
               04 span.
                05  ptr Pointer.
                05  redefines ptr.
                    06  ptrdbef1f3d pic S9(05) comp-5.
                 05 len pic S9(5) comp-5.
                    88 isEmpty value 0.
                    88 isEndPack value -1 -2.
                    88 isOverflow value -2.
                                                  
      
      *01 s1 type DVZTEST2::Span.
       01 s1.
          02  ptr Pointer.
          02  redefines ptr.
              03  ptrdbef1f3d pic S9(05) comp-5.
           02 len pic S9(5) comp-5.
              88 isEmpty value 0.
              88 isEndPack value -1 -2.
              88 isOverflow value -2.
                                 
      *01 dat type date.
       01 dat.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
                        
      *01 t1 type DVZTEST2::Span.
       01 t1.
          02  ptr Pointer.
          02  redefines ptr.
              03  ptrdbef1f3d pic S9(05) comp-5.
           02 len pic S9(5) comp-5.
              88 isEmpty value 0.
              88 isEndPack value -1 -2.
              88 isOverflow value -2.
                                 
       LINKAGE SECTION.
       01 TC-FunctionCode pic X(30).
      * Function which call program ea2e07d4
      * Which is generated code for TCOSMPL2.GetTecMsg
           88 Fct-ea2e07d4-GetTecMsg
              value 'Fct=ea2e07d4-GetTecMsg'.
       01 arg1 PIC X.
       01 arg2 PIC X.

      
       procedure division USING TC-FunctionCode
                          arg1
                          arg2.

           PERFORM INIT-LIBRARY
           PERFORM FctList-Process-Mode
           GOBACK.

       FctList-Process-Mode.
           evaluate true
              when Fct-ea2e07d4-GetTecMsg
                 call 'ea2e07d4' using arg1
                                        arg2
              when other
                 Perform Handle-Error
           end-evaluate
               .
       Handle-Error.
           continue
           .
                          
       INIT-LIBRARY.
      
      *    call DVZTEST1::GetTecMsg INPUT t1
      *    in-out s1
           CALL TC-DVZTEST1 USING
                    DVZTEST1-Fct-a93b0351-GetTecMs
                                 t1
                    by reference s1
           end-call
                    
      
      *    call GetTecMsg input t1
      *    in-out s1
           CALL 'ea2e07d4' USING
                                 t1
                    by reference s1
           end-call
                    
      
      
           goback.
      *----------------------------------------------------------------
      *declare procedure GetTecMsg public
      *    input capt     type DVZTEST2::Span
      *    in-out msg     type DVZTEST2::Span
      *    .
      
      *
      *declare procedure GetTecMsg public
      *    input capt     type DVZTEST2::Span
      *    in-out msg     type DVZTEST2::Span
      *    .
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ea2e07d4 IS COMMON.
       DATA DIVISION.
       LINKAGE SECTION.
      *TCOSMPL2.GetTecMsg - Params :
      *     input(capt: DVZTEST2.Span)
      *     in-out(msg: DVZTEST2.Span)
       01 capt.
          02  ptr Pointer.
          02  redefines ptr.
              03  ptrdbef1f3d pic S9(05) comp-5.
           02 len pic S9(5) comp-5.
              88 isEmpty value 0.
              88 isEndPack value -1 -2.
              88 isOverflow value -2.
       01 msg.
          02  ptr Pointer.
          02  redefines ptr.
              03  ptrdbef1f3d pic S9(05) comp-5.
           02 len pic S9(5) comp-5.
              88 isEmpty value 0.
              88 isEndPack value -1 -2.
              88 isOverflow value -2.
       PROCEDURE DIVISION
             USING BY REFERENCE capt
                   BY REFERENCE msg
           .
      *TCOSMPL2.GetTecMsg - Params :
      *     input(capt: DVZTEST2.Span)
      *     in-out(msg: DVZTEST2.Span)
           continue
           .
       END PROGRAM ea2e07d4.


       end program TCOSMPL2.
