       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       REPLACE ==:suffix:== BY ==editThat==.
       COPY YReplace.
       END PROGRAM DVZF0OSM.