Simplified Codegen for reference only. DO NOT ATTEMPT TO BUILD, DO NOT DEPLOY !
      *TypeCobol_Version:[[ParserVersion]]
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.

       DATA DIVISION.
       Working-STORAGE SECTION.
       01 TypeCobol-Generated.
           05 TC-Callee pic X(08) value 'CALLEE'.
           05 Callee-Fct-ebb060ea-MyPublicPr pic X(30)
                value 'Fct=ebb060ea-MyPublicProcedure'.
           05 Callee-Fct-ca0ab46c-check pic X(30)
                value 'Fct=ca0ab46c-check'.
                               

      *01  somedate     TYPE Date.
       01 somedate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
                                  
       01  someformat   PIC X(08).
      *01  flag         TYPE Bool.
       01  flag-value PIC X VALUE LOW-VALUE.
           88  flag       VALUE 'T'.
           88  flag-false VALUE 'F'
                           X'00' thru 'S'
                           'U' thru X'FF'.
                                  
       01  realformat   PIC X(08).
      *01  W-TechCtx    TYPE CALLEE::TechnicalContext.
       01 W-TechCtx.
           02 TechName PIC X(8).
           02 Site.
             03 SiteName PIC X(8).
                                                      

       PROCEDURE DIVISION.


      *MOVE W-TechCtx::Site::SiteName TO someformat.
       MOVE SiteName OF Site OF W-TechCtx TO someformat.

      *declare procedure check private
      *   input mydate        TYPE Date
      *  .

      *DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
      *    INPUT mydate        TYPE Date
      *          format        PIC X(08)
      *   OUTPUT okay          TYPE Bool
      *          actual-format PIC X(08).
      *  .

       TRAITEMENT.
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
      *    CALL Callee::MyPublicProcedure
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL 'zcallpgm' using TC-Callee
                    Callee-Fct-ebb060ea-MyPublicPr
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                   
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
      *    CALL CALLEE::MyPublicProcedure
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL 'zcallpgm' using TC-Callee
                    Callee-Fct-ebb060ea-MyPublicPr
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                   
         
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
      *    CALL Pgm1PrivateValidateDateFormat
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL 'fde394fb' USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                  
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
      *    CALL PGM1::Pgm1PrivateValidateDateFormat
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL 'fde394fb' USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                  


      *OK  call check of PGM1
      *   call check input somedate
          CALL 'a0508f35' USING
                                 somedate
           end-call
                                   
      *OK 
      *   call PGM1::check input somedate
          CALL 'a0508f35' USING
                                 somedate
           end-call
                                         
      *OK 
      *   call Callee::check input somedate
          CALL 'zcallpgm' using TC-Callee
                    Callee-Fct-ca0ab46c-check
                                 somedate
           end-call
                                           
        .
      *
      *declare procedure check private
      *   input mydate        TYPE Date
      *  .
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. a0508f35 IS COMMON.
       DATA DIVISION.
       LINKAGE SECTION.
      *PGM1.check - Params :
      *     input(mydate: DATE)
       01 mydate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
       PROCEDURE DIVISION
             USING BY REFERENCE mydate
           .
      *PGM1.check - Params :
      *     input(mydate: DATE)
           CONTINUE.
       END PROGRAM a0508f35.


      *
      *DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
      *    INPUT mydate        TYPE Date
      *          format        PIC X(08)
      *   OUTPUT okay          TYPE Bool
      *          actual-format PIC X(08).
      *  .
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. fde394fb IS COMMON.
       DATA DIVISION.
       LINKAGE SECTION.
      *PGM1.Pgm1PrivateValidateDateFormat - Params :
      *     input(mydate: DATE, format: pic X(08))
      *     output(okay: BOOL, actual-format: pic X(08))
       01 mydate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
       01 format PIC X(08).
       01 okay-value PIC X     VALUE LOW-VALUE.
           88 okay       VALUE 'T'.
           88 okay-false VALUE 'F'
                             X'00' thru 'S'
                             'U' thru X'FF'.
       01 actual-format PIC X(08).
       PROCEDURE DIVISION
             USING BY REFERENCE mydate
                   BY REFERENCE format
                   BY REFERENCE okay-value
                   BY REFERENCE actual-format
           .
      *PGM1.Pgm1PrivateValidateDateFormat - Params :
      *     input(mydate: DATE, format: pic X(08))
      *     output(okay: BOOL, actual-format: pic X(08))
           CONTINUE.
       END PROGRAM fde394fb.


       END PROGRAM PGM1.

