       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.

       DATA DIVISION.
       Working-STORAGE SECTION.

      *01  somedate     TYPE Date.
       01 somedate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
                                  
       01  someformat   PIC X(08).
      *01  flag         TYPE Bool.
       01  flag-value PIC X VALUE LOW-VALUE.
           88  flag       VALUE 'T'.
           88  flag-false VALUE 'F'.
                                  
       01  realformat   PIC X(08).
      *01  W-TechCtx    TYPE CALLEE::TechnicalContext.
       01 W-TechCtx.
           02 TechName PIC X(8).
           02 Site.
             03 SiteName PIC X(8).
                                                      
       01  TC-Callee-FctList-Loaded PIC X(02) EXTERNAL.
           88 TC-Callee-FctList-IsLoaded      VALUE 'OK'.
      *Callee::MyPublicProcedure
        01 TC-Callee-ebb060ea PROCEDURE-POINTER EXTERNAL.
      *Callee::check
        01 TC-Callee-ca0ab46c PROCEDURE-POINTER EXTERNAL.


       PROCEDURE DIVISION.
      *
           PERFORM TC-Initializations

                          


      *MOVE W-TechCtx::Site::SiteName TO someformat.
       MOVE SiteName OF Site OF W-TechCtx TO someformat.

      *declare procedure check private
      *   input mydate        TYPE Date
      *  .

      *DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
      *    INPUT mydate        TYPE Date
      *          format        PIC X(08)
      *   OUTPUT okay          TYPE Bool
      *          actual-format PIC X(08).
      *  .

       TRAITEMENT.
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
      *    CALL Callee::MyPublicProcedure
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL TC-Callee-ebb060ea USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                   
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
      *    CALL CALLEE::MyPublicProcedure
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL TC-Callee-ebb060ea USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                   
         
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
      *    CALL Pgm1PrivateValidateDateFormat
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL 'fde394fbPgm1PrivateValidateDat' USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                  
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
      *    CALL PGM1::Pgm1PrivateValidateDateFormat
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL 'fde394fbPgm1PrivateValidateDat' USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                  


      *OK  call check of PGM1
      *   call check input somedate
          CALL 'a0508f35check' USING
                                 somedate
           end-call
                                   
      *OK 
      *   call PGM1::check input somedate
          CALL 'a0508f35check' USING
                                 somedate
           end-call
                                         
      *OK 
      *   call Callee::check input somedate
          CALL TC-Callee-ca0ab46c USING
                                 somedate
           end-call
                                           
        .
      *=================================================================
        TC-Initializations.
      *=================================================================
            IF NOT TC-Callee-FctList-IsLoaded
                CALL 'ZCALLPGM' USING 'Callee'
            END-IF
            .

       END PROGRAM PGM1.

      *
      *declare procedure check private
      *   input mydate        TYPE Date
      *  .
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. a0508f35check.
       DATA DIVISION.
       LINKAGE SECTION.
       01 mydate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
       PROCEDURE DIVISION
             USING BY REFERENCE mydate
           .
           CONTINUE.
       END PROGRAM a0508f35check.
      *
      *DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
      *    INPUT mydate        TYPE Date
      *          format        PIC X(08)
      *   OUTPUT okay          TYPE Bool
      *          actual-format PIC X(08).
      *  .
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. fde394fbPgm1PrivateValidateDat.
       DATA DIVISION.
       LINKAGE SECTION.
       01 mydate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
       01 format PIC X(08).
       01 okay-value PIC X     VALUE LOW-VALUE.
           88 okay       VALUE 'T'.
           88 okay-false VALUE 'F'.
       01 actual-format PIC X(08).
       PROCEDURE DIVISION
             USING BY REFERENCE mydate
                   BY REFERENCE format
                   BY REFERENCE okay-value
                   BY REFERENCE actual-format
           .
           CONTINUE.
       END PROGRAM fde394fbPgm1PrivateValidateDat.
