      *TypeCobol_Version:v0.0.0-local
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.

       DATA DIVISION.
       Working-STORAGE SECTION.
       01 TC-Callee pic X(08) value 'CALLEE'.
       01 TC-Call          PIC X VALUE 'T'.
           88 TC-FirstCall  VALUE 'T'.
           88 TC-NthCall    VALUE 'F'
                            X'00' thru 'S'
                            'U' thru X'FF'.

                               

      *01  somedate     TYPE Date.
       01 somedate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
                                  
       01  someformat   PIC X(08).
      *01  flag         TYPE Bool.
       01  flag-value PIC X VALUE LOW-VALUE.
           88  flag       VALUE 'T'.
           88  flag-false VALUE 'F'
                           X'00' thru 'S'
                           'U' thru X'FF'.
                                  
       01  realformat   PIC X(08).
      *01  W-TechCtx    TYPE CALLEE::TechnicalContext.
       01 W-TechCtx.
           02 TechName PIC X(8).
           02 Site.
             03 SiteName PIC X(8).
                                                      
       LINKAGE SECTION.
      *Common to all librairies used by the program.
       01 TC-Library-PntTab.
          05 TC-Library-PntNbr          PIC S9(04) COMP.
          05 TC-Library-Item OCCURS 1000
                               DEPENDING ON TC-Library-PntNbr
                               INDEXED   BY TC-Library-Idx.
              10 TC-Library-Item-Idt      PIC X(08).
              10 TC-Library-Item-Pnt      PROCEDURE-POINTER.

      *To call program ebb060ea in module Callee
      *Which is generated code for Callee.MyPublicProcedure
      *Declared in source file Callee.rdz.tcbl
       01 TC-Callee-ebb060ea-Item.
          05 TC-Callee-ebb060ea-Idt PIC X(08).
          05 TC-Callee-ebb060ea PROCEDURE-POINTER.
      *To call program ca0ab46c in module Callee
      *Which is generated code for Callee.check
      *Declared in source file Callee.rdz.tcbl
       01 TC-Callee-ca0ab46c-Item.
          05 TC-Callee-ca0ab46c-Idt PIC X(08).
          05 TC-Callee-ca0ab46c PROCEDURE-POINTER.


       PROCEDURE DIVISION.
      *
           PERFORM TC-INITIALIZATIONS

                          


      *MOVE W-TechCtx::Site::SiteName TO someformat.
       MOVE SiteName OF Site OF W-TechCtx TO someformat.

      *declare procedure check private
      *   input mydate        TYPE Date
      *  .

      *DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
      *    INPUT mydate        TYPE Date
      *          format        PIC X(08)
      *   OUTPUT okay          TYPE Bool
      *          actual-format PIC X(08).
      *  .

       TRAITEMENT.
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
      *    CALL Callee::MyPublicProcedure
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           
           IF ADDRESS OF TC-Callee-ebb060ea-Item = NULL
             OR TC-Callee-ebb060ea-Idt not = 'ebb060ea'
               PERFORM TC-LOAD-POINTERS-Callee
           END-IF
      *    Equivalent to call ebb060ea in module Callee
           CALL TC-Callee-ebb060ea USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                   
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
      *    CALL CALLEE::MyPublicProcedure
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           
           IF ADDRESS OF TC-Callee-ebb060ea-Item = NULL
             OR TC-Callee-ebb060ea-Idt not = 'ebb060ea'
               PERFORM TC-LOAD-POINTERS-Callee
           END-IF
      *    Equivalent to call ebb060ea in module Callee
           CALL TC-Callee-ebb060ea USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                   
         
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
      *    CALL Pgm1PrivateValidateDateFormat
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL 'fde394fb' USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                  
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
      *    CALL PGM1::Pgm1PrivateValidateDateFormat
      *             INPUT      somedate someformat
      *             OUTPUT     flag     realformat
           CALL 'fde394fb' USING
                                 somedate
                                 someformat
                    by reference flag-value
                                 realformat
           end-call
                                                  


      *OK  call check of PGM1
      *   call check input somedate
          CALL 'a0508f35' USING
                                 somedate
           end-call
                                   
      *OK 
      *   call PGM1::check input somedate
          CALL 'a0508f35' USING
                                 somedate
           end-call
                                         
      *OK 
      *   call Callee::check input somedate
          
           IF ADDRESS OF TC-Callee-ca0ab46c-Item = NULL
             OR TC-Callee-ca0ab46c-Idt not = 'ca0ab46c'
               PERFORM TC-LOAD-POINTERS-Callee
           END-IF
      *    Equivalent to call ca0ab46c in module Callee
           CALL TC-Callee-ca0ab46c USING
                                 somedate
           end-call
                                           
        .
      *=================================================================
       TC-INITIALIZATIONS.
      *=================================================================
            IF TC-FirstCall
                 SET TC-NthCall TO TRUE
                 SET ADDRESS OF TC-Callee-ebb060ea-Item  TO NULL
                 SET ADDRESS OF TC-Callee-ca0ab46c-Item  TO NULL
            END-IF
            .
      *=================================================================
        TC-LOAD-POINTERS-Callee.
      *=================================================================
            CALL 'ZCALLPGM' USING TC-Callee
            ADDRESS OF TC-Library-PntTab
            PERFORM VARYING TC-Library-Idx FROM 1 BY 1
            UNTIL TC-Library-Idx > TC-Library-PntNbr
                EVALUATE TC-Library-Item-Idt (TC-Library-Idx)
                WHEN 'ebb060ea'
                     SET ADDRESS OF
                     TC-Callee-ebb060ea-Item
                     TO ADDRESS OF
                     TC-Library-Item(TC-Library-Idx)
                WHEN 'ca0ab46c'
                     SET ADDRESS OF
                     TC-Callee-ca0ab46c-Item
                     TO ADDRESS OF
                     TC-Library-Item(TC-Library-Idx)
                WHEN OTHER
                     CONTINUE
                END-EVALUATE
            END-PERFORM
            .

       END PROGRAM PGM1.

      *
      *declare procedure check private
      *   input mydate        TYPE Date
      *  .
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. a0508f35.
       DATA DIVISION.
       LINKAGE SECTION.
      *PGM1.check - Params :
      *     input(mydate: DATE)
       01 mydate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
       PROCEDURE DIVISION
             USING BY REFERENCE mydate
           .
      *PGM1.check - Params :
      *     input(mydate: DATE)
           CONTINUE.
       END PROGRAM a0508f35.
      *
      *DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
      *    INPUT mydate        TYPE Date
      *          format        PIC X(08)
      *   OUTPUT okay          TYPE Bool
      *          actual-format PIC X(08).
      *  .
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. fde394fb.
       DATA DIVISION.
       LINKAGE SECTION.
      *PGM1.Pgm1PrivateValidateDateFormat - Params :
      *     input(mydate: DATE, format: pic X(08))
      *     output(okay: BOOL, actual-format: pic X(08))
       01 mydate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
       01 format PIC X(08).
       01 okay-value PIC X     VALUE LOW-VALUE.
           88 okay       VALUE 'T'.
           88 okay-false VALUE 'F'
                             X'00' thru 'S'
                             'U' thru X'FF'.
       01 actual-format PIC X(08).
       PROCEDURE DIVISION
             USING BY REFERENCE mydate
                   BY REFERENCE format
                   BY REFERENCE okay-value
                   BY REFERENCE actual-format
           .
      *PGM1.Pgm1PrivateValidateDateFormat - Params :
      *     input(mydate: DATE, format: pic X(08))
      *     output(okay: BOOL, actual-format: pic X(08))
           CONTINUE.
       END PROGRAM fde394fb.
