       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOBCOMP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MAIN-GROUP OCCURS 10.
      * should suggest: matching variables and sender type
          05 SAY_VAR1              PIC 9.
          05 GROUP1 OCCURS 10.
             10 VAR2_SAY           PIC 99.
          05 VAR3_SAY_VAR3         PIC 9(2).
          05 GROUP2 OCCURS 10 INDEXED BY SAY_INDEX
                                   PIC X.
      * should not suggest: not matching variables, 88, sender type
          05 VAR5                  PIC 9.
          05 VAR6SAY               PIC 9.
          05 GROUP3.
             10 VAR7               PIC 9.
                88 SAY88-YES              VALUE 1.
                88 SAY88-NO               VALUE 0.
          05 SAY_POINTER USAGE POINTER.
          05 SAY_POINTER-32 USAGE POINTER-32.
          05 VAR4_SAY              PIC X.
          05 SAY_FUNCTION-POINTER USAGE FUNCTION-POINTER.
          05 SAY_SENDER            PIC 9.

       PROCEDURE DIVISION.
       MAIN.
           MOVE SAY_SENDER TO SAY
           GOBACK
           .
      * should not suggest: paragraph
       P_SAY_HELLO.
           DISPLAY "Hello"
           .
      * should not suggest: section
       S_SAY_CONTINUE SECTION.
           CONTINUE
           .

       END PROGRAM TCOBCOMP.
---------------------------------------------------------------------------------
{"line":27,"character":33}
---------------------------------------------------------------------------------
[
  {
    "label": "SAY_INDEX (Numeric) (MAIN-GROUP::GROUP2::SAY_INDEX)",
    "kind": 6,
    "insertText": "MAIN-GROUP::GROUP2::SAY_INDEX",
    "data": {
      "start": {
        "line": 27,
        "character": 30
      },
      "end": {
        "line": 27,
        "character": 33
      }
    }
  },
  {
    "label": "SAY_VAR1 (Numeric) (MAIN-GROUP::SAY_VAR1()",
    "kind": 6,
    "insertText": "MAIN-GROUP::SAY_VAR1(",
    "data": {
      "start": {
        "line": 27,
        "character": 30
      },
      "end": {
        "line": 27,
        "character": 33
      }
    }
  },
  {
    "label": "VAR2_SAY (Numeric) (MAIN-GROUP::GROUP1::VAR2_SAY(, ))",
    "kind": 6,
    "insertText": "MAIN-GROUP::GROUP1::VAR2_SAY(, )",
    "data": {
      "start": {
        "line": 27,
        "character": 30
      },
      "end": {
        "line": 27,
        "character": 33
      }
    }
  },
  {
    "label": "VAR3_SAY_VAR3 (Numeric) (MAIN-GROUP::VAR3_SAY_VAR3()",
    "kind": 6,
    "insertText": "MAIN-GROUP::VAR3_SAY_VAR3(",
    "data": {
      "start": {
        "line": 27,
        "character": 30
      },
      "end": {
        "line": 27,
        "character": 33
      }
    }
  }
]