       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOBCOMP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * should suggest: matching variables and ZERO type
       01 SAY-VAR1              PIC x.
       01 GROUP1-SAY.
          05 VAR2-SAY           PIC AA.
       01 VAR3-SAY-VAR3         PIC X(2).
       01 VAR4-SAY              PIC 9.
       01 GROUP2 OCCURS 10 INDEXED BY SAY-INDEX
                                PIC X.
       01 SAY-FUNCTION-POINTER USAGE FUNCTION-POINTER.
       01 SAY-POINTER USAGE POINTER.
      * should not suggest: not matching variables, not ZERO type, 88
       01 VAR5                  PIC X.
       01 VAR6SAY               PIC A.
       01 VAR7-SAY              PIC N.
       01 GROUP3.
          05 VAR8               PIC 9.
             88 SAY88-YES              VALUE 1.
             88 SAY88-NO               VALUE 0.

       PROCEDURE DIVISION.
       MAIN.
           MOVE ZERO TO SAY
           GOBACK
           .
      * should not suggest: paragraph
       P-SAY-HELLO.
           DISPLAY "Hello"
           .
      * should not suggest: section
       S-SAY-CONTINUE SECTION.
           CONTINUE
           .

       END PROGRAM TCOBCOMP.
---------------------------------------------------------------------------------
{"line":25,"character":27}
---------------------------------------------------------------------------------
[
  {
    "label": "GROUP1-SAY (Alphanumeric) (GROUP1-SAY)",
    "kind": 6,
    "insertText": "GROUP1-SAY",
    "data": {
      "start": {
        "line": 25,
        "character": 24
      },
      "end": {
        "line": 25,
        "character": 27
      }
    }
  },
  {
    "label": "SAY-FUNCTION-POINTER (Alphanumeric) (SAY-FUNCTION-POINTER)",
    "kind": 6,
    "insertText": "SAY-FUNCTION-POINTER",
    "data": {
      "start": {
        "line": 25,
        "character": 24
      },
      "end": {
        "line": 25,
        "character": 27
      }
    }
  },
  {
    "label": "SAY-INDEX (Numeric) (GROUP2::SAY-INDEX)",
    "kind": 6,
    "insertText": "GROUP2::SAY-INDEX",
    "data": {
      "start": {
        "line": 25,
        "character": 24
      },
      "end": {
        "line": 25,
        "character": 27
      }
    }
  },
  {
    "label": "SAY-POINTER (Alphanumeric) (SAY-POINTER)",
    "kind": 6,
    "insertText": "SAY-POINTER",
    "data": {
      "start": {
        "line": 25,
        "character": 24
      },
      "end": {
        "line": 25,
        "character": 27
      }
    }
  },
  {
    "label": "SAY-VAR1 (Alphanumeric) (SAY-VAR1)",
    "kind": 6,
    "insertText": "SAY-VAR1",
    "data": {
      "start": {
        "line": 25,
        "character": 24
      },
      "end": {
        "line": 25,
        "character": 27
      }
    }
  },
  {
    "label": "VAR2-SAY (Alphabetic) (GROUP1-SAY::VAR2-SAY)",
    "kind": 6,
    "insertText": "GROUP1-SAY::VAR2-SAY",
    "data": {
      "start": {
        "line": 25,
        "character": 24
      },
      "end": {
        "line": 25,
        "character": 27
      }
    }
  },
  {
    "label": "VAR3-SAY-VAR3 (Alphanumeric) (VAR3-SAY-VAR3)",
    "kind": 6,
    "insertText": "VAR3-SAY-VAR3",
    "data": {
      "start": {
        "line": 25,
        "character": 24
      },
      "end": {
        "line": 25,
        "character": 27
      }
    }
  },
  {
    "label": "VAR4-SAY (Numeric) (VAR4-SAY)",
    "kind": 6,
    "insertText": "VAR4-SAY",
    "data": {
      "start": {
        "line": 25,
        "character": 24
      },
      "end": {
        "line": 25,
        "character": 27
      }
    }
  }
]