      *TypeCobol_Version:[[ParserVersion]]
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
      
       DATA DIVISION.
       Working-STORAGE SECTION.
      
      *01 ConventionalTypeDefInMainProgram TYPEDEF STRICT PUBLIC.
      *    05 DATA1 PIC X.
      *    05 DATA2 PIC X.
      
      *01 CopyTypeDefInMainProgram TYPEDEF STRICT PUBLIC.
      *    COPY YPRTD20 REPLACING
      *    ==:Foo:==
      *    BY ==Flouf==.
      
      *01 MyCopiesInsideTypeDef TYPE DVZDEP1::CopiesInsideTypeDef.
       01 MyCopiesInsideTypeDef.
            COPY YCONVEA.
           02 MyVar1 PIC X.
            COPY YPRTD20 REPLACING CHARACTERS
                BY i CHARACTERS BY j CHARACTERS BY k.
                                                                  
      *01 MyCopyInsideContainerInsideTypeDef
      *    TYPE DVZDEP1::CopyInsideContainerInsideTypeDef.
       01 MyCopyInsideContainerInsideTypeDef.
           02 CONTAINER.
            COPY YCONVEA REPLACING
            ==:Foo:==
           BY
                ==Too
               ==.
                                                          
      
      *01 MyTypeDefUsingCopyInsideTypeDef
      *    TYPE DVZDEP2::TypeDefUsingCopyInsideTypeDef.
       01 MyTypeDefUsingCopyInsideTypeDef.
           02 MyCopyInsideTypeDef.
            COPY YCONVEA.
             03 MyVar1 PIC X.
            COPY YPRTD20 REPLACING CHARACTERS
                BY i CHARACTERS BY j CHARACTERS BY k.
                                                       
      
       01 ConventialCopy.
           COPY YCONVEA
           REPLACING
           ==:Foo:==
           BY
            ==Soo==.
      
      *01 MyConventionalTypeDef
      *    TYPE DVZDEP1::ConventionalTypeDefInDependency.
       01 MyConventionalTypeDef.
           02 firstname PIC X(20).
           02 lastname PIC X(20).
                                                         

      *01 myVar2 TYPE DVZDEP1::Type2.
       01 myVar2.
          COPY SUPCPY.
                                     
	   
       PROCEDURE DIVISION.
      *     MOVE 'X' TO MyCopiesInsideTypeDef::CONVEA
            MOVE 'X' TO CONVEA OF MyCopiesInsideTypeDef
      *     MOVE 'X' TO
      *         MyCopyInsideContainerInsideTypeDef::CONTAINER::CONVEA
            MOVE 'X' TO
                CONVEA OF CONTAINER OF 
                                      MyCopyInsideContainerInsideTypeDef
      *     MOVE 'X' TO
      *      myVar2::varA-2::varB-22::CONVEA::CONVEA-SUB::CONVEA-SUB-1
            MOVE 'X' TO
             CONVEA-SUB-1 OF CONVEA-SUB OF CONVEA OF varB-22 OF varA-2
              OF myVar2
            .

      *declare procedure MyProc
      *     input myType1 type DVZDEP1::Type1.

      *declare procedure MyProc2
      *    input myType2 type DVZDEP1::Type2.

       END PROGRAM PGM1.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGMSTK1.
      
       DATA DIVISION.
       Working-STORAGE SECTION.
      *01 MyCopyInsideTypeDef
      *    TYPE PGM1::ConventionalTypeDefInMainProgram.
       01 MyCopyInsideTypeDef.
           02 DATA1 PIC X.
           02 DATA2 PIC X.
                                                       
      
      *01 MyCopyTypeDefInMainProgram
      *    TYPE PGM1::CopyTypeDefInMainProgram.
       01 MyCopyTypeDefInMainProgram.
           COPY YPRTD20 REPLACING
           ==:Foo:==
           BY ==Flouf==.
                                               
      
       PROCEDURE DIVISION.
            .
       END PROGRAM PGMSTK1.
      *
      *declare procedure MyProc
      *     input myType1 type DVZDEP1::Type1.
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. cd31ff38.
       DATA DIVISION.
       LINKAGE SECTION.
      *PGM1.MyProc - Params :
      *     input(myType1: DVZDEP1.Type1)
       01 myType1.
           02 Body.
          COPY YCONVEA.
           02 Part1.
          COPY YPRTD20.
           02 Part2.
          COPY YCONVEA.
       PROCEDURE DIVISION
             USING BY REFERENCE myType1
           .
      *PGM1.MyProc - Params :
      *     input(myType1: DVZDEP1.Type1)
           DISPLAY myType1
           .
       END PROGRAM cd31ff38.
      *
      *declare procedure MyProc2
      *    input myType2 type DVZDEP1::Type2.
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. a82f46f0.
       DATA DIVISION.
       LINKAGE SECTION.
      *PGM1.MyProc2 - Params :
      *     input(myType2: DVZDEP1.Type2)
       01 myType2.
          COPY SUPCPY.
       PROCEDURE DIVISION
             USING BY REFERENCE myType2
           .
      *PGM1.MyProc2 - Params :
      *     input(myType2: DVZDEP1.Type2)
           DISPLAY myType2
           .
       END PROGRAM a82f46f0.
