       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOBCOMP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * should suggest: matching variables + numeric and valid usage
       01 SAY_VAR1              PIC 9.
       01 GROUP1.
          05 VAR2_SAY           PIC 99.
       01 VAR3_SAY_VAR3         PIC 9(2).
       01 SAY_POINTER USAGE POINTER.
       01 SAY_POINTER-32 USAGE POINTER-32.
       01 GROUP2.
          05 VAR4               PIC 9.
             88 SAY88-YES              VALUE 1.
             88 SAY88-NO               VALUE 0.
       01 GROUP2 OCCURS 10 INDEXED BY SAY_INDEX
                                PIC X.
      * should not suggest: not matching, not numeric, invalid usage
       01 VAR5                  PIC 9.
       01 VAR6_SAY              PIC X.
       01 SAY_FUNCTION-POINTER USAGE FUNCTION-POINTER.

       PROCEDURE DIVISION.
       MAIN.
           SET SAY
           GOBACK
           .
      * should not suggest: paragraph
       P_SAY_HELLO.
           DISPLAY "Hello"
           .
      * should not suggest: section
       S_SAY_CONTINUE SECTION.
           CONTINUE
           .

       END PROGRAM TCOBCOMP.
---------------------------------------------------------------------------------
{"line":24,"character":18}
---------------------------------------------------------------------------------
[
  {
    "label": "SAY_VAR1 (Numeric) (SAY_VAR1)",
    "kind": 6,
    "insertText": "SAY_VAR1",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "VAR2_SAY (Numeric) (GROUP1::VAR2_SAY)",
    "kind": 6,
    "insertText": "GROUP1::VAR2_SAY",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "VAR3_SAY_VAR3 (Numeric) (VAR3_SAY_VAR3)",
    "kind": 6,
    "insertText": "VAR3_SAY_VAR3",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY_POINTER (Alphanumeric) (SAY_POINTER)",
    "kind": 6,
    "insertText": "SAY_POINTER",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY_POINTER-32 (Alphanumeric) (SAY_POINTER-32)",
    "kind": 6,
    "insertText": "SAY_POINTER-32",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY88-YES (Level88) (GROUP2::VAR4::SAY88-YES)",
    "kind": 6,
    "insertText": "GROUP2::VAR4::SAY88-YES",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY88-NO (Level88) (GROUP2::VAR4::SAY88-NO)",
    "kind": 6,
    "insertText": "GROUP2::VAR4::SAY88-NO",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY_INDEX (Numeric) (GROUP2::SAY_INDEX)",
    "kind": 6,
    "insertText": "GROUP2::SAY_INDEX",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  }
]