       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOBCOMP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * should suggest: matching variables + numeric and valid usage
       01 SAY-VAR1              PIC 9.
       01 GROUP1.
          05 VAR2-SAY           PIC 99.
       01 VAR3-SAY-VAR3         PIC 9(2).
       01 SAY-POINTER USAGE POINTER.
       01 SAY-POINTER-32 USAGE POINTER-32.
       01 GROUP2.
          05 VAR4               PIC 9.
             88 SAY88-YES              VALUE 1.
             88 SAY88-NO               VALUE 0.
       01 GROUP2 OCCURS 10 INDEXED BY SAY-INDEX
                                PIC X.
      * should not suggest: not matching, not numeric, invalid usage
       01 VAR5                  PIC 9.
       01 VAR6-SAY              PIC X.
       01 SAY-FUNCTION-POINTER USAGE FUNCTION-POINTER.

       PROCEDURE DIVISION.
       MAIN.
           SET SAY
           GOBACK
           .
      * should not suggest: paragraph
       P-SAY-HELLO.
           DISPLAY "Hello"
           .
      * should not suggest: section
       S-SAY-CONTINUE SECTION.
           CONTINUE
           .

       END PROGRAM TCOBCOMP.
---------------------------------------------------------------------------------
{"line":24,"character":18}
---------------------------------------------------------------------------------
[
  {
    "label": "SAY-INDEX (Numeric) (GROUP2::SAY-INDEX)",
    "kind": 6,
    "insertText": "GROUP2::SAY-INDEX",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY-POINTER (Alphanumeric) (SAY-POINTER)",
    "kind": 6,
    "insertText": "SAY-POINTER",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY-POINTER-32 (Alphanumeric) (SAY-POINTER-32)",
    "kind": 6,
    "insertText": "SAY-POINTER-32",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY-VAR1 (Numeric) (SAY-VAR1)",
    "kind": 6,
    "insertText": "SAY-VAR1",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY88-NO (Level88) (GROUP2::VAR4::SAY88-NO)",
    "kind": 6,
    "insertText": "GROUP2::VAR4::SAY88-NO",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "SAY88-YES (Level88) (GROUP2::VAR4::SAY88-YES)",
    "kind": 6,
    "insertText": "GROUP2::VAR4::SAY88-YES",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "VAR2-SAY (Numeric) (GROUP1::VAR2-SAY)",
    "kind": 6,
    "insertText": "GROUP1::VAR2-SAY",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  },
  {
    "label": "VAR3-SAY-VAR3 (Numeric) (VAR3-SAY-VAR3)",
    "kind": 6,
    "insertText": "VAR3-SAY-VAR3",
    "data": {
      "start": {
        "line": 24,
        "character": 15
      },
      "end": {
        "line": 24,
        "character": 18
      }
    }
  }
]