       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM0001.
       DATA DIVISION .
       working-storage section.
      
      *01  myDate1 TYPE Date.
       01 myDate1.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
                             
       01  toto pic X.
      
       procedure division.
      
      *    move unsafe myDate1 to toto
           move        myDate1 to toto
           .
       END PROGRAM PGM0001.
