      *TypeCobol_Version:0.1(alpha)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM3.

       DATA DIVISION.
       Working-STORAGE SECTION.

      *01  somedate     TYPE Date.
       01 somedate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
                                  
       01  msg      PIC X(80).

       PROCEDURE DIVISION.
            GOBACK.

       END PROGRAM PGM3.
