       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 Var1 pic X(80) value 'a
      -    'aaa
      -    'bbb'.
       END PROGRAM MyPGM.