Line 1[8,41] <30, Error, Semantics> - Semantic error: TYPEDEF STRICT is not allowed within a copy. Please review the 'TypedefStrict' copy.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
       data division.
       working-storage section.
         COPY TypedefStrict.
         01 var1 type TypedefStrict1.
       END PROGRAM MainProgram.
