       IDENTIFICATION DIVISION.
       PROGRAM-ID. Main.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TypeInMain TYPEDEF PUBLIC.
          05 VarMain TYPE Dependency2::TypeInDependency2.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM Main.