       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
      
       DATA DIVISION.
       Working-STORAGE SECTION.
      
       01 ConventionalTypeDefInMainProgram TYPEDEF STRICT PUBLIC.
           05 DATA1 PIC X.
           05 DATA2 PIC X.
      
       01 CopyTypeDefInMainProgram TYPEDEF STRICT PUBLIC.
           COPY YPRTD20 REPLACING
           ==:Foo:==
           BY ==Flouf==.
      
       01 MyCopiesInsideTypeDef TYPE DVZDEP1::CopiesInsideTypeDef.
       01 MyCopyInsideContainerInsideTypeDef
           TYPE DVZDEP1::CopyInsideContainerInsideTypeDef.
      
       01 MyTypeDefUsingCopyInsideTypeDef
           TYPE DVZDEP2::TypeDefUsingCopyInsideTypeDef.
      
       01 ConventialCopy.
           COPY YCONVEA
           REPLACING
           ==:Foo:==
           BY
            ==Soo==.
      
       01 MyConventionalTypeDef
           TYPE DVZDEP1::ConventionalTypeDefInDependency.

       01 myVar2 TYPE DVZDEP1::Type2.
	   
       PROCEDURE DIVISION.
            MOVE 'X' TO MyCopiesInsideTypeDef::CONVEA
            MOVE 'X' TO
                MyCopyInsideContainerInsideTypeDef::CONTAINER::CONVEA
            MOVE 'X' TO
             myVar2::varA-2::varB-22::CONVEA::CONVEA-SUB::CONVEA-SUB-1
            .

       declare procedure MyProc
            input myType1 type DVZDEP1::Type1.
       PROCEDURE DIVISION.
           DISPLAY myType1
           .
       end-declare.

       declare procedure MyProc2
            input myType2 type DVZDEP1::Type2.
       PROCEDURE DIVISION.
           DISPLAY myType2
           .
       end-declare.

       END PROGRAM PGM1.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGMSTK1.
      
       DATA DIVISION.
       Working-STORAGE SECTION.
       01 MyCopyInsideTypeDef
           TYPE PGM1::ConventionalTypeDefInMainProgram.
      
       01 MyCopyTypeDefInMainProgram
           TYPE PGM1::CopyTypeDefInMainProgram.
      
       PROCEDURE DIVISION.
            .
       END PROGRAM PGMSTK1.