       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZMFT0.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 PIC X.
       PROCEDURE DIVISION.
           MOVE 'A' TO var1
           GOBACK
           .
       END PROGRAM DVZZMFT0.