       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
      *REMARKS. COPY=(
      * ).
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370
      *               WITH DEBUGGING MODE
                      .
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       DATA DIVISION.
      
       WORKING-STORAGE SECTION.
       77  NOM-PGM                       PIC X(08) VALUE 'DVZF0OSM'.
      
      
       01 InternalReference  TYPEDEF strong.
           05 InternalReferenceType       pic X(03).
           05 InternalReferenceValue      pic X(13).
      
       01  bankAccountIntRef TYPE INTERNALREFERENCE.
      
       01  dateJu TYPE DateJulian.
       01  dateDB2  TYPE DateDB2.
       01  maDate TYPE Date.
      
       01  result TYPE BOOL.
      
       01  nbOfDays pic 9(08).
       01  maDateFormatInconnu pic 9(08).
       01  currentAccountBalance TYPE Amount.
       01  dateFreeFormat pic X(10).
      
       PROCEDURE DIVISION.
      D    display "debug"
           set result to false
           move unsafe maDate to dateDB2
      *
      *
      *    move function currentDate()                      to  date2
      *    move date2 to date1
      *    move function currentDateJulian()                to dateJu
      *
      *
      *    move function
      *         currentDateFreeFormat('M', 'M', 'B', 'FR', 'FR')
      *         to dateFreeFormat
      *    move function currentDate2('M', 'M', 'B', 'FR', 'FR')
      *         to dateFreeFormat
      *
      *    Conversion de date (version 1)
      *    move function convertToDate(dateJu)              to date1
      *    move function convertToDate(dateDB2)             to date1
      *    move function convertToDate(zone8, "YYYYMMDD")   to date1
      *
      *    move function convertToDateJulian(date1)         to dateJu
      *    move function convertToDateJulian(dateDB2)       to dateJu
      *
      *    Conversion de date (version 2)
      *    move function dateJulianToDate(dateJu)           to date1
      *    move function dateDB2ToDate(dateDB2)             to date1
      *
      *    move function dateToDateJulian(date1)            to dateJu
      *    move function dateDB2ToDateJulian(dateDB2)       to dateJu
      *    move DVZE00 to DVZE00
      
      *    Contrôle de date
      
           move function isDateValid(maDate)                to result
      *    move function isDateValid(dateJu)                to result
           move function isDateValid(dateDB2)               to result
      *
      *    ajout de  jours
      *    move function addDaysToDate(date1, 2)            to date1
      *    move function addDaysToDate(date1, 2, 'A', 'A')  to date1
      
      
      *    move function  daysBetween2(date1, date2) to nbOfDays
      
      
           goback
           .
       declare function isDateValid private
            input       date1 type Date
            returning   result2 type bool.
       procedure division.
            set result2 to true.
       end-declare.
      
       declare function isDateValid private
            input       date1 type DateDB2
            returning   result2 type bool.
       procedure division.
            set result2 to true.
       end-declare.
      
      
       END PROGRAM DVZF0OSM.