000000*Don't except any errors
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.  MyPGM.
000270*REMARKS. COPY=(YINIPGM
000280*
000340*                      ).
001750 PROCEDURE DIVISION.
001960     .