000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. Decimal.
000000 ENVIRONMENT DIVISION.
000000 CONFIGURATION SECTION.
000000 SOURCE-COMPUTER. IBM-370.
       special-names. 
            SYMBOLIC CHARACTERS LOW-VAL IS 1 HEX-15  IS 22.
000000 DATA DIVISION.
000000 working-storage section.
000000*COPY SpecialNameParagraphValueUsedInCopyCPY1.
       01 WS-LINE-BREAK pic X(10).
000000
000000 PROCEDURE DIVISION.
           move LOW-VAL to zrzerzer
           COPY SpecialNameParagraphValueUsedInCopyCPY2
      *    if WS-LINE-BREAK IS NAMECHAR
      *         display "yes!"
      *    end-if
000000     GOBACK
000000     .
000000 END PROGRAM MYPGM.