       IDENTIFICATION DIVISION.
       PROGRAM-ID. Dependency2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TypeInDependency2 TYPEDEF PUBLIC.
          05 VarDependency2 TYPE Dependency1::TypeInDependency1.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM Dependency2.