       IDENTIFICATION DIVISION.
       PROGRAM-ID. Dependency1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TypeInDependency1 TYPEDEF STRICT PUBLIC.
          05 VarDependency1 TYPE TypeInIntrinsic2.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM Dependency1.