       IDENTIFICATION DIVISION.
       PROGRAM-ID. NoProcDiv.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  DCLTGMIPDS.
           10 NOM-DONSTAT   PIC X(10).
           10 TYPE-LIEU     PIC X(2).
           10 TYPE-MVM      PIC X(2).
       
       END PROGRAM NoProcDiv.
      