         05  CONVEA-VEA-VEA-OUT-VEA pic X.
         05  CONVEA-VEA-VEA-OUT-VEA-2 pic X.
         05  CONVEA.
                10 CONVEA-SUB.
                       15 CONVEA-SUB-1 pic X.
                10 CONVEA-SUB2 pic X.
         05  CONVEA-VEA.
                10 CONVEA-VEA-SUB pic X.
         05  ANOTHER-DATA pic X.
         05  CONVEA-VEATEST pic X.
         05  CONVEA-TESTVEA pic X.
         05  CONVEA-TESTVEA-TEST pic X.
         05  CONVEA-TESTVEATEST pic X.

