       IDENTIFICATION DIVISION.
       PROGRAM-ID. Simple.
       DATA DIVISION.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM Simple.