       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOMFL06.
      *Insert here a multiline REPLACE directive
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 :item: PIC X.
       END PROGRAM TCOMFL06.