COMPUTE x EQUAL a + b
COMPUTE x ROUNDED EQUAL a / b
COMPUTE x = a + b
COMPUTE x = a - b
COMPUTE x = a * b
COMPUTE x = a / b
COMPUTE x = a**b
COMPUTE x = a + b * c ** d - ( e * ( -f + g ) ) / h
* be aware of space usage and potential conflicts
* between arithmetic expressions and identifiers
COMPUTE x = a+b*c**d -(e*(-f+g))/h