000010 ID DIVISION. CLASS-ID. 
000020 MyClass INHERITS BaseClass.
000030 AUTHOR. Mister
000040         Unknown1
000050 ID DIVISION. FACTORY. 
000060 ID DIVISION. METHOD-ID. 
000070 "MyMethod".
000080 AUTHOR. Mister
000090         Unknown2
000100 ID DIVISION. OBJECT. 
000110 ID DIVISION. PROGRAM-ID. 
000120 MyProgram IS INITIAL COMMON PROGRAM.
000130 AUTHOR. Mister
000140         Unknown3
000010 IDENTIFICATION DIVISION. CLASS-ID. 
000020 MyClass INHERITS BaseClass.
000030 AUTHOR. Mister
000040         Unknown4
000050 IDENTIFICATION DIVISION. FACTORY. 
000060 IDENTIFICATION DIVISION. METHOD-ID. 
000070 "MyMethod".
000080 AUTHOR. Mister
000090         Unknown5
000100 IDENTIFICATION DIVISION. OBJECT. 
000110 IDENTIFICATION DIVISION. PROGRAM-ID. 
000120 MyProgram IS INITIAL COMMON PROGRAM.
000130 AUTHOR. Mister
000140         Unknown6