      *TypeCobol_Version:v0.0.0-local
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZPGM2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *01 Type1 typedef strict public.
      *   05 var1 PIC X(20).
       procedure division.
           goback
           .
       END PROGRAM DVZZPGM2.
