       01 CONVEAL.
         05  CONVEAL-VEA-VEA-OUT-VEA pic X.
         05  CONVEAL-VEA-VEA-OUT-VEA-2 pic X.
         05  CONVEAL pic X.
         05  CONVEAL-VEA pic X.
         05  ANOTHER-DATA pic X.
         05  CONVEAL-VEATEST pic X.
         05  CONVEAL-TESTVEA pic X.
         05  CONVEAL-TESTVEA-TEST pic X.
         05  CONVEAL-TESTVEATEST pic X.