       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZS0OSM.

       data division.
       working-storage section.

       01 DateNaissance pic 9(8).

       procedure division.
           move 46546546546545646546 to DateNaissance
           .
       END PROGRAM DVZS0OSM.