       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
      
       DATA DIVISION.
       WORKING-STORAGE SECTION.
Line 6[6,6] <37, Warning, General> - Warning: Line exceed 80 chars
      
Line 7[6,6] <37, Warning, General> - Warning: Line exceed 80 chars
       01  MyDateThatHasAVeryLongNameSoItWontFitToTheEightyCobolCharacterLimitation TYPE Date.
Line 8[8,9] <27, Error, Syntax> - Syntax error : no viable alternative at input '01 ... 01'
Line 8[54,55] <27, Error, Syntax> - Syntax error : extraneous input '. ' expecting {ProgramIdentification, ProgramEnd, ClassIdentification, ClassEnd, FactoryEnd, ObjectIdentification, ObjectEnd, MethodEnd, ProcedureDivisionHeader, WorkingStorageSectionHeader, LocalStorageSectionHeader, LinkageSectionHeader, FileDescriptionEntry, DataDescriptionEntry, DataRedefinesEntry, DataRenamesEntry, DataConditionEntry, ExecStatement, FunctionDeclarationEnd, GlobalStorageSectionHeader}
       01  MyDateTypeFollowedByWhitespaces  TYPE Date.                                                               
       01 MyVar pic X.
          88 MyVar-A value "A".
          88 MyVar-B value "B".
      
Line 13[6,6] <37, Warning, General> - Warning: Line exceed 80 chars
       PROCEDURE DIVISION.
Line 14[6,6] <37, Warning, General> - Warning: Line exceed 80 chars
           IF MyVar-A                                                                                     
                    MOVE "mlkjmlkjmljmlkjmlkjmlkjmlkjmljmlkjmlkjmlkjmlkjmlkjmlkjmlkjmlkjmlkj"
Line 16[21,28] <27, Error, Syntax> - Syntax error : mismatched input 'CONTINUE' expecting TO
                    CONTINUE
           ELSE
                    CONTINUE
           END-IF
      
       END PROGRAM PGM1.
