      *Should be treated as comment
      *CBL/OPTIMIZE(FULL),TEST(NONE,SYM),SSRANGE,DYNAM,FLAG(I,E)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TestingPgm.
      *Correct *CBL directive
      *CBL NOSOURCE
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM TestingPgm.