       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *OK
       01 A pic X.
      *KO Invalid Picture
Line 11[17,18] <27, Error, Syntax> - Syntax error : Combination of symbols 'X.' was not recognized as a valid PICTURE string
       01 B pic X..
      *KO Unexpected '.'
Line 13[20,20] <27, Error, Syntax> - Syntax error : extraneous input '.' expecting {ProgramIdentification, ProgramEnd, ClassIdentification, ClassEnd, FactoryEnd, ObjectIdentification, ObjectEnd, MethodEnd, ProcedureDivisionHeader, WorkingStorageSectionHeader, LocalStorageSectionHeader, LinkageSectionHeader, FileDescriptionEntry, DataDescriptionEntry, DataRedefinesEntry, DataRenamesEntry, DataConditionEntry, ExecStatement, FunctionDeclarationEnd, GlobalStorageSectionHeader}
       01 C pic X. .
      *KO not reported because of previous error
Line 15[15,15] <12, Warning, Tokens> - A blank was missing before character "." in column 16. A blank was assumed.
       01 var1..
          05 var2 pic XX.
      *KO Invalid Picture
Line 18[23,26] <27, Error, Syntax> - Syntax error : Invalid PICTURE string 'X.05': character '5' at position '4' was not expected
Line 18[28,31] <27, Error, Syntax> - Syntax error : extraneous input 'var4' expecting {separator, statement starting keyword, keyword}
          05 var3 pic X.05 var4 pic X.
Line 19[26,26] <12, Warning, Tokens> - A blank was missing before character "." in column 27. A blank was assumed.
       PROCEDURE DIVISION..
Line 20[23,23] <12, Warning, Tokens> - A blank was missing before character "." in column 24. A blank was assumed.
           move A to B..
Line 21[23,23] <12, Warning, Tokens> - A blank was missing before character "." in column 24. A blank was assumed.
Line 21[24,24] <12, Warning, Tokens> - A blank was missing before character "." in column 25. A blank was assumed.
Line 21[25,25] <12, Warning, Tokens> - A blank was missing before character "m" in column 26. A blank was assumed.
           move A to B...move A to B.
           goback
           .
       END PROGRAM Pgm.
