           MOVE LOW-VAL TO t1
           MOVE HEX-15  TO t2
           MOVE HI-VAL  TO t3
           IF c IS NAMECHAR
              DISPLAY "ok"
           END-IF