       01 WORD1 PIC X.

       REPLACE ==WORD1== BY ==WORD3==.
       01 WORD1 PIC X.
       01 WORD2 PIC X.

       REPLACE ==WORD2== BY ==WORD3==.
       01 WORD1 PIC X.
       01 WORD2 PIC X.