       IDENTIFICATION DIVISION.
       PROGRAM-ID. TypeCobol.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 a pic X.
       01 c pic X.
       PROCEDURE DIVISION.
           move a to b
           copy CPYProc.
           .