003050 IDENTIFICATION DIVISION.
003070 PROGRAM-ID. TESTCPL.
003220 ENVIRONMENT DIVISION.
003500 DATA DIVISION.
004540 WORKING-STORAGE SECTION.
007840 01 CPYTST.
007850    COPY YCPYTST REPLACING  ==:CPYTST:== BY ==CPYTST== .
007860 01 CPLTST.
007870    COPY TCPLTST.
007880 01 CPXTST.
007890    COPY TCPXTST REPLACING  ==:CPXTST:== BY ==CPXTST== .
007840 01 CPYTST2.
007850    COPY YCPYTST.
010690 PROCEDURE DIVISION
          .
039620 END PROGRAM TESTCPL.
