IDENTIFICATION DIVISION.
PROGRAM-ID. TypeCobol.
DATA DIVISION.
WORKING-storage section.
01 STR.
    05 VAR1 PIC X.
    05 COPYCONTAINER. copy CPYData.

copy CPYData. 

PROCEDURE DIVISION.

END PROGRAM TypeCobol.