       ID DIVISION.
       PROGRAM-ID.   myPGM.      
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  CR                      PIC X VALUE '␍'.
       01  LF                      PIC X VALUE '␊'.      
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM myPGM.