IDENTIFICATION DIVISION.
  PROGRAM-ID. Doubles.

DATA DIVISION.
WORKING-STORAGE SECTION.
77  I-DOUBLE        PIC X(32) VALUE 'D1'.
77  I-DOUBLE        PIC X(32) VALUE 'D2'.
01  X               PIC X(32) VALUE 'X'.
77  I-DOUBLE        PIC X(32) VALUE 'D3'.

01 BIGZONE          PIC X(3000).
01 GROUP-DOUBLE REDEFINES BIGZONE.
   05 VARIANT-1A.
      10 V1A1       PIC X(500).
      10 V1A2       PIC X(500).
   05 VARIANT-1B    PIC X(800).
   05 VARIANT-2     PIC X(500).
   05 GLOBO         PIC X(100) IS GLOBAL.
   05 EXTRA         PIC X(100).
   05 FILLER        PIC X(500).
01 GROUP-DOUBLE REDEFINES BIGZONE.
   05 VARIANT-2.
      10 V2         PIC X(3000).
01 ANOTHER-GROUP.
   05 VARIANT-1B    PIC X(100).

PROCEDURE DIVISION.

PERFORM PROC1
.

PROC1.
  MOVE V1A1 TO V1A2 OF GROUP-DOUBLE
  MOVE V1A1 TO V1A2 OF GROUP-DOUBLE OF GROUP-DOUBLE
  MOVE V1A1 OF VARIANT-1A OF GROUP-DOUBLE TO V1A2
  MOVE V1A1 OF VARIANT-1A TO V1A2 OF VARIANT-1A
  MOVE X TO Y
  MOVE X TO I-DOUBLE
  .
  MOVE VARIANT-1A TO VARIANT-1B
  MOVE VARIANT-1A TO VARIANT-1B OF GROUP-DOUBLE
  MOVE VARIANT-1A TO VARIANT-2 OF GROUP-DOUBLE
  MOVE VARIANT-1A TO VARIANT-1B OF ANOTHER-GROUP
  .
  MOVE GLOBO TO EXTRA.