       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPGM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370
                        WITH DEBUGGING MODE
                        .
       data division.
       working-storage section.
       01 debugVar picX.
       END PROGRAM MyPGM.