000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. StringStatement.
000000 ENVIRONMENT DIVISION.
000000 CONFIGURATION SECTION.
000000 SOURCE-COMPUTER. IBM-370.
       special-names. decimal-point is comma.
000000 DATA DIVISION.
000000 working-storage section.
000000 01 MyGroup.
000000    05 MyCounter pic 999 comp-5.
      *Ok MyCounter is unique in the source
000000    05 MyTab     PIC X occurs 99 depending on MyCounter.


       01 MyAmbiguousGroup.
      *OK you can declare 2 variables with the same name
          05 MyAmbiguousCounter  pic 999 comp-5.
      *OK you can declare 2 variables with the same name
          05 MyAmbiguousCounter  pic 999 comp-5.
      *KO reference to MyAmbiguousCounter is ... Ambiguous
          05 MyAmbiguousTab     PIC X occurs 99 
Line 22[46,63] <30, Error, Semantics> - Semantic error: Ambiguous reference to symbol MyAmbiguousCounter 
Symbols found: StringStatement::MyAmbiguousGroup::MyAmbiguousCounter | StringStatement::MyAmbiguousGroup::MyAmbiguousCounter
                                depending on MyAmbiguousCounter.

       01 MyGroup3.
          05 MyCounter3  pic 999 comp-5.
      *KO depending on clause cannot be a numeric
Line 27[54,56] <27, Error, Syntax> - Syntax error : mismatched input '999' expecting {symbol, special register, keyword}
          05 MyTab3     PIC X occurs 99 depending on 999.
 
       01 MyGroup4.
      *OK MyCounter is declared in another group but it works
          05 MyTab3     PIC X occurs 99 depending on MyCounter.


000000 01 MyGroup5.
000000    05 MySubGroup5.
000000       10 MySubSubGroup51.
000000          15 MyCounter5 pic 999 comp-5.
000000       10 MySubSubGroup52.
000000          15 MyCounter5 pic 999 comp-5.
      *Ok use operator OF
000000    05 MyTab5     PIC X occurs 99 
                        depending on MyCounter5 of MySubSubGroup51. 
      *Ok use operator IN
000000    05 MyTab51     PIC X occurs 99 
                         depending on MyCounter5 IN MySubSubGroup51.

      *KO
000000    05 MyTab5     PIC X occurs 99 
Line 49[38,47] <30, Error, Semantics> - Semantic error: Ambiguous reference to symbol MyGroup5.MyCounter5 
Symbols found: StringStatement::MyGroup5::MySubGroup5::MySubSubGroup51::MyCounter5 | StringStatement::MyGroup5::MySubGroup5::MySubSubGroup52::MyCounter5
                        depending on MyCounter5 of MyGroup5. 
      *KO
000000    05 MyTab5     PIC X occurs 99 depending on 
Line 52[25,34] <30, Error, Semantics> - Semantic error: Ambiguous reference to symbol MyGroup5.MySubGroup5.MyCounter5 
Symbols found: StringStatement::MyGroup5::MySubGroup5::MySubSubGroup51::MyCounter5 | StringStatement::MyGroup5::MySubGroup5::MySubSubGroup52::MyCounter5
                        MyCounter5 of MySubGroup5 of MyGroup5.
      *Ok
000000    05 MyTab5     PIC X occurs 99 depending on 
                        MyCounter5 of MySubSubGroup51 of 
                        MySubGroup5 of MyGroup5.
000000 PROCEDURE DIVISION.
000000     move 1 to MyCounter
000000     .
000000 END PROGRAM StringStatement.
