       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPGM.
       PROCEDURE DIVISION
                          .
       PARA0.
           IF  OK
              SEARCH ALL MyArray 
      
              END-SEARCH
           END-IF
      
           PERFORM PARA1
      
           .
       PARA1.
      
           .
      
       END PROGRAM MyPGM.