       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MyBool         pic X.
         88 O            value 'O'.
       PROCEDURE DIVISION.
           if O
           .
       END PROGRAM Pgm.