       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DECLARE PROCEDURE Proc1
           INPUT  O PIC X
           OUTPUT R PIC X.
       data division.
       working-storage section.
       procedure division.
           if O
       END-DECLARE.
       END PROGRAM Pgm.