       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZBCO0.
       procedure division.
           inspect
           GOBACK.
      
       END PROGRAM DVZZBCO0.