       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOFM117.
       data division.
       working-storage section.
      *Warning
      *A blank was missing before character"B"in column 28.
      *A blank was assumed.
Line 8[26,27] <12, Warning, Tokens> - A blank was missing before character "B" in column 28. A blank was assumed.
       REPLACE ==:DVZOSM:==BY ==ITEM1==.
       01 :DVZOSM: PIC X.
      *Error
      *The"REPLACE"statement was invalid.  Expected"BY", but found",BY".
      *The statement was discarded.
Line 13[26,27] <15, Error, Tokens> - Invalid character found after pseudo-text delimiter "==": ","
       REPLACE ==:DVZOSM:==,BY ==ITEM2==.
       01 :DVZOSM: PIC X.
      *Error
      *The"REPLACE"statement was invalid.  Expected"BY", but found";BY".
      *The statement was discarded.
Line 18[26,27] <15, Error, Tokens> - Invalid character found after pseudo-text delimiter "==": ";"
Line 18[28,28] <3, Error, Tokens> - Semicolon separator should be followed by a space
       REPLACE ==:DVZOSM:==;BY ==ITEM3==.
       01 :DVZOSM: PIC X.
      *Error
      *The"REPLACE"statement was invalid.  Expected"BY", but found".BY".
      *The statement was discarded.
Line 23[28,28] <12, Warning, Tokens> - A blank was missing before character "B" in column 29. A blank was assumed.
Line 23[28,28] <27, Error, Syntax> - Syntax error : mismatched input '.' expecting BY
Line 23[29,30] <27, Error, Syntax> - Syntax error : extraneous input 'BY' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
Line 23[41,41] <27, Error, Syntax> - Syntax error : extraneous input '.' expecting {ProgramIdentification, ProgramEnd, ClassIdentification, ClassEnd, FactoryEnd, ObjectIdentification, ObjectEnd, MethodEnd, ProcedureDivisionHeader, WorkingStorageSectionHeader, LocalStorageSectionHeader, LinkageSectionHeader, FileDescriptionEntry, DataDescriptionEntry, DataRedefinesEntry, DataRenamesEntry, DataConditionEntry, ExecStatement, FunctionDeclarationEnd, GlobalStorageSectionHeader}
       REPLACE ==:DVZOSM:==.BY ==ITEM4==.
Line 24[11,18] <27, Error, Syntax> - Syntax error : no viable alternative at input '01 ... :DVZOSM:'
       01 :DVZOSM: PIC X.
      *Warning
      *A blank was missing before character"="in column 31.
      *A blank was assumed.
Line 28[31,32] <54, Warning, Tokens> - A blank was missing after character "Y" in column 30. A blank was assumed.
       REPLACE ==:DVZOSM:== BY==ITEM5==.
       01 :DVZOSM: PIC X.
      *Warning
      *A blank was missing before character"="in column 32.
      *A blank was assumed.
Line 33[32,33] <53, Warning, Tokens> - Invalid character found before pseudo-text delimiter "==": ","
       REPLACE ==:DVZOSM:== BY,==ITEM6==.
       01 :DVZOSM: PIC X.
      *Warning - accepted by IBM compiler but currently not supported
      *A blank was missing before character"="in column 32.
      *A blank was assumed.
Line 38[31,31] <3, Error, Tokens> - Semicolon separator should be followed by a space
Line 38[32,33] <53, Warning, Tokens> - Invalid character found before pseudo-text delimiter "==": ";"
       REPLACE ==:DVZOSM:== BY;==ITEM7==.
       01 :DVZOSM: PIC X.
      *Error and warnings
      *Unexpected end of"REPLACE"statement was found.
      *The"REPLACE"statement was discarded.
      *"="was invalid.  Scanning was resumed atthe next area"A"item,
      *level-number, or the start of the next clause.
      *A blank was missing before character"="in column 40.
      *A blank was assumed.
      *A blank was missing before character"="in column 39.
      *A blank was assumed.
      *A blank was missing before character"I"in column 34.
      *A blank was assumed.
      *A blank was missing before character"="in column 33.
      *A blank was assumed.
Line 53[31,31] <12, Warning, Tokens> - A blank was missing before character "=" in column 32. A blank was assumed.
Line 53[32,33] <54, Warning, Tokens> - A blank was missing after character "." in column 31. A blank was assumed.
Line 53[31,31] <27, Error, Syntax> - Syntax error : mismatched input '.' expecting '=='
Line 53[32,33] <27, Error, Syntax> - Syntax error : extraneous input '==' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
       REPLACE ==:DVZOSM:== BY.==ITEM8==.
Line 54[11,18] <27, Error, Syntax> - Syntax error : no viable alternative at input '01 ... :DVZOSM:'
       01 :DVZOSM: PIC X.
       END PROGRAM TCOFM117.
