       IDENTIFICATION DIVISION.
       PROGRAM-ID. LevelNumber.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

      *KO Level Number
       05 myVar PIC X.
       50 myVar PIC X.
       79 myVar PIC X.
       61 myVar PIC X.
       65 myVar PIC X.
       76 myVar PIC X.
       87 myVar PIC X.
       89 myVar PIC X.
       1000000  myVar PIC X.
       0111212121  myVar PIC X.

      *OK Level Number
       77 myVar PIC X.
       01 myVar PIC X.
       49 myVar PIC X.
       77 myVar PIC X.

       


       PROCEDURE DIVISION.

       END PROGRAM LevelNumber.