       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0SOM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *Ok
           select F1-456789012345678901234567890  assign to UT-S-ENT001.
      *Ko
Line 12[12,72] <27, Error, Syntax> - Syntax error : The COBOL word 'F3-4567890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
           select F3-4567890123456789012345678901 assign to UT-S-ENT002.

       data division.
       file section.
      *Ok
       FD  F1-456789012345678901234567890  block contains 0
                          recording mode F.
      *Ok
       01  F2-456789012345678901234567890    pic X(800).

      *Ko
Range (23, 8) -> (24, 43) <27, Error, Syntax> - Syntax error : The COBOL word 'F3-4567890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
       FD  F3-4567890123456789012345678901 block contains 0
                          recording mode F.
      *Ko
Line 26[8,57] <27, Error, Syntax> - Syntax error : The COBOL word 'F4-4567890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
       01  F4-4567890123456789012345678901   pic X(1500).
       working-storage section.

      *Ok 30 chars
       01 V1-456789012345678901234567890 pic X.
      *Ok 30 chars
          88 V2-456789012345678901234567890 value 'X'.
      *KO 31 chars
Line 34[8,48] <27, Error, Syntax> - Syntax error : The COBOL word 'V3-4567890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
       01 V3-4567890123456789012345678901 pic X.
      *KO 31 chars
Line 36[11,55] <27, Error, Syntax> - Syntax error : The COBOL word 'V4-4567890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
          88 V4-4567890123456789012345678901 value 'X'.

         replace ==::== by ==456789-123456789-1234567890==.
      *Ok
       01 V5-:: pic X.
      *Ko
Line 42[8,23] <27, Error, Syntax> - Syntax error : The COBOL word 'V5-456789-123456789-12345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
       01 V5-::1 pic X.

         replace off.

       procedure division.
      *Ok
       P1-456789012345678901234567890.
           exit.
      *Ko
Line 51[8,39] <27, Error, Syntax> - Syntax error : The COBOL word 'P2-4567890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
       P2-4567890123456789012345678901.
           exit.

      *Ok
       S1-456789012345678901234567890 section.
           exit.
      *Ko
Line 58[8,47] <27, Error, Syntax> - Syntax error : The COBOL word 'S2-4567890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
       S2-4567890123456789012345678901 section.
           exit. 

       IDENTIFICATION DIVISION.
      *Ok
       PROGRAM-ID. PGM1-6789012345678901234567890.
      *Ok
       END PROGRAM PGM1-6789012345678901234567890.

      *Ko
Range (68, 8) -> (69, 51) <27, Error, Syntax> - Syntax error : The COBOL word 'PGM2-67890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM2-67890123456789012345678901.
      *Ko
Line 71[8,51] <27, Error, Syntax> - Syntax error : The COBOL word 'PGM2-67890123456789012345678901' contains 31 characters which is more than the allowed maximum of 30 characters.
       END PROGRAM PGM2-67890123456789012345678901.
       END PROGRAM DVZF0SOM.
