       IDENTIFICATION DIVISION.
       PROGRAM-ID.Pgm.
       AUTHOR.AUTHOR.
       DATE-WRITTEN.NOVEMBRE 80.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A pic X.
       01 B pic X..
       01 C pic X. .
      
       01 var1..
          05 var2 pic XX.
          05 var3 pic X.05 var4 pic X.
       PROCEDURE DIVISION..
           move A to B..
           move A to B...move A to B.
      
           .
       END PROGRAM Pgm.