 IDENTIFICATION DIVISION.
 PROGRAM-ID. TCOMFL01.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER. IBM-370.
 OBJECT-COMPUTER. IBM-370.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  GROUP1.
     05 VAR1 PIC X(49) value 'f
-       ' accès illimité* à vos comptes                  '.
     05 VAR2 PIC X(9) value '
-        '         '.
 PROCEDURE DIVISION.
     DISPLAY VAR1
     DISPLAY VAR2
     GOBACK
     .
 END PROGRAM TCOMFL01.