       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPgm.
       data division.
       working-storage section.
       01 TOTO pic 9.
       procedure division.
      
       REPLACE ==:-MAJ:== BY ====.
      *Ok
           PERFORM EACGAPEL-C0001:-MAJ:.

      *Ok
           perform
           300-000-PAR2
      *Ok
           perform 300-000-SEC1
           perform 300 TIMES
           perform 300-000-PAR2 THRU 300-000-SEC1
           perform 300-000-PAR2 THRU 300-000-SEC1 300 TIMES
           perform 300-000-PAR3 OF 300-000-SEC1 300 TIMES
           perform 300-000-PAR3 OF 300-000-SEC1 THRU 
                   300-000-PAR3 OF 300-000-SEC1 300 TIMES
      *Ok Number too big
Line 24[20,58] <27, Error, Syntax> - Syntax error : Number is too big : 300303030303030303030303030303030303030
           perform 300303030303030303030303030303030303030 TIMES

      *TODO Numeric paragraph name are not supported yet
           perform 300

Line 29[12,17] <27, Error, Syntax> - Syntax error : missing TIMES at 'goback'
           goback.
           REPLACE ==:PAR1:== BY ==PAR2==.
      *Ok
      
       300-000-:PAR1:.
           exit.
      *---------------------------------------------------------------*
       EACGAPEL-C0001-TRACE.
           continue
           .
      *---------------------------------------------------------------*
       EACGAPEL-C0001.
           continue
           .
       EACGAPEL-C0002.
           continue
           .
      *Ok
       300-000-SEC1 section.
           DISPLAY "IN SECTION".
       300-000-PAR3.
           exit.

Line 52[8,10] <27, Error, Syntax> - Syntax error : extraneous input '300' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
       300.
           exit.
       END PROGRAM MyPgm.
