IDENTIFICATION DIVISION.
  PROGRAM-ID. perform-program.
  
PROCEDURE DIVISION.

*  // Basic PERFORM with scope
* //////////////////////////////
PERFORM
  DISPLAY 'test'
END-PERFORM
.
*  // Basic PERFORM procedure
* /////////////////////////////
PERFORM procedurename
.

PERFORM UNTIL condition1
  IF condition2
    DISPLAY 'test'
  END-IF
END-PERFORM
.

*  // PERFORM THRU
* /////////////////////////////
PERFORM A THRU B
PERFORM B THRU A
PERFORM S1 THRU S2
PERFORM S2 THRU S1
PERFORM S1 THRU A
GOBACK.

A.
    display "A"
    .
B.
    display "B"
    .
S1 SECTION.
    display "S1"
    .
S2 SECTION.
    display "S2"
    .
