       IDENTIFICATION DIVISION.
       PROGRAM-ID. Main.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested1.
      
       END PROGRAM Nested1.
      
       END PROGRAM Main.
      *Ko Stacked1 have no END PROGRAM
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Stacked1.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested1.
      
       END PROGRAM Nested1.