       IDENTIFICATION DIVISION.
       PROGRAM-ID. Main.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested0.
      
       END PROGRAM Toto.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested1.
      
       END PROGRAM Nested1.
      
       END PROGRAM Main.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Stacked1.
      
       END PROGRAM Stacked1.