       IDENTIFICATION DIVISION .
       PROGRAM-ID. MainProgram.
       PROCEDURE DIVISION.
      
      
       ID DIVISION.
       PROGRAM-ID. Nested.

       END PROGRAM MainProgram.