       IDENTIFICATION DIVISION.
       PROGRAM-ID. Stacked0.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested0.
      
       END PROGRAM Stacked0.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested1.
      
       END PROGRAM Nested1.
      
       END PROGRAM Nested0.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Stacked1.

       END PROGRAM Stacked1.