      ****** Support REPOSITORY PARAGRAPH *****
       IDENTIFICATION DIVISION.
       PROGRAM-ID. pgm2536.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       REPOSITORY.
           FUNCTION ABS INTRINSIC
           Class Dummy
           FUNCTION EXP COMBINED-DATETIME FORMATTED-CURRENT-DATE
           FORMATTED-DATETIME SIGN INTRINSIC
           Class Base is "java.lang.Object"
           FUNCTION when-compiled INTRINSIC
           Class Customer is "com.ei.Customer"
           FUNCTION WHEN-COMPILED INTRINSIC
           FUNCTION PI TRIM INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE  SECTION.
       PROCEDURE DIVISION.
            GOBACK.
       END PROGRAM pgm2536.