       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       data division.
       working-storage section.
        01 a pic 9.
        01 300-200X  pic 9 value 1.
        01 200X-100X pic 9 value 1.
      *KO variable must contains at least one alphabetic char
Line 9[12,18] <27, Error, Syntax> - Syntax error : Variable name must contain at least one alphabetic char.
        01 400-500 pic 9.

       procedure division.
      *Should be KO. 400-500 is not a valid variable name because it
      *   contains no alphabetic char
      *   The parser will only report the error on the variable 
      *   declaration.
           compute a = 400-500


      *KO  "300-200X-100X" was not defined as a data-name.
      *    The statement was discarded.
Line 21[24,36] <30, Error, Semantics> - Semantic error: Symbol 300-200X-100X is not referenced
           compute a = 300-200X-100X.
      *KO  "-200" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *    A blank was missing before character"X"in column 32.
      *    A blank was assumed.
Line 26[28,31] <27, Error, Syntax> - Syntax error : extraneous input '-200' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
           compute a = 300 -200X-100X.
           compute a = 300-200X - 100.
           compute a = 300 - 200X-100X.
      *KO  Expected a numeric data item or a numeric literal, but
      *    found"300-100".  The"COMPUTE"statement was discarded.
Line 31[12,30] <27, Error, Syntax> - Syntax error : Variable must contains at least one alphabetic char. For subtraction, please add spaces around minus operator: 300 - 100
Line 31[24,30] <30, Error, Semantics> - Semantic error: Symbol 300-100 is not referenced
           compute a = 300-100
      *KO  "100" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *KO  "300" was not defined as a data-name.
      *    The statement was discarded.
      *KO  "300" was a name that ended with one or more hyphens.
      *    The hyphens were discarded.
Line 38[29,31] <27, Error, Syntax> - Syntax error : extraneous input '100' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
Line 38[12,27] <27, Error, Syntax> - Syntax error : Variable must contains at least one alphabetic char. For subtraction, please add spaces around minus operator: 300 - 
Line 38[24,27] <30, Error, Semantics> - Semantic error: Symbol 300- is not referenced
           compute a = 300- 100
      *KO  "-100" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
Line 41[28,31] <27, Error, Syntax> - Syntax error : extraneous input '-100' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
           compute a = 300 -100
           compute a = 300 - 100
           compute a = -300
           compute a = -300 - 100
      *Ok
           compute a = 30.0E-14
           compute a = 30.0E14
           compute a = +30.0E+14
           compute a = -30.0E-14
           compute a = -30.0E14
           compute a = -30.0E+14
      *KO "123E-4" was not defined as a data-name.
      *   The statement was discarded.
Line 54[25,30] <30, Error, Semantics> - Semantic error: Symbol 123E-4 is not referenced
           compute a =  123E-4
      *KO "-1" was invalid.  Skipped to the next verb, period or
      *   procedure-name definition.
      *   A blank was missing before character"-"in column 32.
      *   A blank was assumed.
Line 59[32,33] <27, Error, Syntax> - Syntax error : extraneous input '-1' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
           compute a =  .25e-24-1
      *KO "-100" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *    A blank was missing before character"-"in column 31.
      *    A blank was assumed.
Line 64[31,34] <27, Error, Syntax> - Syntax error : extraneous input '-100' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
           compute a = .25e-24-100
      *KO  "-100" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *    A blank was missing before character"-"in column 31.
      *    A blank was assumed.
      *    A blank was missing before character"-"in column 35.
      *    A blank was assumed.
Line 71[31,34] <27, Error, Syntax> - Syntax error : extraneous input '-100' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
           compute a = .25e-24-100-123


      *Without floating point
      *
      *KO  "300E-14" was not defined as a data-name.
      *    The statement was discarded.
Line 78[24,30] <30, Error, Semantics> - Semantic error: Symbol 300E-14 is not referenced
           compute a = 300E-14
      *KO  "300E14" was not defined as a data-name.
      *    The statement was discarded.
Line 81[24,29] <30, Error, Semantics> - Semantic error: Symbol 300E14 is not referenced
           compute a = 300E14
      *OK
           compute a = +300
      *KO  "E"was invalid.  Skipped to the next verb, period or
      *     procedure-name definition.
      *     A blank was missing before character"E"in column 28.
      *     A blank was assumed.
      *TODO #2251 our scanner must scan it as "+300" (integer) and "E"
Line 89[24,28] <16, Error, Tokens> - Invalid numeric literal format : expecting integer +12, or decimal +12,345, or floating point +12.345E-03
Line 89[12,18] <31, Error, Semantics> - Runtime error: System.IndexOutOfRangeException: L'index se trouve en dehors des limites du tableau.
   à TypeCobol.Compiler.Parser.CobolExpressionsBuilder.CreateArithmeticExpression(ArithmeticExpressionContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolExpressionsBuilder.cs:ligne 577
   à TypeCobol.Compiler.Parser.CobolStatementsBuilder.CreateComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolStatementsBuilder.cs:ligne 282
   à TypeCobol.Compiler.Parser.CodeElementBuilder.EnterComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolCodeElementBuilder.cs:ligne 1596
   à TypeCobol.Compiler.Parser.Generated.CodeElementsParser.ComputeStatementContext.EnterRule(IParseTreeListener listener) dans C:\Users\SMEDILOL\workspaces\TypeCobol\obj\EI_Debug\TypeCobol\CodeElementsParser.cs:ligne 18430
   à Antlr4.Runtime.Tree.ParseTreeWalker.EnterRule(IParseTreeListener listener, IRuleNode r)
   à Antlr4.Runtime.Tree.ParseTreeWalker.Walk(IParseTreeListener listener, IParseTree t)
   à TypeCobol.Compiler.Parser.CodeElementsParserStep.ParseProcessedTokensLinesChanges(ProcessedTokensDocument processedTokensDocument, IList`1 processedTokensLinesChanges, PrepareDocumentLineForUpdate prepareDocumentLineForUpdate, TypeCobolOptions compilerOptions, PerfStatsForParserInvocation perfStatsForParserInvocation) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementsParserStep.cs:ligne 266
           compute a = +300E
      *KO  "E" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *    A blank was missing before character"E"in column 28.
      *    A blank was assumed.
      *    A blank was missing before character"+"in column 29.
      *    A blank was assumed.
      *TODO #2251 our scanner must scan it as "+300" (integer) and "E"
Line 97[24,31] <17, Error, Tokens> - Invalid floating point numeric literal format : a decimal point must be included in the mantissa 1.23E+4
Line 97[12,18] <31, Error, Semantics> - Runtime error: System.IndexOutOfRangeException: L'index se trouve en dehors des limites du tableau.
   à TypeCobol.Compiler.Parser.CobolExpressionsBuilder.CreateArithmeticExpression(ArithmeticExpressionContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolExpressionsBuilder.cs:ligne 577
   à TypeCobol.Compiler.Parser.CobolStatementsBuilder.CreateComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolStatementsBuilder.cs:ligne 282
   à TypeCobol.Compiler.Parser.CodeElementBuilder.EnterComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolCodeElementBuilder.cs:ligne 1596
   à TypeCobol.Compiler.Parser.Generated.CodeElementsParser.ComputeStatementContext.EnterRule(IParseTreeListener listener) dans C:\Users\SMEDILOL\workspaces\TypeCobol\obj\EI_Debug\TypeCobol\CodeElementsParser.cs:ligne 18430
   à Antlr4.Runtime.Tree.ParseTreeWalker.EnterRule(IParseTreeListener listener, IRuleNode r)
   à Antlr4.Runtime.Tree.ParseTreeWalker.Walk(IParseTreeListener listener, IParseTree t)
   à TypeCobol.Compiler.Parser.CodeElementsParserStep.ParseProcessedTokensLinesChanges(ProcessedTokensDocument processedTokensDocument, IList`1 processedTokensLinesChanges, PrepareDocumentLineForUpdate prepareDocumentLineForUpdate, TypeCobolOptions compilerOptions, PerfStatsForParserInvocation perfStatsForParserInvocation) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementsParserStep.cs:ligne 266
           compute a = +300E+14
      *KO "E-14" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *    A blank was missing before character"E"in column 28.
      *    A blank was assumed.
      *TODO #2251 our scanner must scan it as "-300" (integer) 
      *     and "E-14"
Line 104[24,31] <17, Error, Tokens> - Invalid floating point numeric literal format : a decimal point must be included in the mantissa 1.23E+4
Line 104[12,18] <31, Error, Semantics> - Runtime error: System.IndexOutOfRangeException: L'index se trouve en dehors des limites du tableau.
   à TypeCobol.Compiler.Parser.CobolExpressionsBuilder.CreateArithmeticExpression(ArithmeticExpressionContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolExpressionsBuilder.cs:ligne 577
   à TypeCobol.Compiler.Parser.CobolStatementsBuilder.CreateComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolStatementsBuilder.cs:ligne 282
   à TypeCobol.Compiler.Parser.CodeElementBuilder.EnterComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolCodeElementBuilder.cs:ligne 1596
   à TypeCobol.Compiler.Parser.Generated.CodeElementsParser.ComputeStatementContext.EnterRule(IParseTreeListener listener) dans C:\Users\SMEDILOL\workspaces\TypeCobol\obj\EI_Debug\TypeCobol\CodeElementsParser.cs:ligne 18430
   à Antlr4.Runtime.Tree.ParseTreeWalker.EnterRule(IParseTreeListener listener, IRuleNode r)
   à Antlr4.Runtime.Tree.ParseTreeWalker.Walk(IParseTreeListener listener, IParseTree t)
   à TypeCobol.Compiler.Parser.CodeElementsParserStep.ParseProcessedTokensLinesChanges(ProcessedTokensDocument processedTokensDocument, IList`1 processedTokensLinesChanges, PrepareDocumentLineForUpdate prepareDocumentLineForUpdate, TypeCobolOptions compilerOptions, PerfStatsForParserInvocation perfStatsForParserInvocation) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementsParserStep.cs:ligne 266
           compute a = -300E-14
      *KO  "E14" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *    A blank was missing before character"E"in column 28.
      *    A blank was assumed.
      *TODO #2251 our scanner must scan it as "-300" (integer) 
      *    and "E14"
Line 111[24,30] <17, Error, Tokens> - Invalid floating point numeric literal format : a decimal point must be included in the mantissa 1.23E+4
Line 111[12,18] <31, Error, Semantics> - Runtime error: System.IndexOutOfRangeException: L'index se trouve en dehors des limites du tableau.
   à TypeCobol.Compiler.Parser.CobolExpressionsBuilder.CreateArithmeticExpression(ArithmeticExpressionContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolExpressionsBuilder.cs:ligne 577
   à TypeCobol.Compiler.Parser.CobolStatementsBuilder.CreateComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolStatementsBuilder.cs:ligne 282
   à TypeCobol.Compiler.Parser.CodeElementBuilder.EnterComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolCodeElementBuilder.cs:ligne 1596
   à TypeCobol.Compiler.Parser.Generated.CodeElementsParser.ComputeStatementContext.EnterRule(IParseTreeListener listener) dans C:\Users\SMEDILOL\workspaces\TypeCobol\obj\EI_Debug\TypeCobol\CodeElementsParser.cs:ligne 18430
   à Antlr4.Runtime.Tree.ParseTreeWalker.EnterRule(IParseTreeListener listener, IRuleNode r)
   à Antlr4.Runtime.Tree.ParseTreeWalker.Walk(IParseTreeListener listener, IParseTree t)
   à TypeCobol.Compiler.Parser.CodeElementsParserStep.ParseProcessedTokensLinesChanges(ProcessedTokensDocument processedTokensDocument, IList`1 processedTokensLinesChanges, PrepareDocumentLineForUpdate prepareDocumentLineForUpdate, TypeCobolOptions compilerOptions, PerfStatsForParserInvocation perfStatsForParserInvocation) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementsParserStep.cs:ligne 266
           compute a = -300E14
      *KO  "E" was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *    A blank was missing before character"E"in column 28.
      *    A blank was assumed.
      *    A blank was missing before character"+"in column 29.
      *    A blank was assumed.
      *TODO #2251 our scanner must scan it as "-300" (integer), 
      *     "E" and "+14"
Line 120[24,31] <17, Error, Tokens> - Invalid floating point numeric literal format : a decimal point must be included in the mantissa 1.23E+4
Line 120[12,18] <31, Error, Semantics> - Runtime error: System.IndexOutOfRangeException: L'index se trouve en dehors des limites du tableau.
   à TypeCobol.Compiler.Parser.CobolExpressionsBuilder.CreateArithmeticExpression(ArithmeticExpressionContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolExpressionsBuilder.cs:ligne 577
   à TypeCobol.Compiler.Parser.CobolStatementsBuilder.CreateComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolStatementsBuilder.cs:ligne 282
   à TypeCobol.Compiler.Parser.CodeElementBuilder.EnterComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolCodeElementBuilder.cs:ligne 1596
   à TypeCobol.Compiler.Parser.Generated.CodeElementsParser.ComputeStatementContext.EnterRule(IParseTreeListener listener) dans C:\Users\SMEDILOL\workspaces\TypeCobol\obj\EI_Debug\TypeCobol\CodeElementsParser.cs:ligne 18430
   à Antlr4.Runtime.Tree.ParseTreeWalker.EnterRule(IParseTreeListener listener, IRuleNode r)
   à Antlr4.Runtime.Tree.ParseTreeWalker.Walk(IParseTreeListener listener, IParseTree t)
   à TypeCobol.Compiler.Parser.CodeElementsParserStep.ParseProcessedTokensLinesChanges(ProcessedTokensDocument processedTokensDocument, IList`1 processedTokensLinesChanges, PrepareDocumentLineForUpdate prepareDocumentLineForUpdate, TypeCobolOptions compilerOptions, PerfStatsForParserInvocation perfStatsForParserInvocation) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementsParserStep.cs:ligne 266
           compute a = -300E+14

      *KO  "E"was invalid.  Skipped to the next verb, period or
      *    procedure-name definition.
      *    A blank was missing before character"E"in column 28.
      *    A blank was assumed.
      *TODO #2251 our scanner must scan it as "-300" (integer) 
      *    and "E"
Line 128[24,28] <16, Error, Tokens> - Invalid numeric literal format : expecting integer +12, or decimal +12,345, or floating point +12.345E-03
Line 128[12,18] <31, Error, Semantics> - Runtime error: System.IndexOutOfRangeException: L'index se trouve en dehors des limites du tableau.
   à TypeCobol.Compiler.Parser.CobolExpressionsBuilder.CreateArithmeticExpression(ArithmeticExpressionContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolExpressionsBuilder.cs:ligne 577
   à TypeCobol.Compiler.Parser.CobolStatementsBuilder.CreateComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolStatementsBuilder.cs:ligne 282
   à TypeCobol.Compiler.Parser.CodeElementBuilder.EnterComputeStatement(ComputeStatementContext context) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementBuilder\CobolCodeElementBuilder.cs:ligne 1596
   à TypeCobol.Compiler.Parser.Generated.CodeElementsParser.ComputeStatementContext.EnterRule(IParseTreeListener listener) dans C:\Users\SMEDILOL\workspaces\TypeCobol\obj\EI_Debug\TypeCobol\CodeElementsParser.cs:ligne 18430
   à Antlr4.Runtime.Tree.ParseTreeWalker.EnterRule(IParseTreeListener listener, IRuleNode r)
   à Antlr4.Runtime.Tree.ParseTreeWalker.Walk(IParseTreeListener listener, IParseTree t)
   à TypeCobol.Compiler.Parser.CodeElementsParserStep.ParseProcessedTokensLinesChanges(ProcessedTokensDocument processedTokensDocument, IList`1 processedTokensLinesChanges, PrepareDocumentLineForUpdate prepareDocumentLineForUpdate, TypeCobolOptions compilerOptions, PerfStatsForParserInvocation perfStatsForParserInvocation) dans C:\Users\SMEDILOL\workspaces\TypeCobol\TypeCobol\Compiler\Parser\CodeElementsParserStep.cs:ligne 266
           compute a = -300E
           .

       END PROGRAM DVZF0OSM.
