           10 REF-BIE               PIC X(19).
           10 ETA-BIE               PIC X(13).
           10 PTC-BIE               PIC X(4).
           10 NAT-BIE               PIC X(3).
      