           10 :CPXTST:-REF-BIE               PIC X(19).
           10 :CPXTST:-ETA-BIE               PIC X(13).
           10 :CPXTST:-PTC-BIE               PIC X(4).
           10 :CPXTST:-NAT-BIE               PIC X(3).
      