       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
Line 5[22,28] <27, Error, Syntax> - Syntax error : dynamic-length data items are not supported.
       01 var1 PIC X DYNAMIC.
Line 6[22,28] <27, Error, Syntax> - Syntax error : dynamic-length data items are not supported.
       01 var2 PIC X DYNAMIC LIMIT 2000.
Line 7[22,28] <27, Error, Syntax> - Syntax error : dynamic-length data items are not supported.
       01 var3 PIC X DYNAMIC LIMIT IS 2000.
Line 8[22,28] <27, Error, Syntax> - Syntax error : dynamic-length data items are not supported.
       01 var4 PIC X DYNAMIC LENGTH LIMIT 2000.
Line 9[22,28] <27, Error, Syntax> - Syntax error : dynamic-length data items are not supported.
       01 var5 PIC X DYNAMIC LENGTH LIMIT IS 2000.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM PGM1.
