       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FOO PIC X.
       01 WS-BAR PIC X.
      *EXHIBIT, NAMED and CHANGED are not reserved keywords
       01 EXHIBIT PIC X.
       01 CHANGED PIC X.
       01 NAMED PIC X.
       PROCEDURE DIVISION.
      *EXHIBIT statement is not supported
Line 13[12,18] <27, Error, Syntax> - Syntax error : extraneous input 'EXHIBIT' expecting {separator, numeric literal, character string, symbol, statement starting keyword, keyword, Formalized Comments elements, Sql statement starting keyword}
           EXHIBIT NAMED WS-FOO WS-BAR
           .
       END PROGRAM Pgm.
