       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 PIC X DYNAMIC.
       01 var2 PIC X DYNAMIC LIMIT 2000.
       01 var3 PIC X DYNAMIC LIMIT IS 2000.
       01 var4 PIC X DYNAMIC LENGTH LIMIT 2000.
       01 var5 PIC X DYNAMIC LENGTH LIMIT IS 2000.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM PGM1.