       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       data division.
       working-storage section.
       01 var1 pic X(5) value 'hi'.
       01 var2 pic X(5) value 'ho'.
       01 var3 pic X(5) value 'ho'.
       01 bool1 type bool.
       01 bool2 type bool.
       PROCEDURE DIVISION.
           evaluate true
Line 12[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
                when
                when bool1 display "evaluate"
                when bool1
                     when bool2 display "evaluate"
Line 16[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
Line 16[17,20] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when
                when other continue
           end-evaluate
           evaluate true
                when bool1 display "evaluate"
Line 21[17,26] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when bool1
                when other continue
           end-evaluate      
           search var1
Line 25[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
                when
                when var2
                    when var3 display "search"
Line 28[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
                when
           end-search
      
           move "hi" to var1
           goback.
       END PROGRAM Pgm.
