       IDENTIFICATION DIVISION.
       PROGRAM-ID. WhenTest.
       data division.
       working-storage section.
       01 var1 pic X(5) value 'hi'.
       01 var2 pic X(5) value 'ho'.
       01 var3 pic X(5) value 'ho'.
       01 bool1 pic 9.
       01 bool2 pic 9.
       PROCEDURE DIVISION.
           evaluate true
Line 12[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
                when
                when bool1 display "evaluate"
                when bool1
                     when bool2 display "evaluate"
Line 16[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
Line 16[17,20] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when
                when other continue
           evaluate true
                when bool1 display "evaluate"
Line 20[17,26] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when bool1
                when other continue
Line 22[12,22] <27, Error, Syntax> - Syntax error : Cannot SEARCH in 'var1', data item is not a table.
           search var1
Line 23[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
Line 23[17,20] <27, Error, Syntax> - Syntax error : extraneous input 'when' expecting {AtEndCondition, WhenSearchCondition, SearchStatementEnd}
                when
                when var2
                    when var3 display "search"
Line 26[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
                when
Line 27[12,21] <27, Error, Syntax> - Syntax error : extraneous input 'end-search' expecting {SentenceEnd, AcceptStatement, AddStatement, AllocateStatement, AlterStatement, CallStatement, CancelStatement, CloseStatement, ComputeStatement, ContinueStatement, DeleteStatement, DisplayStatement, DivideStatement, EntryStatement, EvaluateStatement, ExecStatement, ExitMethodStatement, ExitProgramStatement, ExitStatement, FreeStatement, GobackStatement, GotoStatement, IfStatement, InitializeStatement, InspectStatement, InvokeStatement, JsonGenerateStatement, JsonParseStatement, MergeStatement, MoveStatement, MultiplyStatement, OpenStatement, PerformProcedureStatement, PerformStatement, ReadStatement, ReleaseStatement, ReturnStatement, RewriteStatement, SearchStatement, SetStatement, SortStatement, StartStatement, StopStatement, StringStatement, SubtractStatement, UnstringStatement, WriteStatement, XmlGenerateStatement, XmlParseStatement, ProcedureStyleCall}
           end-search
           evaluate true
                when bool1 display "evaluate"
                when other
           move "hi" to var1
           goback.
Line 33[8,28] <27, Error, Syntax> - Syntax error : Unexpected orphan "PROGRAM END".
Line 33[8,28] <37, Warning, General> - Warning: a End statement is not aligned with the matching opening statement
       END PROGRAM WhenTest.
