       IDENTIFICATION DIVISION.
       PROGRAM-ID. WhenTest.
       data division.
       working-storage section.
       01 var1 pic X(5) value 'hi'.
       01 var2 pic X(5) value 'ho'.
       01 var3 pic X(5) value 'ho'.
       01 bool1 pic 9.
       01 bool2 pic 9.
       PROCEDURE DIVISION.
           evaluate true
Line 12[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
                when
                when bool1 display "evaluate"
                when bool1
                     when bool2 display "evaluate"
Line 16[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
Line 16[17,20] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when
                when other continue
           evaluate true
                when bool1 display "evaluate"
Line 20[17,26] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when bool1
                when other continue
Line 22[12,22] <27, Error, Syntax> - Syntax error : Cannot SEARCH in 'var1', data item is not a table.
           search var1
Line 23[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
Line 23[17,20] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when
Line 24[17,25] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when var2
                    when var3 display "search"
Line 26[17,20] <27, Error, Syntax> - Syntax error : Missing condition in "when" clause
Line 26[17,20] <27, Error, Syntax> - Syntax error : Missing statement in "when" clause
                when
           end-search
           evaluate true
                when bool1 display "evaluate"
                when other
           move "hi" to var1
           goback.
       END PROGRAM WhenTest.
