           05 CPYTST-Arg.
              10 CPYTST-CLE.
                 15 CPYTST-CLE-BQE      PIC X(05).
                 15 CPYTST-CLE-CAI      PIC X(05).
      