           05  xxxENT2::-FCT01.
               10 xxxENT2::-FCT01-Var1            PIC X(05).
       01  xxxENT1. COPY YxxxENT REPLACING ==::== BY ====.