       IDENTIFICATION DIVISION.
       PROGRAM-ID. Callee.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CONVEAL. COPY  YCONVEA.

       PROCEDURE DIVISION.
       DECLARE PROCEDURE MySecondPublicProcedure PUBLIC
           INPUT vect2        TYPE Date
         .
       PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM Callee.
