       IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPGM.                   
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       DATA DIVISION.
       WORKING-STORAGE section.
          01 PRTD20L. COPY  YPRTD20.   
      
       PROCEDURE DIVISION.
       EXEC SQL INCLUDE YTTMCOI END-EXEC.
           GOBACK
           .
       END PROGRAM MYPGM.