       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZMFT0.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 StructureType typedef strict PRIVATE.
          05 champ PIC X(1).

       01 ScalarType typedef strict PRIVATE PIC X(1).

       01 C-DatePivot   TYPE Date VALUE '20190101'.
       01 C-DefaultRate TYPE Rate VALUE 3.55.

       01 Structure1 VALUE 'A' TYPE StructureType.
       01 Scalar1    VALUE 'B' TYPE ScalarType.
       01 Inline1    VALUE 'C' PIC X(1).

       01 Structure2 TYPE StructureType VALUE 'D'.
       01 Scalar2    TYPE ScalarType    VALUE 'E'.
       01 Inline2    PIC X(1)           VALUE 'F'.

       01 Structure3
          TYPE StructureType.

       PROCEDURE DIVISION.
       DECLARE PROCEDURE Proc PRIVATE
          INPUT paramIntrinsicDate TYPE Date VALUE '20190102'
                paramIntrinsicRate TYPE Rate VALUE 4.09
                paramStructure     TYPE StructureType VALUE 'D'
                paramScalar        TYPE ScalarType    VALUE 'E'
                paramInline        PIC X(1)           VALUE 'F'.
       PROCEDURE DIVISION.
             DISPLAY paramIntrinsicDate
             DISPLAY paramIntrinsicRate
             DISPLAY paramStructure
             DISPLAY paramScalar
             DISPLAY paramInline
          .
       END-DECLARE.
          .
       END PROGRAM DVZZMFT0.