       IDENTIFICATION DIVISION.
       PROGRAM-ID. Simple.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 PIC X.
       01 var2 PIC X(20).
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM Simple.