       IDENTIFICATION DIVISION.
       PROGRAM-ID. Simple.
       PROCEDURE DIVISION.
       main.
           GOBACK
           .
       END PROGRAM Simple.