       IDENTIFICATION DIVISION.
       PROGRAM-ID. Simple.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 pic x.
          88 cond1 value 'a'.
          88 cond2 value 'b'.
       01 var2 pic x(20).
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM Simple.