       IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPGM.                   
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       DATA DIVISION.
       WORKING-STORAGE section.
          01 PRTD20L. COPY  YPRTD20L.   
          01 CONVEAL. COPY  YCONVEAL.   
      
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM MYPGM.