       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
       DATA DIVISION.
       Working-STORAGE SECTION.
       01  myname1      PIC X(15).
      
       PROCEDURE DIVISiON.
       INIT-LIBRARY.
           EXIT.
      
       TRAITEMENT.
      *OK  call STACKED::Foo input myname1
           call STACKED::Foo input myname1
           .
      
       END PROGRAM PGM1.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. STACKED.
       PROCEDURE DIVISION.
       declare procedure Foo public
           input myname pic x(15).
       procedure division.
           goback.
       end-declare.
      
       END PROGRAM STACKED.