       IDENTIFICATION DIVISION.
       PROGRAM-ID. Callee.
       data division.
       working-storage section.

       01 Calendar TYPEDEF STRICT PUBLIC pic X.
           88 Gregorian value 'G'.
       PROCEDURE DIVISION.


       DECLARE PROCEDURE MyPublicProcedure PUBLIC
           INPUT mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM Callee.
