       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCIntrinsic.
       DATA DIVISION.
       WORKING-STORAGE SECTION. 

       01 DateJulian TYPEDEF STRONG.
         10 YYYY PIC 9(04).
         10 DDD  PIC 9(03).    
       01 DateDB2 TYPEDEF STRONG.
         10  YYYY PIC 9(04).
         10  filler-X PIC X.
         10  MM PIC 9(02).
         10  filler-X PIC X.
         10  DD PIC 9(02).
       
       procedure division.
 
       goback
       .
       END PROGRAM TCIntrinsic.