       IDENTIFICATION DIVISION.
       PROGRAM-ID. LevelChecker.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 myPic TYPEDEF STRICT pic x.

       01 myType TYPEDEF STRICT.
            05 myVar PIC X(10).
            05 secondGroup.
                10 typedGroupvar TYPE secondType.

       01 secondType TYPEDEF STRICT.
            05 Group.
                10 vargroup PIC X(10).

       01 Group.

      *OK level of this variable is ok
       45 MyVar2 TYPE myType.
      *KO level of this varaible is to high
       48 MyVar1 TYPE myType.
      *OK type does not contains children
       77 MYVar3 TYPE myPic.
      *OK type does not contains children
       77 MYVar4 TYPE BOOL.
      *KO type contains children
       77 MYVar5 TYPE DATE.

       PROCEDURE DIVISION.
       END PROGRAM LevelChecker.