       IDENTIFICATION DIVISION.
       PROGRAM-ID. RedefinesTest.

       DATA DIVISION.
       WORKING-storage section.
       01 MyVar1.
           05 MyVar2 PIC X.

       01 MyVar2 PIC X(05).
       01 MyVar2 PIC X(09).
       01 MyRedifines REDEFINES MyVar2.
       01 MyRedifines2 REDEFINES MyVar2.

       01 MyRedifines3 REDEFINES MyVar1.

       PROCEDURE DIVISION.
       .

       END PROGRAM RedefinesTest.