IDENTIFICATION DIVISION.
  PROGRAM-ID. TypeCobol.

DATA DIVISION.


WORKING-STORAGE SECTION.

01 Feature TYPEDEF.
  02 Feature-name PIC X(15) OCCURS 10.
01 Equipment.
  02 Equipment-id OCCURS 100 TIMES.
    03 Feature-list TYPE Feature.

01 Vect2 TYPEDEF.
  11 Coord2d.
    15 X PIC 9.
    12 Y PIC 9.
  05 Coord3d.
    10 Z PIC 9.
01 Point.
  05 Position2d TYPE Vect2.
  05 Movment2d.
    14 Accel2d  TYPE Vect2.
    10 Speed2d  TYPE Vect2.

* KO: no TYPEDEF for this TYPE
01 unknown TYPE TypeNotDefined.

* KO: TYPEDEF is for Level-01 items
01 LevelKOGroup.
  05 LevelKO TYPEDEF.
    10 LevelKOItem PIC 9.
01 varLevelKO TYPE LevelKO.

* KO: TYPEDEF clause must be before the rest
01 ClausesOrderKO pic X(15) TYPEDEF.
01 varClausesOrderKO TYPE ClausesOrderKO.
* OK: ... like this
01 ClausesOrderOK TYPEDEF PIC X(15).
01 varClausesOrderOK TYPE ClausesOrderOK.

* KO: no subordinates or picture = no description
01 NoDescription TYPEDEF STRONG.
01 varNoDescription TYPE NoDescription.

* KO: elementary items cannot be STRONG
01 CannotBeStrong TYPEDEF STRONG PIC X(15).
01 varCannotBeStrong TYPE CannotBeStrong.

* KO: no REDEFINES clause with TYPEDEF
01 NoRedefines1 REDEFINES ClausesOrderOK TYPEDEF PIC X.
01 varNoRedefines1 TYPE NoRedefines1.
01 NoRedefines2 REDEFINES ClausesOrderOK TYPEDEF STRONG.
   05 NoRedefines1Item PIC X.
01 varNoRedefines2 TYPE NoRedefines2.
01 NoRedefines3 REDEFINES TypeNotDefined TYPEDEF.
   05 NoRedefines1Item PIC X.
01 varNoRedefines3 TYPE NoRedefines3.
*KO, Cobol 2014 is not clear, but TypeCobol forbid it for now. Better be more restrictive.
01 varNoRedefines4 TYPEDEF.
    05 varNoRedefines4A pic X.
    05 varNoRedefines4B redefines varNoRedefines4A pic 9.

*KO varNoRedefines5bis can't rededines data from another TYPEDEF
01 varNoRedefines5 TYPEDEF.
    05 varNoRedefines5-a pic X.
01 varNoRedefines5bis TYPEDEF.
    05 varNoRedefines5bis-a redefines varNoRedefines5-a pic 9.

* KO: no EXTERNAL clause with TYPEDEF
01 ExternalType1 TYPEDEF EXTERNAL.
  02 varExternalType1 PIC X(15).
* KO: External must be at level 01
01 ExternalType2 TYPEDEF.
  02 varExternalType2 PIC X(15) EXTERNAL.



PROCEDURE DIVISION.
01 OutOfPerimeter2 TYPEDEF.
  02 OutOfPerimeter2-var1 PIC X.

MOVE X OF Coord2d OF Accel2d OF Movment2d OF Point TO X OF Coord2d OF Speed2d OF Movment2d OF Point.
MOVE Y OF Coord2d OF Position2d TO Z OF Coord3d OF Position2d.
MOVE X OF Coord3d TO Y.

*------>Except a Type is not referenced on lines 34, 45, 49, 59