       01  TypedefWeak1 TYPEDEF.
          05 UnusedTypeDef-Var1       pic X(50).
          05 UnusedTypeDef-Var2       pic X(50).
       
       01  TypedefWeak2 TYPEDEF public.
          05 LIG-DET                  pic X(50).
          05 LIG-NB                   pic X(50).
