       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
       data division.
       working-storage section.
Line 5[10,26] <30, Error, Semantics> - Error in copy 'TypedefWeak' at line 5 : Semantic error: TYPEDEF with explicit visibility qualifier is not allowed within a copy. Please review the 'TypedefWeak' copy.
         COPY TypedefWeak.
         01 var1 type TypedefWeak1.
         01 var2 type TypedefWeak2.
       END PROGRAM MainProgram.
