       01  TypedefStrong1 TYPEDEF STRONG.
          05 UnusedTypeDef-Var1       pic X(50).
          05 UnusedTypeDef-Var2       pic X(50).
       
       01  TypedefStrong2 TYPEDEF STRONG public.
          05 LIG-DET                  pic X(50).
          05 LIG-NB                   pic X(50).
