       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
       data division.
       working-storage section.
Line 5[25,31] <27, Error, Syntax> - Error in copy 'TypedefWeak' at line 1 : Syntax error : Custom EI rule : Type 'TypedefWeak1' must be marked as STRICT.
Line 5[25,31] <27, Error, Syntax> - Error in copy 'TypedefWeak' at line 5 : Syntax error : Custom EI rule : Type 'TypedefWeak2' must be marked as STRICT.
Line 5[8,39] <30, Error, Semantics> - Semantic error: TYPEDEF with explicit visibility qualifier is not allowed within a copy. Please review the 'TypedefWeak' copy.
         COPY TypedefWeak.
         01 var1 type TypedefWeak1.
         01 var2 type TypedefWeak2.
       END PROGRAM MainProgram.
