       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
       data division.
       working-storage section.
Line 5[8,48] <30, Error, Semantics> - Semantic error: TYPEDEF with explicit visibility qualifier is not allowed within a copy. Please review the 'TypedefStrong' copy.
         COPY TypedefStrong.
         01 var1 type TypedefStrong1.
         01 var2 type TypedefStrong2.
       END PROGRAM MainProgram.
