 IDENTIFICATION DIVISION.                                        
 PROGRAM-ID. PGMA.                                           
 DATA DIVISION.                                                  
 REPLACE ==UBININT-2== BY ==PIC 9==.              
 LOCAL-STORAGE SECTION.                                                                                 
 01 var UBININT-2.                
 PROCEDURE DIVISION.                                                                                                                                            
     .                                                          
 REPLACE OFF.                                       
 END PROGRAM PGMA.                                                                                