       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
       data division.
       working-storage section.
       01 dataMain1 pic X.
       01 dataMain2 pic X global.
      
       procedure division.
      *KO dataNested21 and dataNested22 don't exists in MainProgram
            move dataNested21 to dataNested22
      *KO dataNested1 and dataNested2 don't exists in MainProgram
            move dataNested1 to dataNested2
            move dataMain1 to dataMain2
            .


       declare procedure checkMain private
                 input paramMain1 pic X.
       data division.
       working-storage section.
       01 dataProc1 pic X.
       procedure division.
            move dataProc1 to paramMain1
      *KO dataNestedProc1 and paramNested1 only exist in procedure checkNested
            move dataNestedProc1 to paramNested1
      *KO dataNestedProc21 and paramNested21 only exist in procedure checkNested2
            move dataNestedProc21 to paramNested21
      *KO dataNested21 and dataNested22 don't exist in checkMain
            move dataNested21 to dataNested22
      *KO dataNested1 and dataNested2 don't exist in checkMain
            move dataNested1 to dataNested2
      *KO dataMain1 and dataMain2 don't exist in checkMain
            move dataMain1 to dataMain2
            .
       end-declare.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested.
       data division.
       working-storage section.
       01 dataNested1 pic X.
       01 dataNested2 pic X global.
      
       PROCEDURE DIVISION.
      *KO dataNested21 and dataNested22 don't exists in Nested
            move dataNested21 to dataNested22
            move dataNested1 to dataNested2
      *KO dataMain1 is not declared as global
            move dataMain1 to dataMain2
            .

       declare procedure checkNested private
                 input paramNested1 pic X.
       data division.
       working-storage section.
       01 dataNestedProc1 pic X.
       procedure division.
      *KO dataProc1 and paramMain1 only exist in procedure checkMain
            move dataProc1 to paramMain1

            move dataNestedProc1 to paramNested1
      *KO dataNestedProc21 and paramNested21 only exist in procedure checkNested2
            move dataNestedProc21 to paramNested21
      *KO dataNested21 and dataNested22 don't exist in checkNested
            move dataNested21 to dataNested22
      *KO dataNested1 and dataNested2 don't exist in checkNested
            move dataNested1 to dataNested2
      *KO dataMain1 and dataMain2 don't exist in checkNested
            move dataMain1 to dataMain2
            .
       end-declare.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested2.
       data division.
       working-storage section.
       01 dataNested21 pic X.
       01 dataNested22 pic X global.
      
       PROCEDURE DIVISION.
            move dataNested21 to dataNested22
      *KO dataNested1 is not declared as global
            move dataNested1 to dataNested2
      *KO dataMain1 is not declared as global
            move dataMain1 to dataMain2
            .
       declare procedure checkNested2 private
                 input paramNested21 pic X.
       data division.
       working-storage section.
       01 dataNestedProc21 pic X.
       procedure division.
      *KO dataProc1 and paramMain1 only exist in procedure checkMain
            move dataProc1 to paramMain1
      *KO dataNestedProc1 and paramNested1 only exist in procedure checkNested
            move dataNestedProc1 to paramNested1

            move dataNestedProc21 to paramNested21
      *KO dataNested21 and dataNested22 don't exist in checkNested2
            move dataNested21 to dataNested22
      *KO dataNested1 and dataNested2 don't exist in checkNested2
            move dataNested1 to dataNested2
      *KO dataMain1 and dataMain2 don't exist in checkNested2
            move dataMain1 to dataMain2
            .
       end-declare.
       END PROGRAM Nested2.
       END PROGRAM Nested.
       END PROGRAM MainProgram.