       IDENTIFICATION DIVISION.
       PROGRAM-ID. MYCPYTST.  

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 XMYCOPY-X.
          COPY XMYCOPY REPLACING ==:MYCOPY:== BY ==MYCOPY== .
       01 MYCOPY-X2. COPY XMYCOPY1.
       01 MYCOPY1-Y. COPY YMYCOPY1.
       PROCEDURE DIVISION.
	          MOVE 4 TO MYCOPY-CODE.
	          MOVE 'B' TO MYCOPY1-DATA.
       END PROGRAM MYCPYTST.
      