       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 KeepMe0.    COPY CPYKR01.
       procedure division.
           goback
           .
       END PROGRAM MyPGM.