       01  FILLER.
000000 01  RemoveMe1                          PIC X(10000). 
000000 01  RemoveMe2 REDEFINES ADPE99. 
000000      05 KeepMe1 pic X.
000000 01 RemoveMe3.
000000      05 KeepMe2 pic X.
000000  01 RemoveMe4 pic X.
000000   01 KeepMe3 pic X.
000000    01 KeepMe4.
000000      05 KeepMe5 pic X.
000000   01 KeepMe6 pointer.
000000   01 KeepMe7 pointer.
000000   01 KeepMe8 pointer.