000000*Don't except any errors
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.  MyPGM.
000270*REMARKS. COPY=(YXXXFAL YXXXFAS
000280*               YXXXFALM YXXXFASM).
000000 DATA DIVISION.
000000 working-storage section.
       01 XXXFAL.  COPY YXXXFAL.
       01 XXXFALM. COPY YXXXFALM.
       01 XXXFAS.  COPY YXXXFAS.
       01 XXXFASM. COPY YXXXFASM.
001750 PROCEDURE DIVISION.
001960     .