000000*Don't except any errors
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.  MyPGM.
000270*REMARKS. COPY=(YXXXFAL
000280*               YXXXFALS).
000000 DATA DIVISION.
000000 working-storage section.
       01 YXXXFAL.  COPY YXXXFAL.
       01 YXXXFALS. COPY YXXXFALS.
001750 PROCEDURE DIVISION.
001960     .