       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *Ko because placeholders are not replaced
       01 MECOPY. COPY YMECOPY.
       PROCEDURE DIVISION.
           .
       END PROGRAM Pgm.