       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *Ko no automatic suffixing mechanism for CPX and YTSTCPX1 doesn't exist
       COPY YTSTCPX1.
       PROCEDURE DIVISION.
           .
       END PROGRAM Pgm.