       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *Ko level 01 is systematically erased when included copybook is CPY
       COPY YMYCOPY.
       PROCEDURE DIVISION.
           .
       END PROGRAM Pgm.