       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *Ko because placeholders not replaced
       COPY YTSTCPM.
       PROCEDURE DIVISION.
           .
       END PROGRAM Pgm.