       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AllUpper. COPY YXXXAAAS.
       01 Mix1.     COPY YxxxaaaT.
       01 Mix2.     COPY YXXXAAAu.
       01 AllLower. COPY Yxxxaaav.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM Pgm.