       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0SOM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 AAABBB. COPY YAAABBBZ.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM DVZF0SOM.