       01 MYCOPY1.
          05  MYCOPY1-ENTREE.
              10  MYCOPY1-FONC                PIC X(03).
                  88  MYCOPY1-FONC-STD        VALUE '001'.
