       01 CONVEA.
         05  CONVEA-VEA-VEA-OUT-VEA pic X.
         05  CONVEA-VEA-VEA-OUT-VEA-2 pic X.
         05  CONVEA pic X.
         05  CONVEA-VEA pic X.
         05  ANOTHER-DATA pic X.
         05  CONVEA-VEATEST pic X.
         05  CONVEA-TESTVEA pic X.
         05  CONVEA-TESTVEA-TEST pic X.
         05  CONVEA-TESTVEATEST pic X.