      *01  WK-MAXI.
      
000070 77  WK-MAXI-QOCC-0001             PIC 9(2)       VALUE 01.       0000000
000090 77  WK-MAXI-QOCC-0002             PIC 9(2)       VALUE 01.       0000000
000110 77  WK-MAXI-QOCC-0003             PIC 9(2)       VALUE 01.       0000000