       01 XXXAAA.
          05 AAA-var1 PIC X.
          05 aaa-var2 PIC X.
          05 AAAvar3  PIC X.
          05 aaavar4  PIC X.
          05 AAA      PIC X.
          05 aaa      PIC X.
          05 AAA-AAA  PIC X.