000010     EXIT
000020     EXIT METHOD
000030     EXIT PARAGRAPH
000040     EXIT SECTION
000050     EXIT PERFORM
000060     EXIT PERFORM cycl
000070     EXIT PERFORM CYCLE
000080     EXIT PERFORM cycle
000090     EXIT PROGRAM