000010 END CLASS MyClass.
000020 ID DIVISION. CLASS-ID. MyClass1 INHERITS JavaLangObject.
000030 IDENTIFICATION DIVISION. CLASS-ID. MyClass2 INHERITS 
000035 MyFatherClass.
000040 AUTHOR. Mister X
000050         Mister Y
000060 DATE-WRITTEN. 01/01/1900
000070               31/12/2030
000080 END FACTORY.
000090 ID DIVISION. FACTORY.
000100 IDENTIFICATION DIVISION. FACTORY.
000110 END METHOD 'MyMethod'.
000120 ID DIVISION. METHOD-ID. "MyMethod1".
000130 IDENTIFICATION DIVISION. METHOD-ID 'MyMethod2'
000140 SECURITY. None
000150 DATE-COMPILED. 01/01/2000
000160 INSTALLATION. Never
000170 END OBJECT.
000180 ID DIVISION. OBJECT.
000190 IDENTIFICATION DIVISION. OBJECT.
000200 END PROGRAM MyProgram.
000210 ID DIVISION. PROGRAM-ID. MyProgram1.
000220 IDENTIFICATION DIVISION. PROGRAM-ID. MyProgram2 RECURSIVE 
000225 PROGRAM.
000230 AUTHOR. Toto
000230 DATE-COMPILED. Date 1
000230 DATE-WRITTEN. Date 2
000230 INSTALLATION. 
000240     Environment 1
000250     Environment 2
000260 SECURITY. Hidden
000270 IDENTIFICATION DIVISION. PROGRAM-ID. MyProgram3 IS COMMON 
000275 INITIAL.
000280 ID DIVISION. PROGRAM-ID. MyProgram4 COMMON PROGRAM.