MOVE CORRESPONDING a TO x
* intrinsic function
MOVE FUNCTION RANDOM TO x
MOVE FUNCTION LENGTH (x) TO x
* special registers
MOVE LENGTH OF x TO x
MOVE LENGTH x TO x
MOVE x TO LENGTH OF x
MOVE x TO LENGTH x
MOVE x TO Tab(TALLY)
MOVE x TO Tab(ALL)
MOVE XML-CODE TO result-xml
MOVE JSON-CODE TO result-json-code
MOVE JSON-STATUS TO result-json-status
* continuations
                 MOVE 'Lorem ipsum dolor sit amet, consectetur adi
-               'piscing elit, sed do eiusmod tempor incididunt ut
-               'labore et dolore magna aliqua                 '  
                                         TO  SOMEWHERE           