000010 OBJECT-COMPUTER.
000020 OBJECT-COMPUTER. IBM-370.
000030 OBJECT-COMPUTER. IBM-371 MEMORY 1024 WORDS.
000040 OBJECT-COMPUTER. IBM-372 MEMORY SIZE 4096 CHARACTERS.
000050 OBJECT-COMPUTER. IBM-373 MEMORY SIZE 100000 MODULES.
000060 OBJECT-COMPUTER. IBM-374 SEQUENCE STANDARD-1.
000070 OBJECT-COMPUTER. IBM-375 PROGRAM COLLATING SEQUENCE IS MyAlphabet
000071-1.
000080 OBJECT-COMPUTER. IBM-376 SEGMENT-LIMIT 10.
000090 OBJECT-COMPUTER. IBM-377 SEGMENT-LIMIT IS 40.
000100 OBJECT-COMPUTER. IBM-378 MEMORY SIZE 16000 CHARACTERS PROGRAM COL
000101-LATING SEQUENCE IS MyAlphabet2 SEGMENT-LIMIT IS 49.
000110       REPOSITORY.
000120       REPOSITORY.
000130 CLASS MyClass1.
000140       Repository. 
000150 Class jobjectArray is "jobjectArray" 
000160 Class Employee is "com.acme.Employee" 
000170 Class Department is "jobjectArray:com.acme.Employee". 
000180 SOURCE-COMPUTER.
000190 SOURCE-COMPUTER. IBM-390.
000200 SOURCE-COMPUTER. IBM-391 DEBUGGING MODE.
000210 SOURCE-COMPUTER. IBM-392 WITH DEBUGGING MODE.
000220 SPECIAL-NAMES.
000230 SPECIAL-NAMES.
000240 SYSIN MyInput
000250 SYSOUT IS MyOutput
000260 AFP-5A IS MyAdvFuncPrint.
000270 SPECIAL-NAMES.
000280 UPSI-0 MySwitch0
000290 UPSI-1 IS MySwitch1
000300 UPSI-2 ON MyCondition2-ON
000310 UPSI-3 OFF STATUS IS MyCondition3-OFF
000320 UPSI-4 MySwitch4 ON MyCondition4-ON OFF MyCondition4-OFF
000330 UPSI-5 IS MySwitch5 OFF STATUS IS MyCondition5-OFF ON STATUS IS 
000331 MyCondition5-ON.
000340 SPECIAL-NAMES.
000350 ALPHABET MyStdAplhabet1 STANDARD-1
000360 ALPHABET MyStdAlphabet2 IS EBCDIC
000370 ALPHABET MyUsrAlphabet1 "abc" 'd' THROUGH 'f' "g" ALSO "h" ALSO 
000371 "i" 66 32 THRU 40 70 ALSO 73 ALSO 75. 
000380 SPECIAL-NAMES.
000390 SYMBOLIC MySimChar1 33
000400 SYMBOLIC CHARACTERS MySimChar2 IS 33 MySimChar3 MySimChar4 ARE 
000401 34 35
000410 SYMBOLIC CHARACTERS MySimChar5 MySimChar6 MySimChar7 150 154 157
000411  IN MyStdAlphabet2.
000420 SPECIAL-NAMES.
000430 CLASS MyCharset1 "abcd"
000440 CLASS MyCharset2 IS "abc" "d" THROUGH "j" 38 57 THRU 78.
000450 SPECIAL-NAMES.
000460 CURRENCY "H"
000470 CURRENCY "EUR" PICTURE SYMBOL '€'
000480 CURRENCY SIGN IS X"9F" WITH PICTURE SYMBOL 'Y'
000490 CURRENCY SIGN ""
000500 CURRENCY SIGN "HK$" PICTURE SYMBOL ""
000510 CURRENCY "Currency1"
000520 CURRENCY "Currency2" PICTURE SYMBOL "CC1"
000530 CURRENCY "A"
000540 CURRENCY "Currency3" PICTURE SYMBOL "0"
000550 CURRENCY "Currency4" PICTURE SYMBOL 'Y'.
000560 SPECIAL-NAMES.
000570 DECIMAL-POINT COMMA
000580 DECIMAL-POINT IS COMMA.
000590 SPECIAL-NAMES.
000600 XML-SCHEMA MyXmlSchema1 ExtFile1
000610 XML-SCHEMA MyXmlSchema2 IS "ExtFile2".