       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOMFL06.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 PIC X.
       01 other-data PIC X.
       01 var2 PIC 9.
       01 group1.
          05 var3 PIC X.
          05 group2.
             10 var4 PIC 9.
       01 not-suggested PIC X.
       PROCEDURE DIVISION.
      * STRING is not supported for completion yet.
      * Cursor after keyword, suggest variables
           STRING 
           GOBACK
           .
       END PROGRAM TCOMFL06.
---------------------------------------------------------------------------------
{"line":15,"character":18}
---------------------------------------------------------------------------------
[
  {
    "label": "group1 (Alphanumeric) (group1)",
    "kind": 6,
    "insertText": "group1"
  },
  {
    "label": "group2 (Alphanumeric) (group1::group2)",
    "kind": 6,
    "insertText": "group1::group2"
  },
  {
    "label": "not-suggested (Alphanumeric) (not-suggested)",
    "kind": 6,
    "insertText": "not-suggested"
  },
  {
    "label": "other-data (Alphanumeric) (other-data)",
    "kind": 6,
    "insertText": "other-data"
  },
  {
    "label": "var1 (Alphanumeric) (var1)",
    "kind": 6,
    "insertText": "var1"
  },
  {
    "label": "var2 (Numeric) (var2)",
    "kind": 6,
    "insertText": "var2"
  },
  {
    "label": "var3 (Alphanumeric) (group1::var3)",
    "kind": 6,
    "insertText": "group1::var3"
  },
  {
    "label": "var4 (Numeric) (group1::group2::var4)",
    "kind": 6,
    "insertText": "group1::group2::var4"
  }
]