       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOMFL06.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 PIC X.
       01 other-data PIC X.
       01 var2 PIC 9.
       01 group1.
          05 var3 PIC X.
          05 group2.
             10 var4 PIC 9.
       01 not-suggested PIC X.
       PROCEDURE DIVISION.
      * STRING is not supported for completion yet.
      * Cursor after keyword, suggest variables using filter
           STRING v
           GOBACK
           .
       END PROGRAM TCOMFL06.
---------------------------------------------------------------------------------
{"line":15,"character":19}
---------------------------------------------------------------------------------
[
  {
    "label": "var1 (Alphanumeric) (var1)",
    "kind": 6,
    "insertText": "var1",
    "data": {
      "start": {
        "line": 15,
        "character": 18
      },
      "end": {
        "line": 15,
        "character": 19
      }
    }
  },
  {
    "label": "var2 (Numeric) (var2)",
    "kind": 6,
    "insertText": "var2",
    "data": {
      "start": {
        "line": 15,
        "character": 18
      },
      "end": {
        "line": 15,
        "character": 19
      }
    }
  },
  {
    "label": "var3 (Alphanumeric) (group1::var3)",
    "kind": 6,
    "insertText": "group1::var3",
    "data": {
      "start": {
        "line": 15,
        "character": 18
      },
      "end": {
        "line": 15,
        "character": 19
      }
    }
  },
  {
    "label": "var4 (Numeric) (group1::group2::var4)",
    "kind": 6,
    "insertText": "group1::group2::var4",
    "data": {
      "start": {
        "line": 15,
        "character": 18
      },
      "end": {
        "line": 15,
        "character": 19
      }
    }
  }
]