       IDENTIFICATION DIVISION.
       PROGRAM-ID. TTTLBDEC.
       AUTHOR. REYDELPA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.      DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  Dec TYPEDEF STRICT PUBLIC.
             05 I PIC X(02).
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       
      
       END PROGRAM TTTLBDEC.
      