      *Callee contains public procedure
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Callee.

       DATA DIVISION.
       working-storage section.

       01  somedate     TYPE Date.
       01  someformat   PIC X(08).
       01  flag         TYPE Bool.
       01  realformat   PIC X(08).

       01 TechnicalContext TYPEDEF STRICT PUBLIC.
            05 TechName PIC X(8).
      * #723 It's crappy to need CALLEE:: in this situation
            05 Site TYPE CALLEE::SITE.

       01 SITE TYPEDEF STRICT PUBLIC.
            05 SiteName PIC X(8).

       PROCEDURE DIVISION.
       
       declare procedure check public
          input mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       declare procedure check2 public
          input mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       declare procedure check2 public
          input mydate        TYPE Date
                myDate2       type date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       DECLARE PROCEDURE MyPublicProcedure PUBLIC
           INPUT mydate        TYPE Date
                 format        PIC X(08)
          OUTPUT okay          TYPE Bool
                 actual-format PIC X(08).
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM Callee.
