       IDENTIFICATION DIVISION.
       PROGRAM-ID. FO200001.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370
                        .
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.


       01  FO2FAW. COPY YFO2FAW.
       01  FO2FRW. COPY YFO2FRW.
       01  FO2E1L. COPY YFO2E1L.
       01  FO2S1L. COPY YFO2S1L.
      


       PROCEDURE DIVISION.