       01 FO2E01.
          02 FO2E01-DD.
           05 FILX0000 PIC X(96).
           05 FILX0001 PIC X(96).
           05 FILX0002 PIC X(96).
           05 FILX0003 PIC X(96).
           05 FILX0004 PIC X(96).
           05 FILX0005 PIC X(96).
           05 FILX0006 PIC X(96).
           05 FILX0007 PIC X(96).
           05 FILX0008 PIC X(96).
           05 FILX0009 PIC X(96).
           05 FILX0010 PIC X(96).
          02 FO2E01-LGMAX-LTNV PIC S9(9) BINARY VALUE 233.