       01 YFO2FAL.
          02 YFO2FAL-DD.
           05 FILX0000 PIC X(96).
           05 FILX0001 PIC X(96).
           05 FILX0002 PIC X(96).
           05 FILX0003 PIC X(96).
           05 FILX0004 PIC X(96).
           05 FILX0005 PIC X(96).
           05 FILX0006 PIC X(96).
           05 FILX0007 PIC X(96).
           05 FILX0008 PIC X(96).
           05 FILX0009 PIC X(96).
           05 FILX0011 PIC X(96).
           05 FILX0012 PIC X(96).
           05 FILX0013 PIC X(96).
           05 FILX0014 PIC X(96).
           05 FILX0015 PIC X(96).
           05 FILX0016 PIC X(96).
           05 FILX0017 PIC X(96).
          02 YFO2FAL-LGMAX-LTNV PIC S9(9) BINARY VALUE 481.