       01 FOOT12.
          02 FOOT12-DD.
           05 FILX0000 PIC X(96).
           05 FILX0001 PIC X(96).
           05 FILX0002 PIC X(96).
           05 FILX0003 PIC X(96).
           05 FILX0004 PIC X(96).
           05 FILX0005 PIC X(96).
           05 FILX0006 PIC X(96).
           05 FILX0007 PIC X(96).
           05 FILX0008 PIC X(96).
           05 FILX0009 PIC X(96).
           05 FILX0011 PIC X(96).
           05 FILX0012 PIC X(96).
           05 FILX0013 PIC X(96).
           05 FILX0014 PIC X(96).
           05 FILX0015 PIC X(96).
           05 FILX0016 PIC X(96).
           05 FILX0017 PIC X(96).
           05 FILX0018 PIC X(96).
           05 FILX0019 PIC X(96).
           05 FILX0020 PIC X(96).
           05 FILX0021 PIC X(96).
           05 FILX0022 PIC X(96).
           05 FILX0023 PIC X(96).
           05 FILX0024 PIC X(96).
           05 FILX0025 PIC X(96).
           05 FILX0026 PIC X(96).
           05 FILX0027 PIC X(96).
           05 FILX0028 PIC X(96).
           05 FILX0029 PIC X(96).
           05 FILX0030 PIC X(96).
           05 FILX0031 PIC X(96).
           05 FILX0032 PIC X(96).
           05 FILX0033 PIC X(96).
           05 FILX0034 PIC X(96).
           05 FILX0035 PIC X(96).
           05 FILX0036 PIC X(96).
          02 FOOT12-LGMAX-LTNV PIC S9(9) BINARY VALUE 23260.