       01 FOOT01.
         02 FOOT01-COB.
          05 FOOT01-DAT-DMD.
             10 FOOT01-DAT-DMD9            pic  9(008).
          02 FOOT01-COB-LGR PIC S9(9) BINARY.
          02 FOOT01-DD.
           05 FILX0000 PIC X(96).
           05 FILX0001 PIC X(96).
           05 FILX0002 PIC X(96).
          02 FOOT01-LGMAX-LTNV PIC S9(9) BINARY VALUE 34.
     