       01 FOOT11.
         02 FOOT11-COB.
          05 FOOT11-DAT-DMD.
             10 FOOT11-DAT-DMD9            pic  9(008).
          02 FOOT11-COB-LGR PIC S9(9) BINARY.
          02 FOOT11-DD.
           05 FILX0000 PIC X(96).
           05 FILX0001 PIC X(96).
           05 FILX0002 PIC X(96).
          02 FOOT11-LGMAX-LTNV PIC S9(9) BINARY VALUE 34.
     