       01 FOOT10.
         02 FOOT10-COB.
          05 FOOT10-DAT-DMD.
             10 FOOT10-DAT-DMD9            pic  9(008).
          02 FOOT10-COB-LGR PIC S9(9) BINARY.
          02 FOOT10-DD.
           05 FILX0000 PIC X(96).
           05 FILX0001 PIC X(96).
           05 FILX0002 PIC X(96).
          02 FOOT10-LGMAX-LTNV PIC S9(9) BINARY VALUE 34.
     