       IDENTIFICATION DIVISION.
       PROGRAM-ID. DepA.

       DATA DIVISION.
       Working-STORAGE SECTION.

      *Circular reference from MainType -> DepA -> DepB -> MainType
      *Will be used by a variable
       01 Type1 TYPEDEF STRICT PUBLIC.
            05 DepAvar1-1 pic X.
            05 DepAvar1-2 type DepB::Type1.

      *Circular reference from MainType -> DepA -> DepB -> MainType
      *Will be used by a procedure parameter
       01 Type2 TYPEDEF STRICT PUBLIC.
            05 DepAvar2-1 pic X.
            05 DepAvar2-2 type DepB::Type2.

      *Circular reference 
      *MainType -> DepA -> DepB -> MainType (unused types)
       01 UnusedType3 TYPEDEF STRICT PUBLIC.
            05 DepAvar3-1 pic X.
            05 DepAvar3-2 type DepB::UnusedType3.


      *Circular reference from MainType -> DepB -> DepA -> MainType
      *Will be used by a variable
       01 Type11 TYPEDEF STRICT PUBLIC.
            05 DepAvar11-1 pic X.
            05 DepAvar11-2 type MainPgm::MainType11.

      *Circular reference from MainType -> DepB -> DepA -> MainType
      *Will be used by a procedure parameter
       01 Type12 TYPEDEF STRICT PUBLIC.
            05 DepAvar12-1 pic X.
            05 DepAvar12-2 type MainPgm::MainType12.

      *Circular reference 
      *MainType -> DepB -> DepA -> MainType (unused types)
       01 UnusedType13 TYPEDEF STRICT PUBLIC.
            05 DepAvar13-1 pic X.
            05 DepAvar13-2 type MainPgm::UnusedMainType3.


       END PROGRAM DepA.

