       IDENTIFICATION DIVISION.
       PROGRAM-ID. DependOnPgm.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       special-names. decimal-point is comma.
       DATA DIVISION.
       working-storage section.

       01 MyType TYPEDEF STRICT.
            05 TypeCounter pic 999 comp-5.

       01 MyTypedVar TYPE MyType.

       01 MyGroup.
          05 MyCounter pic 999 comp-5.
      *Ok MyCounter is unique in the source
          05 MyTab     PIC X occurs 99 depending on MyCounter.



       01 MyGroup5.
          05 MyCounter5 pic 999 comp-5.
      *Ok use operator OF
          05 MyTab5     PIC X occurs 99 depending on MyCounter5 of 
          MyGroup5. 
      *Ok use operator IN
          05 MyTab51     PIC X occurs 99 depending on MyCounter5 IN 
          MyGroup5.
      *OK use operator ::
          05 MyTab52    PIC X occurs 99 depending on MyGroup::MyCounter.
      *OK use operator :: with typedef
          05 MyTab53    PIC X occurs 99 depending on 
          MyTypedVar::TypeCounter.

       01 CounterType TYPEDEF STRICT.
            05 Counter pic 999 comp-5.

       01 DuplicatedCounterType TYPEDEF STRICT.
            05 DuplicatedCounter pic 999 comp-5.

       01 DependType TYPEDEF STRICT.
            05 var1 TYPE MyType.
            05 VarCounter TYPE CounterType.
            05 ambigousCounter TYPE DuplicatedCounterType.
            05 ambigousCounter2 TYPE DuplicatedCounterType.
            05 TypeCounter2 pic 999 comp-5.
            05 MyGroup.
                10 GroupCounter pic 999 comp-5.

      *OK, typecounter is declared locally
            05 secondTable pic x(1) occurs 5
            depending on TypeCounter2.

      *OK, VarCounter is declared in this context
            05 typedTable PIC X(1) occurs 5 
            depending on VarCounter::Counter.

      *OK, Counter belongs to CounterType declared with VarCounter
            05 secondTypedTable PIC X(1) occurs 5 
            depending on Counter.

      *OK, TypeCounter is a variable under var1
            05 tableVar PIC X(1) occurs 5 
            depending on TypeCounter.

      *OK, TypeCounter is a variable under var1
            05 tableVar PIC X(1) occurs 5 
            depending on var1::TypeCounter.

      *KO, trying to use a variable declared outside typedef
            05 tableVar PIC X(1) occurs 5 
Line 73[39,49] <30, Error, Semantics> - Semantic error: Symbol MyTypedVar2.TypeCounter is not referenced
            depending on MyTypedVar2::TypeCounter.

      *KO, trying to use a variable declared outside typedef
            05 tableVar PIC X(1) occurs 5 
Line 77[43,49] <30, Error, Semantics> - Semantic error: Symbol DenpendingGroup.Counter is not referenced
            depending on DenpendingGroup::Counter.

      *KO, trying to use a variable declared outside typedef
            05 tableVar PIC X(1) occurs 5 
Line 81[55,61] <30, Error, Semantics> - Semantic error: Symbol DenpendingGroup.VarCounter.Counter is not referenced
            depending on DenpendingGroup::VarCounter::Counter.

      *KO, trying to use a variable declared outside typedef
            05 tableVar PIC X(1) occurs 5 
Line 85[43,53] <30, Error, Semantics> - Semantic error: Symbol DenpendingGroup.TypeCounter is not referenced
            depending on DenpendingGroup::TypeCounter.

      *KO, trying to use an ambigous local var
            05 tableVar PIC X(1) occurs 5 
Line 89[26,42] <30, Error, Semantics> - Semantic error: Ambiguous reference to symbol DuplicatedCounter 
Symbols found: DependOnPgm::DependType::ambigousCounter::DuplicatedCounterType::DuplicatedCounter | DependOnPgm::DependType::ambigousCounter2::DuplicatedCounterType::DuplicatedCounter
            depending on DuplicatedCounter.

      *OK, using local variable with qualifiedName
            05 tableVar PIC X(1) occurs 5 
            depending on MyGroup::GroupCounter.

      *OK, using local varialbe without qualifiedName
            05 tableVar PIC X(1) occurs 5 
            depending on GroupCounter.

       01 TypeCounter pic 666 comp-5.
       01 VarCounter TYPE CounterType.
       01 VarCounter TYPE CounterType.
       01 DenpendingGroup.
        05 VarCounter TYPE CounterType.
        05 MyTypedVar2 TYPE DependType.


       PROCEDURE DIVISION.
           move 1 to MyCounter
           .
       END PROGRAM DependOnPgm.
