       IDENTIFICATION DIVISION.
       PROGRAM-ID. LevelChecker.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 myPic TYPEDEF STRICT pic x.

       01 myType TYPEDEF STRICT.
            05 myVar PIC X(10).
            05 secondGroup.
                10 typedGroupvar TYPE secondType.

       01 secondType TYPEDEF STRICT.
            05 MyGroup.
                10 vargroup PIC X(10).

       01 MyGroup.

      *OK level of this variable is ok
       45 MyVar2 TYPE myType.
      *KO level of this varaible is to high
       48 MyVar1 TYPE myType.
      *OK type does not contains children
       77 MYVar3 TYPE myPic.
      *OK type does not contains children
       77 MYVar4 TYPE BOOL.
      *KO type contains children
       77 MYVar5 TYPE DATE.

       01 BooleanVar TYPE BOOL.
         88 WrongVarHere VALUE 99.

       01 len PIC 9(2).
       01 MyLevel1Test.
           05 buf.
           07 occurs 1
              depending on len.
              10 char    pic X.

       PROCEDURE DIVISION.

      *KO Level 88 under type bool in parameter
       DECLARE PROCEDURE MyProc
         INPUT exists TYPE BOOL
                88 exists-Ok value 'O'.
        END-DECLARE.

       END PROGRAM LevelChecker.