000010*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*- 00001000
000020*-Maintenance frame - Created on 01 Nov 2014 at 00:02:41          00001100
000030*-============================================================    00001201
001300 IDENTIFICATION division.                                         00061001
001310 PROGRAM-ID. TESTPGM1.                                            00062001
003680 environment division.                                            00299001
003690 configuration section.                                           00300001
003700*source-computer. IBM-3033 with debugging mode.                   00301001
003710 source-computer. IBM-3033.                                       00302001
003720 special-names. decimal-point is comma.                           00303001
004050 data division.                                                   00336001
004930******************************************************************00406001
004940*                                                                 00407001
004950 working-storage section.                                         00408001
005960 01  W-TAB-LCC-NONCLOSES.                                         00500001
005970     05 W-TAB-LCC-X OCCURS 52                                     00501001
005980                    indexed by W-TAB-LCC-IND.                     00502001
005990        10 W-TAB-LCC-CLE.                                         00503001
006000           15 W-TAB-LCC-CLE-RIB  pic X(21) type rib.              00504001
006010           15 W-TAB-LCC-CLE-DEV  pic X(03).                       00505001
006020           15 W-TAB-LCC-CLE-TYP  pic X(03).                       00506001
006030           15 W-TAB-LCC-CLE-ORD  pic X(02).                       00507001
006040           15 W-TAB-LCC-CLE-DAT  pic X(08) type date.             00508001
016420******************************************************************01465001
016450*            P R O C E D U R E     D I V I S I O N               *01468001
016480******************************************************************01471001
016490 procedure division using PCBIMS                                  01472001
016570                          PARM                                    01480001
016580                          .                                       01481001
016960*=================================================================01510001
016970* TRAITEMENT PRINCIPAL                                            01511001
016980*=================================================================01512001
016990 PRINCIPALE.                                                      01513001
017000                                                                  01514001
017010D    move W-TAB-LCC-CLE-RIB            to W-TAB-LCC-CLE-DAT       01515001
017020D    display '==============================================='    01516001
018550                                                                  01633001
018560     goback                                                       01634001
018570     .                                                            01635001
112130 end program TESTPGM1.                                            10517001
