       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZFSCT0.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
Line 5[32,37] <27, Error, Syntax> - Syntax error : GLOBAL clause cannot be specified with PUBLIC access modifier
       01 type1 typedef public global.
              05 champ1 pic x.
Line 7[33,38] <27, Error, Syntax> - Syntax error : GLOBAL clause cannot be specified with PRIVATE access modifier
       01 type2 typedef private global.
              05 champ1 pic x.
       PROCEDURE DIVISION.
      
           .
      
      *Nested ----------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
Line 18[32,37] <27, Error, Syntax> - Syntax error : GLOBAL clause cannot be specified with PUBLIC access modifier
       01 type3 typedef public global.
              05 champ1 pic x.
Line 20[33,38] <27, Error, Syntax> - Syntax error : GLOBAL clause cannot be specified with PRIVATE access modifier
       01 type4 typedef private global.
              05 champ1 pic x.
       PROCEDURE DIVISION.
      
          .
       END PROGRAM Nested.
      *End Nested ------------------------------------------------------
      
       END PROGRAM DVZFSCT0.
      
      *Stacked ---------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Stacked.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
Line 35[32,37] <27, Error, Syntax> - Syntax error : GLOBAL clause cannot be specified with PUBLIC access modifier
       01 type5 typedef public global.
              05 champ1 pic x.
Line 37[33,38] <27, Error, Syntax> - Syntax error : GLOBAL clause cannot be specified with PRIVATE access modifier
       01 type6 typedef private global.
              05 champ1 pic x.
       PROCEDURE DIVISION.
      
           .
       END PROGRAM Stacked.
      *End Stacked -----------------------------------------------------
