       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
       data division.
       working-storage section.
       01  UnusedTypeDef TYPEDEF STRICT.
             05 UnusedTypeDef-Var1       pic X(50).
             05 UnusedTypeDef-Var2       pic X(50).

       01  T-Disp TYPEDEF STRICT.
             05 LIG-DET                  pic X(50).
             05 LIG-NB                   pic X(50).
       01 DISP Type T-Disp.


      *Complex unused Typedef

       01 UnusedTypedef1 TYPEDEF STRICT.
           05 utd-var1         pic X.
           05 utd-var10.
              10 utd-var11     pic X.
              10 utd-var12     pic X.
              10 utd-var13     type UnusedTypedef2.
       01 UnusedTypedef2 TYPEDEF STRICT.
           05 utd-var2         pic X.
           05 utd-var20.
              10 utd-var21     pic X.
              10 utd-var22     pic X.
              10 utd-var23     type UnusedTypedef3.
       01 UnusedTypedef3 TYPEDEF STRICT.
           05 utd-var3         pic X.
           05 utd-var30.
              10 utd-var31     pic X.
              10 utd-var32     pic X.



      *Complex USED Typedef
       01 Typedef1 TYPEDEF STRICT global.
           05 td-var1         pic X.
           05 td-var10.
              10 td-var11     pic X.
              10 td-var12     pic X.
              10 td-var13     type Typedef2.
       01 Typedef2 TYPEDEF STRICT global.
           05 td-var2         pic X.
           05 td-var20.
              10 td-var21     pic X.
              10 td-var22     pic X.
              10 td-var23     type MainProgram::Typedef3.
       01 Typedef3 TYPEDEF STRICT global.
           05 td-var3         pic X.
           05 td-var30.
              10 td-var31     pic X.
              10 td-var32     pic X.
              10 td-var33     type SubPgm1::Typedef4.

       01 Var1 type Typedef1 global.
       01 Var2 pic X.

      
       procedure division.
      *KO type mismatch
           move Var2 to Var1

      *OK Var declared in a Typedef only used by one variable
           move LIG-DET  to LIG-NB

      *KO these 2 vars are only present in a TypeDef
      *no var use this Type
           move UnusedTypeDef-Var1 to UnusedTypeDef-Var2

      *KO these 2 vars are only present in a TypeDef
      *no var use this Type
           move utd-var32 to utd-var21
      *KO for same reason
           move utd-var32 of utd-var10 to utd-var21 of utd-var20




      *----------------Operator ::
      *OK full path till Type1
           move Var1::td-var1 to Var1::td-var10::td-var11
      *KO full path till Type1 but type mismatch
           move Var1::td-var10::td-var12 to Var1::td-var10::td-var13

      *OK full path till Type2
           move Var1::td-var10::td-var13::td-var20::td-var21
             to Var1::td-var10::td-var13::td-var20::td-var22
      *KO full path till Type2 but type mismatch
           move Var1::td-var10::td-var13::td-var20::td-var22
             to Var1::td-var10::td-var13::td-var20::td-var23
      
      *OK full path till Type3
           move Var1::td-var10::td-var13::td-var20::td-var23::
                td-var30::td-var31
             to Var1::td-var10::td-var13::td-var20::td-var23::
                td-var30::td-var32
      *KO full path till Type3 but type mismatch
           move Var1::td-var10::td-var13::td-var20::td-var23::
                td-var30::td-var32
             to Var1::td-var10::td-var13::td-var20::td-var23::
                td-var30::td-var33

      *OK full path till Type4
           move Var1::td-var10::td-var13::td-var20::td-var23::
                td-var30::td-var33::td-var4 
             to Var1::td-var10::td-var11



      *----------------Operator :: with "holes"
      *OK path with "holes" till Type1
           move Var1::td-var11 to td-var1
      *OK path with "holes" till Type1
           move Var1::td-var10 to td-var11

      *OK path with "holes" till Type2
           move td-var10::td-var11 to td-var10::td-var13::td-var20
      *Ok path with "holes" till Type2
           move td-var20::td-var21 to Var1::td-var20::td-var21
      *Ok path with "holes" till Type2
           move td-var21 to Var1::td-var10::td-var20::td-var21

      *Ok path with "holes" till Type3
           move Var1::td-var32 to Var1::td-var20::td-var23::td-var32





      *----------------Same with OF operator

      *OK full path till Type1
           move td-var1 of Var1 to td-var11 of td-var10 of Var1
      *KO full path till Type1 but type mismatch
           move td-var12 of td-var10 of Var1 
             to td-var13 of td-var10 of Var1

      *OK full path till Type2
           move td-var21 of td-var20 of td-var13 of td-var10 of Var1
             to td-var22 of td-var20 of td-var13 of td-var10 of Var1
      *KO full path till Type2 but type mismatch
           move td-var22 of td-var20 of td-var13 of td-var10 of Var1
             to td-var23 of td-var20 of td-var13 of td-var10 of Var1

      *OK full path till Type3
           move td-var31 of td-var30 of td-var23 of td-var20 
                of td-var13 of td-var10 of Var1
             to td-var32 of td-var30 of td-var23 of td-var20 
                of td-var13 of td-var10 of Var1
      *KO full path till Type3 but type mismatch
           move td-var32 of td-var30 of td-var23 of td-var20 
                of td-var13 of td-var10 of Var1
             to td-var33 of td-var30 of td-var23 of td-var20 
                of td-var13 of td-var10 of Var1


      *OK full path till Type4
           move td-var4 of td-var33 of td-var30 of td-var23 
                of td-var20 of td-var13 of td-var10 of Var1
             to td-var11 of td-var10 of Var1



      *---------------- OF operator with holes
      *OK path with "holes" till Type1
           move td-var11 of Var1 to td-var1
      *OK path with "holes" till Type1
           move td-var10 of Var1 to td-var11

      *OK path with "holes" till Type2
           move td-var11 of td-var10 
             to td-var20 of td-var13 of td-var10
      *Ok path with "holes" till Type2
           move td-var21  of td-var20 
             to td-var21 of td-var20 of Var1
      *Ok path with "holes" till Type2
           move td-var21 
             to td-var21 of td-var20 of td-var10 of Var1

      *Ok path with "holes" till Type3
           move td-var32 of Var1 
             to td-var32 of td-var23 of td-var20 of Var1


           .
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SubPgm1.
       data division.
       working-storage section.
       01 Typedef4 TYPEDEF STRICT PUBLIC.
           05 td-var4         pic X.
           05 td-var40.
              10 td-var41     pic X.
              10 td-var42     pic X.
       END PROGRAM SubPgm1.
       END PROGRAM MainProgram.