      *copy of copy 
           03 varA-1 pic X.
           03 varA-2.
              04 varB-21.
                 05 varB-1-1 pic X.
              04 varB-22.
                 COPY YCONVEA.
           03 varA-3.
              04 varA-3-1 pic X.