         05  PRTD20-D20-D20-OUT-D20 pic X.
         05  PRTD20-D20-D20-OUT-D20-2 pic X.
         05  PRTD20 pic X.
         05  PRTD20-D20.
                10 PRTD20-D20-SUB pic X.
         05  PRTD20-D20TEST pic X.
         05  PRTD20-TESTD20 pic X.
         05  PRTD20-TESTD20-TEST pic X.
         05  PRTD20-TESTD20TEST pic X.