       IDENTIFICATION DIVISION.
       PROGRAM-ID. GlobalStorageTest.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      
       SOURCE-COMPUTER. IBM-370
                      WITH DEBUGGING MODE
                      .
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       DATA DIVISION.
      
       GLOBAL-STORAGE SECTION.
      D01 dbgCblVar PIC X(22).
       01 G-Date            TYPE Date.
       01 G-TechCtx         TYPE Bool.
       01 DuplicatedVar     TYPE Bool.
       01 purCblVar PIC X(22).
      D01 dbgCblVar2 PIC X(22).
       01 purCblGrp.
      D   48 dbgCblVar PIC X(32).
          48 purCblVar PIC X(32).
      
       WORKING-STORAGE SECTION.
      * 01 MyType TYPEDEF STRICT PIC X.
      
       01 MyGroup PIC X(10).
           88 TestLevel VALUE "Test".
       PROCEDURE DIVISION.
       DECLARE PROCEDURE MyProc PRIVATE
           IN-OUT    myDate      TYPE DATE.
       Data division.
       WORKING-STORAGE Section.
       01 TestCtx TYPE Bool.
       PROCEDURE DIVISION.
      *G-Date and G-TechCtx are accesible from GlobalStorage
           MOVE G-Date TO myDate.
           MOVE G-TechCtx TO TestCtx.
       END-DECLARE.
      
           MOVE G-Date TO  G-Date.
      
           MOVE DuplicatedVar TO G-TechCtx.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TestCtx TYPE Bool.
       PROCEDURE DIVISION.
      *G-Date and G-TechCtx are accesible from GlobalStorage
           MOVE G-TechCtx TO TestCtx.
       END PROGRAM Nested.
       END PROGRAM GlobalStorageTest.