       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOZDR03.
       DATA DIVISION.

       GLOBAL-STORAGE SECTION.

       01 GlobalTab Type TypeA.

       WORKING-STORAGE SECTION.

       01 TypeA  TYPEDEF STRICT PRIVATE.
          05 Contenu.
             10 Ligne OCCURS 10
                      ASCENDING KEY IS Obj
                      INDEXED BY IdxA.
                15 Obj PIC X(12).

       PROCEDURE DIVISION.

       INIT-LIBRARY.
           CONTINUE.

       DECLARE PROCEDURE DisplayTable.
       DATA DIVISION.
       PROCEDURE DIVISION.
           PERFORM VARYING GlobalTab::IdxA FROM 1 BY 1
           UNTIL GlobalTab::IdxA > 5
             DISPLAY 'Test' GlobalTab::Obj(GlobalTab::IdxA)
           END-PERFORM
           .
       END-DECLARE.

       END PROGRAM TCOZDR03.