       IDENTIFICATION DIVISION.
       PROGRAM-ID. GlobalStorageTest.
      
       DATA DIVISION.
      
       GLOBAL-STORAGE SECTION.
       01 G-Date            TYPE Date.
       01 G-TechCtx         TYPE Bool.
       01 DuplicatedVar     TYPE Bool.
      
       WORKING-STORAGE SECTION.
      * 01 MyType TYPEDEF STRICT PIC X.
      
       01 MyGroup PIC X(10).
           88 TestLevel VALUE "Test".
      
       PROCEDURE DIVISION.
      
       DECLARE PROCEDURE MyProc PRIVATE
           INPUT    myDate      TYPE DATE.
       Data division.
       WORKING-STORAGE Section.
       01 TestCtx TYPE Bool.
       PROCEDURE DIVISION.
      *G-Date and G-TechCtx are accesible from GlobalStorage
           MOVE G-Date TO myDate.
           MOVE G-TechCtx TO TestCtx.
        END-DECLARE.
      
       MOVE G-Date TO G-Date.
       MOVE DuplicatedVar TO G-TechCtx.
      
       END PROGRAM GlobalStorageTest.