       01 MYCOPY::-group1.
          05 MYCOPY::-data1 PIC X.
          05 MYCOPY::-data2 PIC 9.
       01 group2-::MYCOPY.
          05 data1-::MYCOPY PIC X.
          05 data2-::MYCOPY PIC 9.