       05 :tag:-var1.
          10 :tag:-var1-item1 PIC X.
          10 :tag:-var1-item2 PICT X.
       05 :tag:-var2.
          10 :tag:-var2-item1 PICTUR X.
          10 :tag:-var2-item3 PIC X.