IF condition THEN
  ADD x TO y
ELSE
  SUBTRACT a FROM b
END-IF.

IF (A) CONTINUE.
IF (A = 1) CONTINUE.
IF (A = B) CONTINUE.
IF (A = 'B') CONTINUE.
IF (A = B OR C) CONTINUE.