MOVE FUNCTION RANDOM (x) TO x.
MOVE FUNCTION CURRENT-DATE TO x.
MOVE FUNCTION COS(x) TO x.
MOVE FUNCTION MAX ( x y z ) TO x.
MOVE FUNCTION WHEN-COMPILED TO x.
MOVE FUNCTION RANDOM TO x.
MOVE FUNCTION LENGTH (x) TO x.