000060 01  GROUP01.                                                      00060001
000070     02  GROUP01-START.                                            00070013
000900         04  GROUP01-ITEM1            PIC X(01) VALUE '
'.         00900005
000920         04  GROUP01-END              PIC 9(04) COMP VALUE 5.      00920005