       IDENTIFICATION DIVISION.
       PROGRAM-ID. BooleanTester.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 MyGroup.
        05 MySecondLevel.
            10 levelBool TYPE BOOL. 


       01 myBool TYPE BOOL.
       PROCEDURE DIVISION.
       MOVE myBool TO myBool. 
       MOVE MyGroup::levelBool TO myBool. 
       IF myBool = myBool
         continue
       END-IF.
       SET myBool TO TRUE.
       END PROGRAM BooleanTester.