       IDENTIFICATION DIVISION.
       PROGRAM-ID. BooleanTester.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       88 My88Level VALUE 99.

       01 MyGroup.
        05 MySecondLevel.
            10 levelBool TYPE BOOL.



       01 myBool TYPE BOOL.
       PROCEDURE DIVISION.
       MOVE My88Level TO My88Level.
       MOVE myBool TO myBool. 
       MOVE MyGroup::levelBool TO myBool. 
       IF myBool = myBool
         continue
       END-IF.
       SET myBool TO TRUE.
       SET myBool TO FALSE.

        EVALUATE TRUE
         WHEN myBool CONTINUE
        END-EVALUATE.

       END PROGRAM BooleanTester.