       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.

       DATA DIVISION.
       Working-STORAGE SECTION.

       01  mydate1     TYPE Date.

       PROCEDURE DIVISION.

       declare procedure check private
          input mydate        TYPE Date
         .
       data division.
       working-storage section.
       linkage section.
       PROCEDURE DIVISION.
           Call GetPersonById input mydate
           .
       END-DECLARE.

       declare procedure GetPersonById public
          input  personId  type date.
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       TRAITEMENT.
      *OK  call check of PGM1
          call check input mydate1
      
        .
  
       
       END PROGRAM PGM1.

