000100     05 TestVar pic X.                                            000100
000100     05 TestVar2 pic X.                                           000100