      *Declaratives and no paragraph under procedure division
      *Debug is active
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370 WITH DEBUGGING MODE.
       DATA DIVISION.
       Working-STORAGE SECTION.

       01  somedate     TYPE Date.

       PROCEDURE DIVISION.
      DDECLARATIVES.
      DREADY-TRACE SECTION.
      D    USE FOR DEBUGGING ON ALL PROCEDURES.
      D    DISPLAY 'AYIBTST1 ==> ' DEBUG-ITEM.
      DEND DECLARATIVES.

           PERFORM INIT-LIBRARY
           PERFORM TRAITEMENT
           .

       INIT-LIBRARY.
      *-------------
      D    DISPLAY '*** AYIBTST1 *** : INIT-LIBRARY'.

       TRAITEMENT.
           call Callee::check input somedate
           .
       declare procedure check private
          input mydate        TYPE Date
         .
       END-DECLARE.

      *Callee contains public procedure
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Callee.
       PROCEDURE DIVISION.
       
       declare procedure check public
          input mydate        TYPE Date
         .
       END-DECLARE.
       INIT-LIBRARY.
           exit
          .
       END PROGRAM Callee.

       END PROGRAM PGM1.

