       IDENTIFICATION DIVISION.
       PROGRAM-ID. EnclosingPgm.
       DATA DIVISION.
       PROCEDURE DIVISION.
         
         declare procedure Foo.
         procedure division.
           display "Hey"
               .
         end-declare.
              .
       
         IDENTIFICATION DIVISION.
         PROGRAM-ID. NestedPgm IS COMMON.
         DATA DIVISION.
         LINKAGE SECTION.
           01 x PIC X.
          PROCEDURE DIVISION.
           GOBACK.
         END PROGRAM NestedPgm.
         
       END PROGRAM EnclosingPgm.
         
       IDENTIFICATION DIVISION.
       PROGRAM-ID. StackedPgm.
       DATA DIVISION.
       LINKAGE SECTION.
         01 x PIC X.
        PROCEDURE DIVISION.
         GOBACK.
       END PROGRAM StackedPgm.
         
       IDENTIFICATION DIVISION.
       PROGRAM-ID. StackedPgrm.
       DATA DIVISION.
       LINKAGE SECTION.
         01 x PIC X.
        PROCEDURE DIVISION.
         GOBACK.