       IDENTIFICATION DIVISION.
       PROGRAM-ID. EnclosingPgm.
       PROCEDURE DIVISION.
         
         declare procedure Foo.
         procedure division.
           display "Hey"
               .
         end-declare.
              .
       
         IDENTIFICATION DIVISION.
         PROGRAM-ID. NestedPgm IS COMMON.
         DATA DIVISION.
         LINKAGE SECTION.
           01 x PIC X.
          PROCEDURE DIVISION.
           GOBACK.
         END PROGRAM NestedPgm.
             

       