       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       DATA DIVISION .
       local-STORAGE SECTION.
      
       01 Car.
           05 Driver.
               10 BirthDate type date.
      
       PROCEDURE DIVISION.
           move unsafe 19900101
                to Car::Driver::BirthDate
           .
       END PROGRAM DVZF0OSM.
