       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.

       DATA DIVISION.
       Working-STORAGE SECTION.

       01  somedate     TYPE Date.
       01  someformat   PIC X(08).
       01  flag         TYPE Bool.
       01  realformat   PIC X(08).

       01 person1Id  pic 9(10).
       01 MyPerson   type PersonService::Person.

       PROCEDURE DIVISION.

       declare procedure check private
          input mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
           INPUT mydate        TYPE Date
                 format        PIC X(08)
                 alength       PIC 9(8) comp-5
                 anotherlength PIC S9(05) comp-5
          OUTPUT okay          TYPE Bool
                 actual-format PIC X(08).
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       TRAITEMENT.
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
           CALL Callee::MyPublicProcedure
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat 
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
           CALL CALLEE::MyPublicProcedure
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat 
         
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
           CALL Pgm1PrivateValidateDateFormat
                    INPUT      somedate
                               someformat
                               length of somedate
                               length of somedate::YYYY
                    OUTPUT     flag     realformat
      *
           call PersonService::GetPersonById input  person1Id
                                             output MyPerson
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
           CALL PGM1::Pgm1PrivateValidateDateFormat
                    INPUT      somedate
                               someformat
                               length of someformat
                               length of MyPerson
                    OUTPUT     flag     realformat


      *OK  call check of PGM1
           call check input somedate
      *OK 
           call PGM1::check input somedate
      *OK 
           call Callee::check input somedate
           .


      *Callee contains public procedure
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Callee.

       DATA DIVISION.
       working-storage section.

       01  somedate     TYPE Date.
       01  someformat   PIC X(08).
       01  flag         TYPE Bool.
       01  realformat   PIC X(08).

       PROCEDURE DIVISION.
       
       declare procedure check public
          input mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       declare procedure check2 public
          input mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       declare procedure check2 public
          input mydate        TYPE Date
                myDate2       type date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       DECLARE PROCEDURE MyPublicProcedure PUBLIC
           INPUT mydate        TYPE Date
                 format        PIC X(08)
          OUTPUT okay          TYPE Bool
                 actual-format PIC X(08).
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM Callee.

      *PersonService contains public procedure
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PersonService.

       DATA DIVISION.
       working-storage section.
       01 Person TYPEDEF STRICT PUBLIC.
           05 PersonId   pic 9(10).
           05 LastName   pic X(30).
             88 Empty value space.
           05 FirstName  pic X(30).
       PROCEDURE DIVISION.
       
       declare procedure GetPersonById public
          input  person1Id  pic 9(10)
          output person    type Person
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM PersonService.


       END PROGRAM PGM1.

