       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       DATA DIVISION .
       working-storage section.
       01  IsOk type bool.
       01 Var1 pic X.
           88 var88 value 'A' false 'B'.
      
       procedure division.
           set IsOk to true
           set IsOk to false
           set var88 to false
           .
      
       DECLARE PROCEDURE IsDateValid.
       DATA DIVISION .
       working-storage section.
       01  Result type bool.
       PROCEDURE DIVISION.
      *-----------------------------------------------------------------
               SET Result  TO true
               SET Result  TO false
           .
       END-DECLARE.
      
           .
       END PROGRAM DVZF0OSM.
