       IDENTIFICATION DIVISION.
       PROGRAM-ID. SetUnsafe.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 W-myDate TYPE DATE.
       01 W-myDate2 TYPE DATE.
       01 W-PicVar PIC X(10).

       01 myPointer POINTER.

       LINKAGE SECTION.
       01 L-PICVar PIC X(10).
       01 L-Date TYPE DATE.


       PROCEDURE DIVISION.


           SET  ADDRESS OF L-PICVar TO myPointer.
           SET  MyPointer TO ADDRESS OF W-PicVar.
           SET  UNSAFE ADDRESS OF L-Date TO MyPointer.
           SET  W-myDate TO ADDRESS OF L-Date.

           .

       END PROGRAM SetUnsafe.