       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OS3.
       data DIVISION.
       working-storage section.
      
       01 EventList TYPEDEF STRICT PRIVATE.
          05 Counter pic 9(04) comp-5.
          05 EventArray.
             10 Event pic X occurs 10
                             depending on Counter.
      
       01 CallingStack typedef strict private.
         05 cnt  pic S9(5) comp-5.
         05 moduleList.
          10 occurs 40
           depending on cnt.
           15 module pic X(8).

       01 callingStack type CallingStack.

       procedure division.
      
       DECLARE PROCEDURE DisplayEventList PRIVATE
            INPUT EventList type EventList.
       PROCEDURE DIVISION.
           GOBACK.
       end-declare
           .
       END PROGRAM DVZF0OS3.
