       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OS3.
       data DIVISION.
       working-storage section.
      
       01 EventList TYPEDEF STRICT.
          05 Counter pic 9(04) comp-5.
          05 EventArray.
             10 Event pic X occurs 10
                             depending on Counter.
      
       procedure division.
      
       DECLARE PROCEDURE DisplayEventList PRIVATE
            INPUT EventList type EventList.
       PROCEDURE DIVISION.
           GOBACK.
       end-declare
           .
       END PROGRAM DVZF0OS3.
