       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OS3.
      
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      
      
       01 myType TYPEDEF STRICT.
            05 myVar PIC 9(10).
            05 secondGroup.
                10 varGroup pic 9(10).
                10 typedGroupvar TYPE secondType.
                10 ThirdGroup.
                   15 varGroup pic 9(10).
      
                10 tutu occurs 1 depending on MyGroup::vargroup.
                10 titi occurs 1 depending on ThirdGroup::vargroup.
                10 toto occurs 1 depending on myVar.
      
       01 secondType TYPEDEF STRICT.
            05 MyGroup.
                10 vargroup PIC 9(10).
      
       01 Vars.
           02 Vars3.
           05 MyVar1 TYPE myType.
       01 Vars2.
           05 MyVar1 TYPE myType.
       01 MyVar2 TYPE myType.
      
       PROCEDURE DIVISION.
           .
       END PROGRAM DVZF0OS3.
