       IDENTIFICATION DIVISION.
       PROGRAM-ID. TYPDEFQU.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 MyType TYPEDEF STRICT.
         05 Count2 pic 9(05) comp-5.
         05 MyGroup.
            10 GCount pic 9(05) comp-5.
            10 MyGTbl PIC X(1) occurs 99 
               depending on GCount.
         05 TABLE-ITEM PIC X(8)
                OCCURS 10 INDEXED BY INX-A.
     
       01 var1 type MyType.
       01 var2 type MyType.

       procedure division.
           SET var1::INX-A TO 10.
           SET var2::INX-A TO 20.
       END PROGRAM TYPDEFQU.
