       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
      
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      
      %<<<
       Formalized
       comment
      %>>>
       01 Type1 TYPEDEF STRICT.
          05 item-1 PIC X
      *Single-line comment
           VALUE 'A'.
          05 item-2 PIC X. *> Floating comment
      
       01 Type2 TYPEDEF STRICT.
          05 item-1 PIC X
      %<<
       Multiline
       comment
      %>>
           VALUE 'B'.
      
       01 var1 Type Type1.
       01 var2 Type Type2.
      
       PROCEDURE DIVISION.
           .
       END PROGRAM PGM1.