       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       DATA DIVISION.
       working-storage section.
      
      
       01 MyType TYPEDEF STRICT.
           05 MyTab occurs 99 indexed by MyIdx.
               10 myVar PIC X.
      
       01 Var1.
          05 Var2 type MyType.
      
       procedure division.
           set Var1::MyIdx       to 1
           set Var1::myidx       up by 1
      
           goback
           .
       END PROGRAM DVZF0OSM.