       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OS3.
       data DIVISION.
       working-storage section.
      
       01 Event TYPEDEF STRICT PRIVATE.
          05 IDT pic X(05).
          05 Periodicity pic 9(03).
      
       01 EventList TYPEDEF STRICT PRIVATE.
          05 Counter pic 9(04) comp-5.
          05 EventArray.
             10 Event TYPE Event occurs 10
                             depending on Counter
                             indexed by Idx.

       01 MyGroupVar.
        05 LigCln-Taxes  OCCURS 10
        INDEXED BY  Idx-nonQualified.

       01 MyEventList type EventList.
      
       procedure division.


           PERFORM VARYING Idx-nonQualified FROM 1 BY 1
           UNTIL Idx-nonQualified > MyEventList::Idx
             display "test"
           END-PERFORM.
      
       DECLARE PROCEDURE DisplayEventList PRIVATE
            IN-OUT EventList type EventList.
       data division.
       working-storage section.
       01 EventList2 type EventList.
       PROCEDURE DIVISION.
           PERFORM VARYING EventList::Idx FROM 1 BY 1
           UNTIL EventList::Idx > EventList2::Idx
             display "test"
           END-PERFORM
           GOBACK.
       end-declare
           .
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Imbrique.
       data DIVISION.
       working-storage section.
      
       01 EventList  type EventList.
       01 EventList2 type EventList.
      
       procedure division.
           PERFORM VARYING EventList::Idx FROM 1 BY 1
           UNTIL EventList::Idx > EventList2::Idx
             display "test"
           END-PERFORM
           GOBACK.
           .
       END PROGRAM Imbrique.
       END PROGRAM DVZF0OS3.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OS3bis.
       data DIVISION.
       working-storage section.
      
       01 Event TYPEDEF STRICT PRIVATE.
          05 IDT pic X(05).
          05 Periodicity pic 9(03).
      
       01 EventList TYPEDEF STRICT PRIVATE.
          05 Counter pic 9(04) comp-5.
          05 EventArray.
             10 Event TYPE Event occurs 10
                             depending on Counter
                             indexed by Idx.
      
       01 MyEventList type EventList.
      
       procedure division.
      
       DECLARE PROCEDURE DisplayEventList PRIVATE
            IN-OUT EventList type EventList.
       data division.
       working-storage section.
       01 EventList2 type EventList.
       PROCEDURE DIVISION.
           PERFORM VARYING EventList::Idx FROM 1 BY 1
           UNTIL EventList::Idx > EventList2::Idx
             display "test"
           END-PERFORM
           GOBACK.
       end-declare
           .
       END PROGRAM DVZF0OS3bis.