       IDENTIFICATION DIVISION.
       PROGRAM-ID. VARTYPEXT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  var1     Type Date external.

       END PROGRAM VARTYPEXT.
