ID Division. 
Program-ID. TypeGlobal.          
Data Division.                 
Working-Storage Section.    
01 WS-NewType type NewType global
procedure division.
move WS-NewType to WS-NewType

.
End Program SEC2. 