       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.

       DATA DIVISION.
       Working-STORAGE SECTION.

       01  somedate     TYPE Date.
       01  someformat   PIC X(08).
       01  flag         TYPE Bool.
       01  realformat   PIC X(08).
       01  W-TechCtx    TYPE CALLEE::TechnicalContext.

       PROCEDURE DIVISION.


       MOVE W-TechCtx::Site::SiteName TO someformat.

       declare procedure check private
          input mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
           INPUT mydate        TYPE Date
                 format        PIC X(08)
          OUTPUT okay          TYPE Bool
                 actual-format PIC X(08).
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       TRAITEMENT.
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
           CALL Callee::MyPublicProcedure
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat 
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
           CALL CALLEE::MyPublicProcedure
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat 
         
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
           CALL Pgm1PrivateValidateDateFormat
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
           CALL PGM1::Pgm1PrivateValidateDateFormat
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat


      *OK  call check of PGM1
          call check input somedate
      *OK 
          call PGM1::check input somedate
      *OK 
          call Callee::check input somedate
        .
       END PROGRAM PGM1.

