       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOMFL06.
       PROCEDURE DIVISION.
       main.
           perform a
           goback
           .
       a.
           perform b
           .
       b.
           perform c
           .
       c.
           perform a
           .
       END PROGRAM TCOMFL06.