       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPROG.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       LINKAGE SECTION.
       01 IPC1 PIC 9(02).
       01 IPC2 PIC 9(02).
       01 IPC PIC 9(03).
       PROCEDURE DIVISION USING IPC1, IPC2, IPC.
           COMPUTE IPC = IPC1 * IPC2.
           GOBACK.
           COMPUTE IPC = IPC1 * IPC2.
       END PROGRAM SUBPROG.
      