       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZMFT1.
       DATA DIVISION.
       PROCEDURE DIVISION.
       main.
           PERFORM a
           GOBACK
           .
       a.
           PERFORM b
           PERFORM e
           .
       b.
           PERFORM c
           .
       c.
           PERFORM d
           .
       d.
           PERFORM g
           .
       e.
           PERFORM f
           .
       f.
           PERFORM g
           .
       g.
           DISPLAY "end"
           .
       END PROGRAM DVZZMFT1.