       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZMFT3.
       PROCEDURE DIVISION.
           PERFORM S2
           PERFORM S1 THRU C
           GOBACK.
       S1 SECTION.
       A.
           display 'A'
           .
       B.
           display 'B'
           .
       S2 SECTION.
       C.
           display 'C'
           .
       D.
           display 'D'
           .
       END PROGRAM DVZZMFT3.