       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORMNEST.
       AUTHOR. MAYANJE
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  CLAZZ.
           02 STUDENT OCCURS 2 TIMES INDEXED BY I.
              05  SUBJECT PIC 9(3) OCCURS 6 TIMES INDEXED BY M.
       PROCEDURE DIVISION.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
             PERFORM VARYING M FROM 1 BY 1 UNTIL M > 5
                DISPLAY I
                DISPLAY M
             END-PERFORM
           END-PERFORM.
       END PROGRAM PERFORMNEST.
