       IDENTIFICATION DIVISION.                                         
      *$$IDENTIFICATION                                                 
       PROGRAM-ID.    CGMV01.                                           
       AUTHOR.        ANALYST:     FRANTZ JOLO (IBSI).                  
                      PROGRAMMER:                                       
       DATE-WRITTEN.  08/25/15.                                         
       DATE-COMPILED.                                                   
                                                                        
      ***************************************************************** 
      * SOURCE GENERE PAR INSTALL/1                                   * 
      * MODEL UTILISE = CTM050                                        * 
      * VERSION = LINUX                                               * 
      *                                                               * 
      * MODULE COMMUN                                                 * 
      * IDEM CTM010 AVEC PASSAGE D'UNE ZONE SUPPLEMENTAIRE            * 
      *                                                               * 
      ***************************************************************** 
      *                                                               * 
      *  NAME       : &PRGRMID.                                       * 
      *  NAME       : CGMV01                                          * 
      *                                                               * 
      ***************************************************************** 
                                                                        
       ENVIRONMENT DIVISION.                                            
       CONFIGURATION SECTION.                                           
         SPECIAL-NAMES.                                                 
           SYMBOLIC CHARACTERS APOSTR IS 126.                           
                                                                        
       DATA DIVISION.                                                   
       working-storage section.
       01 DFHCOMMAREA.
       02  LS-PILOTE-OPERAT.
           05 CGLBAL0W.
              10 LS-AL0H-ALLS.
                12 LS-AL0H-ALL.
                   14 LS-AL0H-DEBBAN     PIC S9(5) COMP-3.
                   14 LS-AL0H-FINBAN     PIC S9(5) COMP-3.
      *
                   14 LS-AL0H-INDS OCCURS 02 INDEXED BY IX-AL0H-IND.
                      16 LS-AL0H-IND     PIC S9(1) COMP-3.
      *************** 16 LS-AL0H-IND     PIC 9.
      *
                   14 LS-AL0H-GDDS OCCURS 02 INDEXED BY IX-AL0H-GDD.
                      16 LS-AL0H-GDD      PIC X(3).
                      16 LS-AL0H-PR0      PIC S9(5) COMP-3.
                      16 LS-AL0H-PR5      PIC S9(5) COMP-3.
                      16 LS-AL0H-PR9      PIC S9(5) COMP-3.
      *
                   14 LS-AL0H-EXP-GDD8   PIC X(3).
      *
                   14 LS-AL0H-EXP-GDD9   PIC X(3).
                   14 LS-AL0H-EXP-H9X.
                      16 LS-AL0H-EXP-H9  PIC S9(9) COMP-3.
      *
      *   VARIABLES DE TRAVAIL POUR AL0
      *
              10 IX-AL0H-IND-MAX      PIC S9(3) COMP-3.
              10 IX-AL0H-GDD-MAX      PIC S9(3) COMP-3 VALUE 2.
      *                               GDD 3 + DATDEB 5 + DATFIN 5 + 1
              10 LS-AL0H-CLE             PIC S9(3) COMP-3 VALUE 014.
              10 LS-AL0H-OCC             PIC 999.
      *
      *   VARIABLES DE TRAVAIL (CGM?01-CGRAL0AK)
      *
      *    PARTICULARITé
              10 LS-AL0H-ZNOCCD-MAX      PIC 99 VALUE 48.
      *---------------------------------------------------------
              10 LS-AL0S-ALLS.
                12 LS-AL0S-ALL.
                   14 LS-AL0S-DEBBAN     PIC S9(5) COMP-3.
                   14 LS-AL0S-FINBAN     PIC S9(5) COMP-3.
      *
                   14 LS-AL0S-INDS OCCURS 2 INDEXED BY IX-AL0S-IND.
                      16 LS-AL0S-IND     PIC 9.
      *
                   14 LS-AL0S-GDDS OCCURS 2 INDEXED BY IX-AL0S-GDD.
                      16 LS-AL0S-GDD      PIC X(3).
                      16 LS-AL0S-PR0      PIC S9(5) COMP-3.
                      16 LS-AL0S-PR5      PIC S9(5) COMP-3.
                      16 LS-AL0S-PR9      PIC S9(5) COMP-3.
      *
                   14 LS-AL0S-EXP-GDD8   PIC X(3).
      *
                   14 LS-AL0S-EXP-GDD9   PIC X(3).
                   14 LS-AL0S-EXP-H9X.
                      16 LS-AL0S-EXP-H9  PIC S9(9) COMP-3.
      *
      *   VARIABLES DE TRAVAIL POUR DOM
      *
      *       10 IX-AL0S-IND-MAX-REF  PIC S9(3) COMP-3 VALUE 2.
      *       10 IX-AL0S-IND-MAX      PIC S9(3) COMP-3 VALUE 2.
              10 IX-AL0S-GDD-MAX      PIC S9(3) COMP-3 VALUE 2.
      *
      *       10 LS-XXXH-AL0S            PIC X(3) VALUE 'AL0'.
      
      ******************************************************************
          05 TH0-1-2-3.
      *------------------------
            10 TH0.
              15 TH0-TABS.
                20 TH0-TAB-FOH PIC X(3) VALUE 'FOH'.
                20 TH0-TAB-FOS PIC X(3) VALUE 'FOS'.
                20 TH0-TAB-AL0 PIC X(3) VALUE 'AL0'.
                20 TH0-TAB-DMH PIC X(3) VALUE 'DMH'.
                20 TH0-TAB-DOM PIC X(3) VALUE 'DOM'.
                20 TH0-TAB-DOH PIC X(3) VALUE 'DOH'.
                20 TH0-TAB-ODE PIC X(3) VALUE 'ODE'.
                20 TH0-TAB-LGH PIC X(3) VALUE 'LGH'.
                20 TH0-TAB-LGS PIC X(3) VALUE 'LGS'.
                20 TH0-TAB-MAH PIC X(3) VALUE 'MAH'.
                20 TH0-TAB-MAS PIC X(3) VALUE 'MAS'.
                20 TH0-TAB-POM PIC X(3) VALUE 'POM'.
                20 TH0-TAB-PEH PIC X(3) VALUE 'PEH'.
                20 TH0-TAB-PEX PIC X(3) VALUE 'PEX'.
                20 TH0-TAB-PLH PIC X(3) VALUE 'PLH'.
                20 TH0-TAB-PER PIC X(3) VALUE 'PER'.
                20 TH0-TAB-DO2 PIC X(3) VALUE 'DO2'.
                20 TH0-TAB-SP1 PIC X(3) VALUE 'SP1'.
                20 TH0-TAB-ZZZ PIC X(3) VALUE 'ZZZ'.
              15 TH0-TABR REDEFINES TH0-TABS.
                20 TH0-TAB PIC X(3) OCCURS 00019
                               INDEXED BY IX-TH0 IX-TH0-2 IX-TH0-3.
              15 IX-TH0-M PIC S9(5) COMP-3 VALUE 00019.
      *------------------------
            10 TH1.
              15 TH1-ORIS.
                20 TH1-ORI-FOH PIC S9(5) COMP-3 VALUE 00001.
                20 TH1-ORI-FOS PIC S9(5) COMP-3 VALUE 00004.
                20 TH1-ORI-AL0 PIC S9(5) COMP-3 VALUE 00006.
                20 TH1-ORI-DMH PIC S9(5) COMP-3 VALUE 00009.
                20 TH1-ORI-DOM PIC S9(5) COMP-3 VALUE 00031.
                20 TH1-ORI-DOH PIC S9(5) COMP-3 VALUE 00035.
                20 TH1-ORI-ODE PIC S9(5) COMP-3 VALUE 00070.
                20 TH1-ORI-LGH PIC S9(5) COMP-3 VALUE 00072.
                20 TH1-ORI-LGS PIC S9(5) COMP-3 VALUE 00090.
                20 TH1-ORI-MAH PIC S9(5) COMP-3 VALUE 00092.
                20 TH1-ORI-MAS PIC S9(5) COMP-3 VALUE 00095.
                20 TH1-ORI-POM PIC S9(5) COMP-3 VALUE 00097.
                20 TH1-ORI-PEH PIC S9(5) COMP-3 VALUE 00101.
                20 TH1-ORI-PEX PIC S9(5) COMP-3 VALUE 00170.
                20 TH1-ORI-PLH PIC S9(5) COMP-3 VALUE 00173.
                20 TH1-ORI-PER PIC S9(5) COMP-3 VALUE 00180.
                20 TH1-ORI-DO2 PIC S9(5) COMP-3 VALUE 00186.
                20 TH1-ORI-SP1 PIC S9(5) COMP-3 VALUE 00189.
                20 TH1-ORI-ZZZ PIC S9(5) COMP-3 VALUE 00192.
              15 TH1-ORIR REDEFINES TH1-ORIS.
                20 TH1-ORI PIC S9(5) COMP-3 OCCURS 00019
                               INDEXED BY IX-TH1 IX-TH1-2 IX-TH1-3.
              15 IX-TH1-M PIC S9(5) COMP-3 VALUE 00019.
      *------------------------
            10 TH2.
              15 TH2-GDDS.
      **-------------------------00001 - CDAIFH
                20 TH2-FOHAIF PIC X(3) VALUE 'AIF'.
                20 TH2-FOH000 PIC X(3) VALUE '000'.
                20 TH2-FOH999 PIC X(3) VALUE '999'.
      **-------------------------00004 - CDAIFS
                20 TH2-FOSZZZ PIC X(3) VALUE 'ZZZ'.
                20 TH2-FOS000 PIC X(3) VALUE '000'.
      **-------------------------00006 - CDALLH
                20 TH2-AL0ALC PIC X(3) VALUE 'ALC'.
                20 TH2-AL0000 PIC X(3) VALUE '000'.
                20 TH2-AL0999 PIC X(3) VALUE '999'.
      **-------------------------00009 - CDDEMH
                20 TH2-DMHAAH PIC X(3) VALUE 'AAH'.
                20 TH2-DMHAFH PIC X(3) VALUE 'AFH'.
                20 TH2-DMHCMG PIC X(3) VALUE 'CMG'.
                20 TH2-DMHCMS PIC X(3) VALUE 'CMS'.
                20 TH2-DMHCRH PIC X(3) VALUE 'CRH'.
                20 TH2-DMHCSF PIC X(3) VALUE 'CSF'.
                20 TH2-DMHDEC PIC X(3) VALUE 'DEC'.
                20 TH2-DMHDES PIC X(3) VALUE 'DES'.
                20 TH2-DMHDFA PIC X(3) VALUE 'DFA'.
                20 TH2-DMHDGT PIC X(3) VALUE 'DGT'.
                20 TH2-DMHDPE PIC X(3) VALUE 'DPE'.
                20 TH2-DMHDPI PIC X(3) VALUE 'DPI'.
                20 TH2-DMHDRM PIC X(3) VALUE 'DRM'.
                20 TH2-DMHDSF PIC X(3) VALUE 'DSF'.
                20 TH2-DMHDVS PIC X(3) VALUE 'DVS'.
                20 TH2-DMHMID PIC X(3) VALUE 'MID'.
                20 TH2-DMHPJA PIC X(3) VALUE 'PJA'.
                20 TH2-DMHPPA PIC X(3) VALUE 'PPA'.
                20 TH2-DMHRSA PIC X(3) VALUE 'RSA'.
                20 TH2-DMHRSO PIC X(3) VALUE 'RSO'.
                20 TH2-DMH000 PIC X(3) VALUE '000'.
                20 TH2-DMH999 PIC X(3) VALUE '999'.
      **-------------------------00031 - CDDODH
                20 TH2-DOMSER PIC X(3) VALUE 'SER'.
                20 TH2-DOMSPL PIC X(3) VALUE 'SPL'.
                20 TH2-DOM000 PIC X(3) VALUE '000'.
                20 TH2-DOM999 PIC X(3) VALUE '999'.
      **-------------------------00035 - CDDOIH
                20 TH2-DOHAIA PIC X(3) VALUE 'AIA'.
                20 TH2-DOHAMI PIC X(3) VALUE 'AMI'.
                20 TH2-DOHAOH PIC X(3) VALUE 'AOH'.
                20 TH2-DOHAOR PIC X(3) VALUE 'AOR'.
                20 TH2-DOHAPR PIC X(3) VALUE 'APR'.
                20 TH2-DOHASX PIC X(3) VALUE 'ASX'.
                20 TH2-DOHBEF PIC X(3) VALUE 'BEF'.
                20 TH2-DOHCCA PIC X(3) VALUE 'CCA'.
                20 TH2-DOHCLG PIC X(3) VALUE 'CLG'.
                20 TH2-DOHCPI PIC X(3) VALUE 'CPI'.
                20 TH2-DOHCRE PIC X(3) VALUE 'CRE'.
                20 TH2-DOHCRM PIC X(3) VALUE 'CRM'.
                20 TH2-DOHDAR PIC X(3) VALUE 'DAR'.
                20 TH2-DOHEEO PIC X(3) VALUE 'EEO'.
                20 TH2-DOHLIM PIC X(3) VALUE 'LIM'.
                20 TH2-DOHMCF PIC X(3) VALUE 'MCF'.
                20 TH2-DOHMGC PIC X(3) VALUE 'MGC'.
                20 TH2-DOHMGJ PIC X(3) VALUE 'MGJ'.
                20 TH2-DOHMGP PIC X(3) VALUE 'MGP'.
                20 TH2-DOHMSD PIC X(3) VALUE 'MSD'.
                20 TH2-DOHNEC PIC X(3) VALUE 'NEC'.
                20 TH2-DOHOLG PIC X(3) VALUE 'OLG'.
                20 TH2-DOHPLP PIC X(3) VALUE 'PLP'.
                20 TH2-DOHQFA PIC X(3) VALUE 'QFA'.
                20 TH2-DOHQFR PIC X(3) VALUE 'QFR'.
                20 TH2-DOHQFV PIC X(3) VALUE 'QFV'.
                20 TH2-DOHQUI PIC X(3) VALUE 'QUI'.
                20 TH2-DOHRNG PIC X(3) VALUE 'RNG'.
                20 TH2-DOHRSF PIC X(3) VALUE 'RSF'.
                20 TH2-DOHSDO PIC X(3) VALUE 'SDO'.
                20 TH2-DOHSUR PIC X(3) VALUE 'SUR'.
                20 TH2-DOHTIE PIC X(3) VALUE 'TIE'.
                20 TH2-DOHTIT PIC X(3) VALUE 'TIT'.
                20 TH2-DOH000 PIC X(3) VALUE '000'.
                20 TH2-DOH999 PIC X(3) VALUE '999'.
      **-------------------------00070 - CDDRES
                20 TH2-ODEZZZ PIC X(3) VALUE 'ZZZ'.
                20 TH2-ODE000 PIC X(3) VALUE '000'.
      **-------------------------00072 - CDLOGH
                20 TH2-LGHBAI PIC X(3) VALUE 'BAI'.
                20 TH2-LGHCAI PIC X(3) VALUE 'CAI'.
                20 TH2-LGHCAL PIC X(3) VALUE 'CAL'.
                20 TH2-LGHCHL PIC X(3) VALUE 'CHL'.
                20 TH2-LGHCML PIC X(3) VALUE 'CML'.
                20 TH2-LGHCNA PIC X(3) VALUE 'CNA'.
                20 TH2-LGHCOL PIC X(3) VALUE 'COL'.
                20 TH2-LGHDEC PIC X(3) VALUE 'DEC'.
                20 TH2-LGHDPL PIC X(3) VALUE 'DPL'.
                20 TH2-LGHETU PIC X(3) VALUE 'ETU'.
                20 TH2-LGHLAI PIC X(3) VALUE 'LAI'.
                20 TH2-LGHMPL PIC X(3) VALUE 'MPL'.
                20 TH2-LGHNRL PIC X(3) VALUE 'NRL'.
                20 TH2-LGHPPL PIC X(3) VALUE 'PPL'.
                20 TH2-LGHSAL PIC X(3) VALUE 'SAL'.
                20 TH2-LGHSIN PIC X(3) VALUE 'SIN'.
                20 TH2-LGH000 PIC X(3) VALUE '000'.
                20 TH2-LGH999 PIC X(3) VALUE '999'.
      **-------------------------00090 - CDLOGS
                20 TH2-LGSZZZ PIC X(3) VALUE 'ZZZ'.
                20 TH2-LGS000 PIC X(3) VALUE '000'.
      **-------------------------00092 - CDMAPH
                20 TH2-MAHAPL PIC X(3) VALUE 'APL'.
                20 TH2-MAH000 PIC X(3) VALUE '000'.
                20 TH2-MAH999 PIC X(3) VALUE '999'.
      **-------------------------00095 - CDMAPS
                20 TH2-MASZZZ PIC X(3) VALUE 'ZZZ'.
                20 TH2-MAS000 PIC X(3) VALUE '000'.
      **-------------------------00097 - CDPEDH
                20 TH2-POMJUR PIC X(3) VALUE 'JUR'.
                20 TH2-POMJUT PIC X(3) VALUE 'JUT'.
                20 TH2-POM000 PIC X(3) VALUE '000'.
                20 TH2-POM999 PIC X(3) VALUE '999'.
      **-------------------------00101 - CDPEIH
                20 TH2-PEHAAH PIC X(3) VALUE 'AAH'.
                20 TH2-PEHABM PIC X(3) VALUE 'ABM'.
                20 TH2-PEHABP PIC X(3) VALUE 'ABP'.
                20 TH2-PEHABS PIC X(3) VALUE 'ABS'.
                20 TH2-PEHACC PIC X(3) VALUE 'ACC'.
                20 TH2-PEHACE PIC X(3) VALUE 'ACE'.
                20 TH2-PEHACH PIC X(3) VALUE 'ACH'.
                20 TH2-PEHAES PIC X(3) VALUE 'AES'.
                20 TH2-PEHAFE PIC X(3) VALUE 'AFE'.
                20 TH2-PEHAGE PIC X(3) VALUE 'AGE'.
                20 TH2-PEHAPC PIC X(3) VALUE 'APC'.
                20 TH2-PEHAPH PIC X(3) VALUE 'APH'.
                20 TH2-PEHARS PIC X(3) VALUE 'ARS'.
                20 TH2-PEHAVM PIC X(3) VALUE 'AVM'.
                20 TH2-PEHBEP PIC X(3) VALUE 'BEP'.
                20 TH2-PEHCAP PIC X(3) VALUE 'CAP'.
                20 TH2-PEHCIB PIC X(3) VALUE 'CIB'.
                20 TH2-PEHCOT PIC X(3) VALUE 'COT'.
                20 TH2-PEHCOV PIC X(3) VALUE 'COV'.
                20 TH2-PEHCRA PIC X(3) VALUE 'CRA'.
                20 TH2-PEHCRE PIC X(3) VALUE 'CRE'.
                20 TH2-PEHCRM PIC X(3) VALUE 'CRM'.
                20 TH2-PEHCTS PIC X(3) VALUE 'CTS'.
                20 TH2-PEHDAE PIC X(3) VALUE 'DAE'.
                20 TH2-PEHDAP PIC X(3) VALUE 'DAP'.
                20 TH2-PEHDAR PIC X(3) VALUE 'DAR'.
                20 TH2-PEHDDA PIC X(3) VALUE 'DDA'.
                20 TH2-PEHDDI PIC X(3) VALUE 'DDI'.
                20 TH2-PEHDER PIC X(3) VALUE 'DER'.
                20 TH2-PEHDPE PIC X(3) VALUE 'DPE'.
                20 TH2-PEHDPO PIC X(3) VALUE 'DPO'.
                20 TH2-PEHDRJ PIC X(3) VALUE 'DRJ'.
                20 TH2-PEHEAA PIC X(3) VALUE 'EAA'.
                20 TH2-PEHEBO PIC X(3) VALUE 'EBO'.
                20 TH2-PEHHAH PIC X(3) VALUE 'HAH'.
                20 TH2-PEHHMI PIC X(3) VALUE 'HMI'.
                20 TH2-PEHHOS PIC X(3) VALUE 'HOS'.
                20 TH2-PEHHRA PIC X(3) VALUE 'HRA'.
                20 TH2-PEHIAG PIC X(3) VALUE 'IAG'.
                20 TH2-PEHICE PIC X(3) VALUE 'ICE'.
                20 TH2-PEHINC PIC X(3) VALUE 'INC'.
                20 TH2-PEHINV PIC X(3) VALUE 'INV'.
                20 TH2-PEHJUE PIC X(3) VALUE 'JUE'.
                20 TH2-PEHLAF PIC X(3) VALUE 'LAF'.
                20 TH2-PEHLIM PIC X(3) VALUE 'LIM'.
                20 TH2-PEHLIP PIC X(3) VALUE 'LIP'.
                20 TH2-PEHMGA PIC X(3) VALUE 'MGA'.
                20 TH2-PEHMGG PIC X(3) VALUE 'MGG'.
                20 TH2-PEHMRP PIC X(3) VALUE 'MRP'.
                20 TH2-PEHNAA PIC X(3) VALUE 'NAA'.
                20 TH2-PEHOAH PIC X(3) VALUE 'OAH'.
                20 TH2-PEHOES PIC X(3) VALUE 'OES'.
                20 TH2-PEHPAC PIC X(3) VALUE 'PAC'.
                20 TH2-PEHPAH PIC X(3) VALUE 'PAH'.
                20 TH2-PEHPEN PIC X(3) VALUE 'PEN'.
                20 TH2-PEHRAA PIC X(3) VALUE 'RAA'.
                20 TH2-PEHRAL PIC X(3) VALUE 'RAL'.
                20 TH2-PEHRAT PIC X(3) VALUE 'RAT'.
                20 TH2-PEHRD0 PIC X(3) VALUE 'RD0'.
                20 TH2-PEHRSD PIC X(3) VALUE 'RSD'.
                20 TH2-PEHSAI PIC X(3) VALUE 'SAI'.
                20 TH2-PEHSEJ PIC X(3) VALUE 'SEJ'.
                20 TH2-PEHSRP PIC X(3) VALUE 'SRP'.
                20 TH2-PEHSUS PIC X(3) VALUE 'SUS'.
                20 TH2-PEHTAG PIC X(3) VALUE 'TAG'.
                20 TH2-PEHTPA PIC X(3) VALUE 'TPA'.
                20 TH2-PEHTPE PIC X(3) VALUE 'TPE'.
                20 TH2-PEH000 PIC X(3) VALUE '000'.
                20 TH2-PEH999 PIC X(3) VALUE '999'.
      **-------------------------00170 - CDPEXH
                20 TH2-PEXPEX PIC X(3) VALUE 'PEX'.
                20 TH2-PEX000 PIC X(3) VALUE '000'.
                20 TH2-PEX999 PIC X(3) VALUE '999'.
      **-------------------------00173 - CDPXLH
                20 TH2-PLHDEM PIC X(3) VALUE 'DEM'.
                20 TH2-PLHFOR PIC X(3) VALUE 'FOR'.
                20 TH2-PLHJUS PIC X(3) VALUE 'JUS'.
                20 TH2-PLHQFR PIC X(3) VALUE 'QFR'.
                20 TH2-PLHSUI PIC X(3) VALUE 'SUI'.
                20 TH2-PLH000 PIC X(3) VALUE '000'.
                20 TH2-PLH999 PIC X(3) VALUE '999'.
      **-------------------------00180 - CDRESH
                20 TH2-PEREVA PIC X(3) VALUE 'EVA'.
                20 TH2-PERRAB PIC X(3) VALUE 'RAB'.
                20 TH2-PERRES PIC X(3) VALUE 'RES'.
                20 TH2-PERRIR PIC X(3) VALUE 'RIR'.
                20 TH2-PER000 PIC X(3) VALUE '000'.
                20 TH2-PER999 PIC X(3) VALUE '999'.
      **-------------------------00186 - CDSDAH
                20 TH2-DO2DSD PIC X(3) VALUE 'DSD'.
                20 TH2-DO2000 PIC X(3) VALUE '000'.
                20 TH2-DO2999 PIC X(3) VALUE '999'.
      **-------------------------00189 - CDSUGH
                20 TH2-SP1SGC PIC X(3) VALUE 'SGC'.
                20 TH2-SP1000 PIC X(3) VALUE '000'.
                20 TH2-SP1999 PIC X(3) VALUE '999'.
      **-------------------------00192 - CDZZZS
                20 TH2-ZZZZZZ PIC X(3) VALUE 'ZZZ'.
                20 TH2-ZZZ000 PIC X(3) VALUE '000'.
              15 TH2-GDDR REDEFINES TH2-GDDS.
                20 TH2-GDD PIC X(3) OCCURS 00193
                               INDEXED BY IX-TH2 IX-TH2-2 IX-TH2-3.
              15 IX-TH2-M PIC S9(5) COMP-3 VALUE 00193.
      *------------------------
            10 TH3.
              15 TH3-LNGS.
      **-------------------------00001 - CDAIFH
                20 TH3-FOHAIF PIC S9(3) COMP-3 VALUE 003.
                20 TH3-FOH000 PIC S9(3) COMP-3 VALUE 020.
                20 TH3-FOH999 PIC S9(3) COMP-3 VALUE 003.
      **-------------------------00004 - CDAIFS
                20 TH3-FOSZZZ PIC S9(3) COMP-3 VALUE 064.
                20 TH3-FOS000 PIC S9(3) COMP-3 VALUE 007.
      **-------------------------00006 - CDALLH
                20 TH3-AL0ALC PIC S9(3) COMP-3 VALUE 004.
                20 TH3-AL0000 PIC S9(3) COMP-3 VALUE 021.
                20 TH3-AL0999 PIC S9(3) COMP-3 VALUE 004.
      **-------------------------00009 - CDDEMH
                20 TH3-DMHAAH PIC S9(3) COMP-3 VALUE 016.
                20 TH3-DMHAFH PIC S9(3) COMP-3 VALUE 005.
                20 TH3-DMHCMG PIC S9(3) COMP-3 VALUE 001.
                20 TH3-DMHCMS PIC S9(3) COMP-3 VALUE 006.
                20 TH3-DMHCRH PIC S9(3) COMP-3 VALUE 001.
                20 TH3-DMHCSF PIC S9(3) COMP-3 VALUE 010.
                20 TH3-DMHDEC PIC S9(3) COMP-3 VALUE 005.
                20 TH3-DMHDES PIC S9(3) COMP-3 VALUE 005.
                20 TH3-DMHDFA PIC S9(3) COMP-3 VALUE 011.
                20 TH3-DMHDGT PIC S9(3) COMP-3 VALUE 011.
                20 TH3-DMHDPE PIC S9(3) COMP-3 VALUE 014.
                20 TH3-DMHDPI PIC S9(3) COMP-3 VALUE 015.
                20 TH3-DMHDRM PIC S9(3) COMP-3 VALUE 108.
                20 TH3-DMHDSF PIC S9(3) COMP-3 VALUE 005.
                20 TH3-DMHDVS PIC S9(3) COMP-3 VALUE 005.
                20 TH3-DMHMID PIC S9(3) COMP-3 VALUE 018.
                20 TH3-DMHPJA PIC S9(3) COMP-3 VALUE 007.
                20 TH3-DMHPPA PIC S9(3) COMP-3 VALUE 026.
                20 TH3-DMHRSA PIC S9(3) COMP-3 VALUE 034.
                20 TH3-DMHRSO PIC S9(3) COMP-3 VALUE 017.
                20 TH3-DMH000 PIC S9(3) COMP-3 VALUE 022.
                20 TH3-DMH999 PIC S9(3) COMP-3 VALUE 108.
      **-------------------------00031 - CDDODH
                20 TH3-DOMSER PIC S9(3) COMP-3 VALUE 008.
                20 TH3-DOMSPL PIC S9(3) COMP-3 VALUE 003.
                20 TH3-DOM000 PIC S9(3) COMP-3 VALUE 018.
                20 TH3-DOM999 PIC S9(3) COMP-3 VALUE 008.
      **-------------------------00035 - CDDOIH
                20 TH3-DOHAIA PIC S9(3) COMP-3 VALUE 006.
                20 TH3-DOHAMI PIC S9(3) COMP-3 VALUE 002.
                20 TH3-DOHAOH PIC S9(3) COMP-3 VALUE 003.
                20 TH3-DOHAOR PIC S9(3) COMP-3 VALUE 013.
                20 TH3-DOHAPR PIC S9(3) COMP-3 VALUE 012.
                20 TH3-DOHASX PIC S9(3) COMP-3 VALUE 004.
                20 TH3-DOHBEF PIC S9(3) COMP-3 VALUE 011.
                20 TH3-DOHCCA PIC S9(3) COMP-3 VALUE 007.
                20 TH3-DOHCLG PIC S9(3) COMP-3 VALUE 005.
                20 TH3-DOHCPI PIC S9(3) COMP-3 VALUE 029.
                20 TH3-DOHCRE PIC S9(3) COMP-3 VALUE 020.
                20 TH3-DOHCRM PIC S9(3) COMP-3 VALUE 037.
                20 TH3-DOHDAR PIC S9(3) COMP-3 VALUE 031.
                20 TH3-DOHEEO PIC S9(3) COMP-3 VALUE 001.
                20 TH3-DOHLIM PIC S9(3) COMP-3 VALUE 003.
                20 TH3-DOHMCF PIC S9(3) COMP-3 VALUE 004.
                20 TH3-DOHMGC PIC S9(3) COMP-3 VALUE 016.
                20 TH3-DOHMGJ PIC S9(3) COMP-3 VALUE 005.
                20 TH3-DOHMGP PIC S9(3) COMP-3 VALUE 005.
                20 TH3-DOHMSD PIC S9(3) COMP-3 VALUE 037.
                20 TH3-DOHNEC PIC S9(3) COMP-3 VALUE 002.
                20 TH3-DOHOLG PIC S9(3) COMP-3 VALUE 002.
                20 TH3-DOHPLP PIC S9(3) COMP-3 VALUE 008.
                20 TH3-DOHQFA PIC S9(3) COMP-3 VALUE 012.
                20 TH3-DOHQFR PIC S9(3) COMP-3 VALUE 024.
                20 TH3-DOHQFV PIC S9(3) COMP-3 VALUE 008.
                20 TH3-DOHQUI PIC S9(3) COMP-3 VALUE 017.
                20 TH3-DOHRNG PIC S9(3) COMP-3 VALUE 006.
                20 TH3-DOHRSF PIC S9(3) COMP-3 VALUE 002.
                20 TH3-DOHSDO PIC S9(3) COMP-3 VALUE 001.
                20 TH3-DOHSUR PIC S9(3) COMP-3 VALUE 010.
                20 TH3-DOHTIE PIC S9(3) COMP-3 VALUE 010.
                20 TH3-DOHTIT PIC S9(3) COMP-3 VALUE 009.
                20 TH3-DOH000 PIC S9(3) COMP-3 VALUE 018.
                20 TH3-DOH999 PIC S9(3) COMP-3 VALUE 037.
      **-------------------------00070 - CDDRES
                20 TH3-ODEZZZ PIC S9(3) COMP-3 VALUE 000.
                20 TH3-ODE000 PIC S9(3) COMP-3 VALUE 013.
      **-------------------------00072 - CDLOGH
                20 TH3-LGHBAI PIC S9(3) COMP-3 VALUE 008.
                20 TH3-LGHCAI PIC S9(3) COMP-3 VALUE 001.
                20 TH3-LGHCAL PIC S9(3) COMP-3 VALUE 023.
                20 TH3-LGHCHL PIC S9(3) COMP-3 VALUE 011.
                20 TH3-LGHCML PIC S9(3) COMP-3 VALUE 005.
                20 TH3-LGHCNA PIC S9(3) COMP-3 VALUE 014.
                20 TH3-LGHCOL PIC S9(3) COMP-3 VALUE 007.
                20 TH3-LGHDEC PIC S9(3) COMP-3 VALUE 009.
                20 TH3-LGHDPL PIC S9(3) COMP-3 VALUE 003.
                20 TH3-LGHETU PIC S9(3) COMP-3 VALUE 006.
                20 TH3-LGHLAI PIC S9(3) COMP-3 VALUE 001.
                20 TH3-LGHMPL PIC S9(3) COMP-3 VALUE 005.
                20 TH3-LGHNRL PIC S9(3) COMP-3 VALUE 002.
                20 TH3-LGHPPL PIC S9(3) COMP-3 VALUE 002.
                20 TH3-LGHSAL PIC S9(3) COMP-3 VALUE 001.
                20 TH3-LGHSIN PIC S9(3) COMP-3 VALUE 001.
                20 TH3-LGH000 PIC S9(3) COMP-3 VALUE 020.
                20 TH3-LGH999 PIC S9(3) COMP-3 VALUE 023.
      **-------------------------00090 - CDLOGS
                20 TH3-LGSZZZ PIC S9(3) COMP-3 VALUE 113.
                20 TH3-LGS000 PIC S9(3) COMP-3 VALUE 007.
      **-------------------------00092 - CDMAPH
                20 TH3-MAHAPL PIC S9(3) COMP-3 VALUE 012.
                20 TH3-MAH000 PIC S9(3) COMP-3 VALUE 020.
                20 TH3-MAH999 PIC S9(3) COMP-3 VALUE 012.
      **-------------------------00095 - CDMAPS
                20 TH3-MASZZZ PIC S9(3) COMP-3 VALUE 016.
                20 TH3-MAS000 PIC S9(3) COMP-3 VALUE 007.
      **-------------------------00097 - CDPEDH
                20 TH3-POMJUR PIC S9(3) COMP-3 VALUE 001.
                20 TH3-POMJUT PIC S9(3) COMP-3 VALUE 006.
                20 TH3-POM000 PIC S9(3) COMP-3 VALUE 018.
                20 TH3-POM999 PIC S9(3) COMP-3 VALUE 006.
      **-------------------------00101 - CDPEIH
                20 TH3-PEHAAH PIC S9(3) COMP-3 VALUE 056.
                20 TH3-PEHABM PIC S9(3) COMP-3 VALUE 020.
                20 TH3-PEHABP PIC S9(3) COMP-3 VALUE 020.
                20 TH3-PEHABS PIC S9(3) COMP-3 VALUE 006.
                20 TH3-PEHACC PIC S9(3) COMP-3 VALUE 016.
                20 TH3-PEHACE PIC S9(3) COMP-3 VALUE 003.
                20 TH3-PEHACH PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHAES PIC S9(3) COMP-3 VALUE 004.
                20 TH3-PEHAFE PIC S9(3) COMP-3 VALUE 036.
                20 TH3-PEHAGE PIC S9(3) COMP-3 VALUE 028.
                20 TH3-PEHAPC PIC S9(3) COMP-3 VALUE 021.
                20 TH3-PEHAPH PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHARS PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHAVM PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHBEP PIC S9(3) COMP-3 VALUE 027.
                20 TH3-PEHCAP PIC S9(3) COMP-3 VALUE 013.
                20 TH3-PEHCIB PIC S9(3) COMP-3 VALUE 033.
                20 TH3-PEHCOT PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHCOV PIC S9(3) COMP-3 VALUE 011.
                20 TH3-PEHCRA PIC S9(3) COMP-3 VALUE 069.
                20 TH3-PEHCRE PIC S9(3) COMP-3 VALUE 011.
                20 TH3-PEHCRM PIC S9(3) COMP-3 VALUE 021.
                20 TH3-PEHCTS PIC S9(3) COMP-3 VALUE 005.
                20 TH3-PEHDAE PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHDAP PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHDAR PIC S9(3) COMP-3 VALUE 037.
                20 TH3-PEHDDA PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHDDI PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHDER PIC S9(3) COMP-3 VALUE 005.
                20 TH3-PEHDPE PIC S9(3) COMP-3 VALUE 003.
                20 TH3-PEHDPO PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHDRJ PIC S9(3) COMP-3 VALUE 006.
                20 TH3-PEHEAA PIC S9(3) COMP-3 VALUE 003.
                20 TH3-PEHEBO PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHHAH PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHHMI PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHHOS PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHHRA PIC S9(3) COMP-3 VALUE 013.
                20 TH3-PEHIAG PIC S9(3) COMP-3 VALUE 012.
                20 TH3-PEHICE PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHINC PIC S9(3) COMP-3 VALUE 003.
                20 TH3-PEHINV PIC S9(3) COMP-3 VALUE 010.
                20 TH3-PEHJUE PIC S9(3) COMP-3 VALUE 003.
                20 TH3-PEHLAF PIC S9(3) COMP-3 VALUE 009.
                20 TH3-PEHLIM PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHLIP PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHMGA PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHMGG PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHMRP PIC S9(3) COMP-3 VALUE 012.
                20 TH3-PEHNAA PIC S9(3) COMP-3 VALUE 008.
                20 TH3-PEHOAH PIC S9(3) COMP-3 VALUE 005.
                20 TH3-PEHOES PIC S9(3) COMP-3 VALUE 005.
                20 TH3-PEHPAC PIC S9(3) COMP-3 VALUE 010.
                20 TH3-PEHPAH PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHPEN PIC S9(3) COMP-3 VALUE 006.
                20 TH3-PEHRAA PIC S9(3) COMP-3 VALUE 011.
                20 TH3-PEHRAL PIC S9(3) COMP-3 VALUE 007.
                20 TH3-PEHRAT PIC S9(3) COMP-3 VALUE 011.
                20 TH3-PEHRD0 PIC S9(3) COMP-3 VALUE 009.
                20 TH3-PEHRSD PIC S9(3) COMP-3 VALUE 006.
                20 TH3-PEHSAI PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHSEJ PIC S9(3) COMP-3 VALUE 003.
                20 TH3-PEHSRP PIC S9(3) COMP-3 VALUE 011.
                20 TH3-PEHSUS PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEHTAG PIC S9(3) COMP-3 VALUE 003.
                20 TH3-PEHTPA PIC S9(3) COMP-3 VALUE 008.
                20 TH3-PEHTPE PIC S9(3) COMP-3 VALUE 003.
                20 TH3-PEH000 PIC S9(3) COMP-3 VALUE 018.
                20 TH3-PEH999 PIC S9(3) COMP-3 VALUE 069.
      **-------------------------00170 - CDPEXH
                20 TH3-PEXPEX PIC S9(3) COMP-3 VALUE 001.
                20 TH3-PEX000 PIC S9(3) COMP-3 VALUE 021.
                20 TH3-PEX999 PIC S9(3) COMP-3 VALUE 001.
      **-------------------------00173 - CDPXLH
                20 TH3-PLHDEM PIC S9(3) COMP-3 VALUE 011.
                20 TH3-PLHFOR PIC S9(3) COMP-3 VALUE 015.
                20 TH3-PLHJUS PIC S9(3) COMP-3 VALUE 006.
                20 TH3-PLHQFR PIC S9(3) COMP-3 VALUE 008.
                20 TH3-PLHSUI PIC S9(3) COMP-3 VALUE 010.
                20 TH3-PLH000 PIC S9(3) COMP-3 VALUE 025.
                20 TH3-PLH999 PIC S9(3) COMP-3 VALUE 015.
      **-------------------------00180 - CDRESH
                20 TH3-PEREVA PIC S9(3) COMP-3 VALUE 022.
                20 TH3-PERRAB PIC S9(3) COMP-3 VALUE 081.
                20 TH3-PERRES PIC S9(3) COMP-3 VALUE 352.
                20 TH3-PERRIR PIC S9(3) COMP-3 VALUE 035.
                20 TH3-PER000 PIC S9(3) COMP-3 VALUE 019.
                20 TH3-PER999 PIC S9(3) COMP-3 VALUE 352.
      **-------------------------00186 - CDSDAH
                20 TH3-DO2DSD PIC S9(3) COMP-3 VALUE 016.
                20 TH3-DO2000 PIC S9(3) COMP-3 VALUE 023.
                20 TH3-DO2999 PIC S9(3) COMP-3 VALUE 016.
      **-------------------------00189 - CDSUGH
                20 TH3-SP1SGC PIC S9(3) COMP-3 VALUE 001.
                20 TH3-SP1000 PIC S9(3) COMP-3 VALUE 021.
                20 TH3-SP1999 PIC S9(3) COMP-3 VALUE 001.
      **-------------------------00192 - CDZZZS
                20 TH3-ZZZZZZ PIC S9(3) COMP-3 VALUE 800.
                20 TH3-ZZZ000 PIC S9(3) COMP-3 VALUE 100.
              15 TH3-LNGR REDEFINES TH3-LNGS.
                20 TH3-LNG PIC S9(3) COMP-3 OCCURS 00193
                               INDEXED BY IX-TH3 IX-TH3-2 IX-TH3-3.
              15 IX-TH3-M PIC S9(5) COMP-3 VALUE 00193.
      *END_OF_COPY_FILE
      *    COPY  CGLBANAL.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBANAL.CPY"
      ******************************************************************
      * COPY CGLBANAL
      *   BLOC BANALISE DE STOCKAGE
      *   BLOC INTER GDD
      *   DATABLEM 60 MOIS
      *   VARIABLE POUR 31 M-1 01 M 31 M
      *   VARIABLE DE CALCUL DE DATE
      *   VARIABLE DE RECHERCHE POUR LE TABLEAU MAJEUR CGLBAMAJ
      *   VARIABLE DE RECHERCHE EN BANALISE LSBA-E-S-ACCES-GDD
      *
      ******************************************************************
      *   BLOC BANALISE DE STOCKAGE DES GDDS LUS
      *      LSBA-MAX = LONGUEUR (LSBA-BAN)
      *   ORIGINE ET DEPLACEMENT SUR ZONE BANALISE
      *   VARIABLE DE BOUCLAGE APRES LESTURE L0H
      *-----------------------------------------------------
      * LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA
      * Ajout du préfixe LSBA- pour identifier l'origine des données
      * dans le code, et leur usage (linkage)
      * LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA LSBA
      *
           05 CGLBANAL.
             10 LSBA-MAX                               PIC S9(5) COMP-3.
             10 LSBA-BAN                               PIC X(500).
             10 LSBA-ORI                               PIC S9(5) COMP-3.
             10 LSBA-ORI-S                             PIC S9(5) COMP-3.
             10 LSBA-ZNOCCD1                           PIC S9(3) COMP-3.
             10 LSBA-ZNOCCD2                           PIC S9(3) COMP-3.
      *
      *-----------------------------------------------------
      *   BLOC INTER GDD
      *   ORIGINE ET DEPLACEMENT IGAD SUR WS-IG-DONNEES
      *              CALCULE DANS LE CGS100 - A8500-MIS-EN-BUFFER
      *-----------------------------------------------------
             10 LSBA-IG-ORI                            PIC S9(5) COMP-3.
             10 LSBA-IG-LNG                            PIC S9(3) COMP-3.
             10 LSBA-IG-DOHH-ORI             PIC S9(3) COMP-3 VALUE 005.
      *                         DOH000 + GDD 3 + NETIMA 1 + DOH999
             10 LSBA-IG-DOHH-LNG                       PIC S9(3) COMP-3.
      *
             10 LSBA-IG-LGHH-ORI             PIC S9(3) COMP-3 VALUE 007.
             10 LSBA-IG-LGHH-LNG             PIC S9(3) COMP-3 VALUE 999.
      *
             10 LSBA-IG-PEHH-ORI             PIC S9(3) COMP-3 VALUE 005.
      *                         PEH000 + GDD 3 + NETIMA 1 + PEH999
             10 LSBA-IG-PEHH-LNG             PIC S9(3) COMP-3.
             10 LSBA-IG-DOMH-ORI             PIC S9(3) COMP-3 VALUE 005.
      *                         DOM000 + GDD 3 + NETIMA 1 + DOM999
             10 LSBA-IG-DOMH-LNG             PIC S9(3) COMP-3.
             10 LSBA-IG-DO2H-ORI             PIC S9(3) COMP-3 VALUE 005.
      *                         DO2000 + GDD 3 + NETIMA 1 + DO2999
             10 LSBA-IG-DO2H-LNG             PIC S9(3) COMP-3.
             10 LSBA-IG-AL0H-ORI             PIC S9(3) COMP-3 VALUE 008.
      *                         DO2000 + GDD 3 + NETIMA 1 + DO2999
             10 LSBA-IG-AL0H-LNG             PIC S9(3) COMP-3.
      *
             10 LSBA-IG-RESH-ORI             PIC S9(3) COMP-3 VALUE 006.
             10 LSBA-IG-RESH-LNG             PIC S9(3) COMP-3.
      *
      *---   Longueur clé standard : identifiant GDD + D1 + D2 + NETIMA
             10 LSBA-LT-CLE-GDD              PIC 99 VALUE 14.
      *-----------------------------------------------------
      *  TABLEAU DE DERNIER JOUR DU MOIS DATABLEM
      *      ALLANT DE MC-49, MC (=50 POS), MC+10
      *  + Stockage Index de DMCDOS dans TBLM-IN-DMCDOS = 50
      *  + TBLM-IN-MT = Indice correspondant au MT dans TBLM-SAMJX
      *  (calculé dans cgs100a)
      *-----------------------------------------------------
      *
             10 TBLM-IN-DMCDOS PIC S9(3) COMP-3 VALUE 50.
             10 TBLM-IN-MT            PIC S9(3)  COMP-3.
             10 IN-MAX-TABLEM         PIC S9(3)  COMP-3.
             10 TBLM-TABLEM.
               15 TBLM-DATABLEM OCCURS 60 INDEXED BY TBLM-IX
                                                    TBLM-IX-1
                                                    TBLM-IX-2
                                                    TBLM-IX-3.
                 17 TBLM-SAMJX.
                   20 TBLM-SAMX.
                     22 TBLM-SSAAX.
                       24 TBLM-SS9 PIC 99.
                       24 TBLM-AA9 PIC 99.
                     22 TBLM-SSAA9 REDEFINES
                                             TBLM-SSAAX PIC 9999.
                     22 TBLM-MM9 PIC 99.
                   20 TBLM-SAM9 REDEFINES TBLM-SAMX PIC 9(6).
                   20 TBLM-JJ9 PIC 99.
                 17 TBLM-SAMJ9 REDEFINES TBLM-SAMJX PIC 9(8).
                 17 TBLM-RLOGEM    PIC S9(3) COMP-3.
                 17 TBLM-DATA      PIC X(100).
                 17 TBLM-D1        PIC 9(9).
                 17 TBLM-D2        PIC 9(9).
      *
      *     VARIABLES DE CALCUL POUR 31 M-1 01 M 31 M
      * non il formellement interdit de manipuler ce bloc autrement
      * non qu'en lecture. ces 3 dates sont chargées en debut d'etude
      * *** et mieux vaut pas les altérer dans cgs100a tant que tous
      * *** les chargements en banalisée n'ont pas été faits
      * non de mois et contiennent:1)date fin mois precedent
      * non                       :2)date deb.mois traité
      * non                       :3)date fin mois traité
      * oui  phv - 24.08.98 - ces zones peuvent etre altere au cours
      * oui  du traitement - pour le 31 m-1,01 de m,31 de m il faut
      * oui  prendre ls-DT-FIN-MOIS-PREC LS-DT-FIN-MOIS-TRAITE.
      *
             10 LSBA-SAMJS.
               15 LSBA-SAMJ OCCURS 3 INDEXED BY LSBA-IX-SAMJ.
                  17 LSBA-SAMJX.
                     20 LSBA-SAMX.
                        22 LSBA-SSAAX.
                           24 LSBA-SS PIC 99.
                           24 LSBA-AA PIC 99.
                              88 LSBA-AA-BISEX value
                                        04 08 12 16 20
                                        24 28 32 36 40
                                        44 48 52 56 60
                                        64 68 72 76 80
                                        84 88 92 96 00.
                        22 LSBA-SSAA9 REDEFINES LSBA-SSAAX
                                                              PIC 9999.
                        22 LSBA-MM PIC 99.
                           88 LSBA-MM-30   VALUE 04 06 09 11.
                           88 LSBA-MM9-JANVIER   VALUE 01.
                           88 LSBA-MM9-FEVRIER   VALUE 02.
                           88 LSBA-MM9-MARS      VALUE 03.
                           88 LSBA-MM9-AVRIL     VALUE 04.
                           88 LSBA-MM9-MAI       VALUE 05.
                           88 LSBA-MM9-JUIN      VALUE 06.
                           88 LSBA-MM9-JUILLET   VALUE 07.
                           88 LSBA-MM9-AOUT      VALUE 08.
                           88 LSBA-MM9-SEPTEMBRE VALUE 09.
                           88 LSBA-MM9-OCTOBRE   VALUE 10.
                           88 LSBA-MM9-NOVEMBRE  VALUE 11.
                           88 LSBA-MM9-DECEMBRE  VALUE 12.
                     20 LSBA-SAM9 REDEFINES LSBA-SAMX PIC 9(6).
                     20 LSBA-JJ PIC 99.
      *
                  17 LSBA-SAMJ9 REDEFINES LSBA-SAMJX      PIC 9(8).
      *
      *      VARIABLE DE CALCUL DE DATE
      *     ces 2 données servent à tout calcul de dates
      *      ajout, soustraction, ecart.
      *
             10 LSBA-SAMJ-B.
               12 LSBA-SAMJX-B.
                  14 LSBA-SAMX-B.
                    16 LSBA-SSAAX-B.
                      18 LSBA-SS-B PIC 99.
                      18 LSBA-AA-B PIC 99.
                         88 LSBA-AA-B-BISEX value
                                        04 08 12 16 20
                                        24 28 32 36 40
                                        44 48 52 56 60
                                        64 68 72 76 80
                                        84 88 92 96 00.
                    16 LSBA-SSAA9-B REDEFINES LSBA-SSAAX-B
                                                             PIC 9999.
                    16 LSBA-MM-B PIC 99.
                       88 LSBA-MM-B31   VALUE 01 03 05 07 08 10 12.
                       88 LSBA-MM-B30   VALUE 04 06 09 11.
                       88 LSBA-MM-JANVIER   VALUE 01.
                       88 LSBA-MM-FEVRIER   VALUE 02.
                       88 LSBA-MM-MARS      VALUE 03.
                       88 LSBA-MM-AVRIL     VALUE 04.
                       88 LSBA-MM-MAI       VALUE 05.
                       88 LSBA-MM-JUIN      VALUE 06.
                       88 LSBA-MM-JUILLET   VALUE 07.
                       88 LSBA-MM-AOUT      VALUE 08.
                       88 LSBA-MM-SEPTEMBRE VALUE 09.
                       88 LSBA-MM-OCTOBRE   VALUE 10.
                       88 LSBA-MM-NOVEMBRE  VALUE 11.
                       88 LSBA-MM-DECEMBRE  VALUE 12.
                  14 LSBA-SAM9-B REDEFINES LSBA-SAMX-B
                                                             PIC 9(6).
                  14 LSBA-JJ-B PIC 99.
               12 LSBA-SAMJ9-B REDEFINES LSBA-SAMJX-B
                                                             PIC 9(8).
      *
             10 LSBA-SAMJ9-S                                 PIC 9(8).
      *
      *      VARIABLE DE CALCUL DE DATE
      *     CETTE DONNEE  EST LE CALCUL DMCDOS - 5 ANS
      *
             10 LSBA-SAMJ-C.
               12 LSBA-SAMJX-C.
                  14 LSBA-SAMX-C.
                    16 LSBA-SSAAX-C.
                      18 LSBA-SS-C PIC 99.
                      18 LSBA-AA-C PIC 99.
                    16 LSBA-SSAA-C REDEFINES LSBA-SSAAX-C
                                                             PIC 9999.
                    16 LSBA-MM-C PIC 99.
                  14 LSBA-SAM9-C REDEFINES LSBA-SAMX-C
                                                             PIC 9(6).
                  14 LSBA-JJ-C PIC 99.
               12 LSBA-SAMJ9-C REDEFINES LSBA-SAMJX-C
                                                             PIC 9(8).
      *
             10 LSBA-GDD-D1D2.
               15 LSBA-GDD                     PIC X(3).
               15 LSBA-D1D2.
                  20 LSBA-D1X.
                     25 LSBA-D1                PIC S9(9) COMP-3.
                  20 LSBA-D2X.
                     25 LSBA-D2                PIC S9(9) COMP-3.
               15 LSBA-NETIMAX.
                  20 LSBA-NETIMA               PIC S9(1) COMP-3.
                                                                        
             10 LSBA-I5                        PIC S9(5) COMP-3.
             10 LSBA-INDEX                     PIC S9(3) COMP-3.
             10 LSBA-LNG                       PIC S9(5) COMP-3.
      *
      *   VARIABLE DE RECHERCHE COMMUNE DOH PEH - BANALISE ---> LKMO
      *
             10 LSBA-LKMO-ORI                  PIC S9(5) COMP-3.
             10 LSBA-I4                        PIC 9(6).
                                                                        
      *- NOTA
      *--- il faut noter que les fonctions <= et << impliquent
      *---  une lecture arrière D0C sur base db2 donc par équivalence
      *---  en lecture sur banalisée on lira de futur vers passé
      *---  alors que dans les autres fonctions on lira de passé vers
      *---  futur
      *-------------------------------------------------------------
      *
      * *** Les zones, du 15, qui suivent seraient mieux en working
      * et y vont petit à petit
             10 LSBA-E-S-ACCES-GDD.
               15 LSBA-ENTREE.
      *-----     20 LSBA-ZENTLG PIC X(3). ---- transfert dans CGPACKWK
      *-----     20 LSBA-ZIDGDD PIC X(3). ---- transfert dans CGPACKWK
                 20 LSBA-ZOSENS PIC XX.
                    88 LSBA-FL-ZOSENS-EGAEGA VALUE '=='.
                    88 LSBA-FL-ZOSENS-INFEGA VALUE '<='.
                    88 LSBA-FL-ZOSENS-INFINF VALUE '<<'.
                    88 LSBA-FL-ZOSENS-SUPEGA VALUE '>='.
                    88 LSBA-FL-ZOSENS-SUPSUP VALUE '>>'.
                    88 LSBA-FL-ZOSENS-INFSUP VALUE '><'.
                    88 LSBA-FL-ZOSENS-AVTAPS VALUE '<>'.
                    88 LSBA-FL-ZOSENS-ECRIT  VALUE 'EC'.
                 20 LSBA-ZNOCCD PIC 99.
                 20 LSBA-ZONES-CLES.
                    25 LSBA-NDOMATX.
                       30 LSBA-NDOMAT   PIC S9(7) COMP-3.
                    25 LSBA-NFICPNX.
                       30 LSBA-NFICPN   PIC S9(7) COMP-3.
                    25 LSBA-CLE-SUITE.
                       30 LSBA-CNAPRS      PIC X(3).
                       30 LSBA-RSNAPR      PIC X(2).
                    25 LSBA-RCLE-SUITE REDEFINES LSBA-CLE-SUITE.
                       30 LSBA-RLOGEMX.
                          35 LSBA-RLOGEM   PIC S9(3) COMP-3.
                       30 LSBA-RAIDMAX.
                          35 LSBA-RAIDMA   PIC S9(3) COMP-3.
                       30 LSBA-CPTRSAX   REDEFINES LSBA-RAIDMAX.
                          35 LSBA-CPTRSA    PIC X.
             10 LSBA-S-GDD-D1D2.
               13 LSBA-S-GDD                PIC X(3).
               13 LSBA-S-D1D2.
                  14 LSBA-S-D1X.
                     15 LSBA-S-D1              PIC S9(9) COMP-3.
                  14 LSBA-S-D2X.
                     15 LSBA-S-D2              PIC S9(9) COMP-3.
               13 LSBA-S-NETIMAX.
                  15 LSBA-S-NETIMA          PIC S9(1) COMP-3.
               13 LSBA-S-FILLER             PIC X(1).
               13 LSBA-S-PRBAN              PIC S9(5) COMP-3.
                  88 LSBA-S-PRBAN-99999     VALUE 99999.
               13 LSBA-S-PREC               PIC S9(5) COMP-3.
               13 LSBA-S-DATA               PIC X(100).
      *
             10 LSBA-S-ORI                  PIC S9(5) COMP-3.
             10 LSBA-S-ORI-S                PIC S9(5) COMP-3.
             10 LSBA-S-FL-MAJ               PIC 9.
             10 LSBA-S-FL-ECRITURE          PIC 9.
                88 LSBA-S-FL-ECRITURE-1     VALUE 1.
      *---------------------------------------------------------------
      *                Version : V03500
      *
      * Chantier : 2050H     Début : 05/07/2011     Fin : 09/08/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03600
      *
      * Chantier : 2050O     Début : 15/12/2011     Fin : 16/02/2012
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03900
      *
      * Chantier : 1R390     Début : 10/01/2013     Fin : 10/01/2013
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                Version : V03900
      *
      * Chantier : 2246T     Début : 22/01/2013     Fin : 22/01/2013
      *
      * Texte  : a998.cct2246:suppression lsba-zigdd,tranfert danscgpack
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04000
      *
      * Chantier : 1R400     Début : 13/03/2013     Fin : 13/03/2013
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04100
      *
      * Chantier : 1R410     Début : 07/08/2013     Fin : 07/08/2013
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04200
      *
      * Chantier : 1R420     Début : 05/12/2013     Fin : 05/12/2013
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBDMHW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBDMHW.CPY"
      *-----------------------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE DES DEMANDES - CDDMH
      *   INUTILE DEPUIS LA VERSION V03900
      *-----------------------------------------------------
           05 LS-CGLBDMHW    PIC X.
      *---------------------------------------------------------------
      *                Version : V04000
      *
      * Chantier : 1R400     Début : 04/03/2013     Fin : 04/03/2013
      *
      * Texte  : grand nettoyage de printemps
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBDOHW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBDOHW.CPY"
      *------------------------------------------------------
      *  CGLBDOHW - LINKAGE INFO. DE LA  BANALISEE ENTREE SORTIE DOH
      *  PRéFIXES DES DONNéES : DOHH, DOHS, IX-DOHH, IX-DOHS.
      *
      *   TABLEAU DIRECTEUR POUR LA TABLE DOH
      *   BLOC INDIRECTION POUR LES GDD RELATIFS
      *   DEBBAN = POSITION DE DEBUT DOH DANS BANALISE
      *   FINBAN = POSITION DE FIN DOH DANS BANALISE
      *   LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *       CONTROLE DANS LE CGS100 SI PLUS DE 40 GDD
      *   LES INDICATEURS DE GDDS (*20 ARBITRAIRE)
      *       NOM DU GDD
      *       PR0 = POS ORIG DU 1 ER GDD DS BANALISE
      *       PR5 = POS ORIG DU GDD 31 M - 1
      *                 PUIS DU GDD ENCADRANT 31 M OU
      *                      DU GDD IMMEDIATEMENT SUPERIEURE
      *                      OU ZERO SI PLUS DE GDD
      *       PR9 = POS ORIG DU DERNIER GDD DS BANALISE
      *   L INDICATEUR EXPLOSION DU TABLEAU DE GDD
      *   L INDICATEUR EXPLOSION DE LA ZONE BANALISE
      *
      *   VARIABLES DE TRAVAIL (CGS100-CGBDOHAK)
      *     NOMBRE MAXI DE GDD DOH POUR LE CONTROLE
      *     NOMBRE MAXI DE GDD DOH DE STOCKAGE
      *     LONGUEUR DE LA CLE DOH
      *     NOMBRE D'OCCURS POUR LIRE DOH EN L0H
      *   VARIABLES DE TRAVAIL (CGM?01-CGRDOHAK)
      *     NOMBRE D'OCCURS MAXIMUM DANS CGS10001
      *-----------------------------------------------------
           05 LS-CGLBDOHW.
              10 LS-DOHH-PERS.
                                                                        
      *---------------------------------------------------------------*
      * DEBUT ZONE CHARGEMENT EN BANALISEE                            *
      *---------------------------------------------------------------*
                                                                        
                12 LS-DOHH-PER.
                   14 LS-DOHH-DEBBAN PIC S9(5) COMP-3.
                   14 LS-DOHH-FINBAN PIC S9(5) COMP-3.
      *
      *---            Indicateurs GDD DOH (actuellement 32)
                   14 LS-DOHH-INDS OCCURS 40 INDEXED BY IX-DOHH-IND.
                      16 LS-DOHH-IND PIC 9.
      *
      *---            GDDs DOH chargés en LKMO (actuellement 27)
                   14 LS-DOHH-GDDS OCCURS 27 INDEXED BY IX-DOHH-GDD.
                      16 LS-DOHH-GDD PIC X(3).
                      16 LS-DOHH-PR0 PIC S9(5) COMP-3.
                      16 LS-DOHH-PR5 PIC S9(5) COMP-3.
                      16 LS-DOHH-PR9 PIC S9(5) COMP-3.
      *
                   14 LS-DOHH-EXP-GDD8 PIC X(3).
      *
                   14 LS-DOHH-EXP-GDD9 PIC X(3).
                   14 LS-DOHH-EXP-H9X.
                      16 LS-DOHH-EXP-H9  PIC S9(9) COMP-3.
      *
              10 LS-IX-DOHH-IND-MAX      PIC S9(3) COMP-3.
      *---       Indicateurs GDD DOH maximum (actuellement 32)
              10 LS-IX-DOHH-IND-MAX-REF  PIC S9(3) COMP-3 VALUE 040.
      *---       GDDs DOH chargés en LKMO (actuellement 27)
              10 LS-IX-DOHH-GDD-MAX      PIC S9(3) COMP-3 VALUE 027.
                                                                        
              10 LS-DOHH-OCC PIC 999.
      *---       Taille de la clé : GDD 3 + DATDEB 5 + DATFIN 5 + 1
              10 LS-DOHH-CLE PIC S9(3) COMP-3 VALUE 014.
      *---       Nombre d'occurrences maximum
              10 LS-DOHH-ZNOCCD-MAX PIC 99 VALUE 5.
                                                                        
      *---------------------------------------------------------------*
      * DEBUT ZONE ECRITURE EN BANALISEE                              *
      *---------------------------------------------------------------*
                                                                        
              10 LS-DOHS-PERS.
                12 LS-DOHS-PER.
                   14 LS-DOHS-DEBBAN PIC S9(5) COMP-3.
                   14 LS-DOHS-FINBAN PIC S9(5) COMP-3.
      *
                   14 LS-DOHS-INDS OCCURS 40 INDEXED BY IX-DOHS-IND.
                      16 LS-DOHS-IND PIC 9.
      *
                   14 LS-DOHS-GDDS OCCURS 13 INDEXED BY IX-DOHS-GDD.
                      16 LS-DOHS-GDD PIC X(3).
                      16 LS-DOHS-PR0 PIC S9(5) COMP-3.
                      16 LS-DOHS-PR5 PIC S9(5) COMP-3.
                      16 LS-DOHS-PR9 PIC S9(5) COMP-3.
      *
                   14 LS-DOHS-EXP-GDD8 PIC X(3).
      *
                   14 LS-DOHS-EXP-GDD9 PIC X(3).
                   14 LS-DOHS-EXP-H9X.
                      16 LS-DOHS-EXP-H9 PIC S9(9) COMP-3.
      *
      *---       GDD DOH écrits en banalisée (actuellement 13)
              10 LS-IX-DOHS-GDD-MAX      PIC S9(3) COMP-3 VALUE 013.
      *---------------------------------------------------------------
      *                Version : V04100
      *
      * Chantier : 1R410     Début : 19/07/2013     Fin : 19/07/2013
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                Version : V04100
      *
      * Chantier : 2300A     Début : 09/10/2013     Fin : 09/10/2013
      *
      * Texte  : Prise en compte des nouveaux GDDs DOH
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04300
      *
      * Chantier : 2296E     Début : 17/04/2014     Fin : 17/04/2014
      *
      * Texte  : a998.ccr2296e:Réforme CA-Gestion compteurs-à compter 07
      *          passage du CLCA à la PrePare pour dossiers avec naiss./
      *          à compter 07/2014-inciter parents à partager Congé Pare
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBDOMW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBDOMW.CPY"
      *-----------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE DOM
      *   BLOC INDIRECTION POUR LES GDD RELATIFS
      *   DEBBAN = POSITION DE DEBUT DOM DANS BANALISE
      *   FINBAN = POSITION DE FIN DOM DANS BANALISE
      *   LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *       CONTROLE DANS LE CGS100 SI PLUS DE 2 GDD
      *   LES INDICATEURS DE GDDS (*2 ARBITRAIRE)
      *       NOM DU GDD
      *       PR0 = POS ORIG DU 1 ER GDD DS BANALISE
      *       PR5 = POS ORIG DU GDD 31 M - 1
      *                 PUIS DU GDD ENCADRANT 31 M OU
      *                      DU GDD IMMEDIATEMENT SUPERIEURE
      *                      OU ZERO SI PLUS DE GDD
      *       PR9 = POS ORIG DU DERNIER GDD DS BANALISE
      *   L INDICATEUR EXPLOSION DU TABLEAU DE GDD
      *   L INDICATEUR EXPLOSION DE LA ZONE BANALISE
      *
      *   VARIABLES DE TRAVAIL (CGS100-CGBDOMAK)
      *     NOMBRE MAXI DE GDD DOM POUR LE CONTROLE
      *     NOMBRE MAXI DE GDD DOM DE STOCKAGE
      *     LITTERAL DOM
      *     LONGUEUR DE LA CLE DOM
      *     NOMBRE D'OCCURS POUR LIRE DOM EN L0H
      *   VARIABLES DE TRAVAIL (CGM?01-CGRDOMAK)
      *     NOMBRE D'OCCURS MAXIMUM DANS CGS?????
      *-----------------------------------------------------
           05 LS-CGLBDOMW.
              10 LS-DOMH-PERS.
                12 LS-DOMH-PER.
                   14 LS-DOMH-DEBBAN PIC S9(5) COMP-3.
                   14 LS-DOMH-FINBAN PIC S9(5) COMP-3.
      *
                   14 LS-DOMH-INDS OCCURS 2 INDEXED BY IX-DOMH-IND.
                      16 LS-DOMH-IND PIC 9.
      *
                   14 LS-DOMH-GDDS OCCURS 2 INDEXED BY IX-DOMH-GDD.
                      16 LS-DOMH-GDD PIC X(3).
                      16 LS-DOMH-PR0 PIC S9(5) COMP-3.
                      16 LS-DOMH-PR5 PIC S9(5) COMP-3.
                      16 LS-DOMH-PR9 PIC S9(5) COMP-3.
      *
                   14 LS-DOMH-EXP-GDD8 PIC X(3).
      *
                   14 LS-DOMH-EXP-GDD9 PIC X(3).
                   14 LS-DOMH-EXP-H9X.
                      16 LS-DOMH-EXP-H9 PIC S9(9) COMP-3.
      *
      *   VARIABLES DE TRAVAIL POUR DOM
      *
      ***     10 IX-DOMH-IND-MAX-REF  PIC 99 VALUE 2.
              10 LS-IX-DOMH-IND-MAX-REF  PIC S9(3) COMP-3 VALUE   2.
      ****    10 IX-DOMH-IND-MAX      PIC 99 VALUE 2.
              10 LS-IX-DOMH-IND-MAX      PIC S9(3) COMP-3 VALUE   2.
              10 LS-IX-DOMH-GDD-MAX      PIC S9(3) COMP-3 VALUE   2.
      *****   10 IX-DOMH-GDD-MAX      PIC 99 VALUE 2.
      *
      *                               GDD 3 + DATDEB 5 + DATFIN 5 + 1
              10 LS-DOMH-CLE PIC S9(3) COMP-3 VALUE 014.
              10 LS-DOMH-OCC PIC 999.
      *
      *   VARIABLES DE TRAVAIL (CGM?01-CGRDOMAK)
      *
              10 LS-DOMH-ZNOCCD-MAX PIC 99 VALUE 7.
      *
              10 LS-DOMS-PERS.
                12 LS-DOMS-PER.
                   14 LS-DOMS-DEBBAN PIC S9(5) COMP-3.
                   14 LS-DOMS-FINBAN PIC S9(5) COMP-3.
      *
                   14 LS-DOMS-INDS OCCURS 2 INDEXED BY IX-DOMS-IND.
                      16 LS-DOMS-IND PIC 9.
      *
                   14 LS-DOMS-GDDS OCCURS 2 INDEXED BY IX-DOMS-GDD.
                      16 LS-DOMS-GDD PIC X(3).
                      16 LS-DOMS-PR0 PIC S9(5) COMP-3.
                      16 LS-DOMS-PR5 PIC S9(5) COMP-3.
                      16 LS-DOMS-PR9 PIC S9(5) COMP-3.
      *
                   14 LS-DOMS-EXP-GDD8 PIC X(3).
      *
                   14 LS-DOMS-EXP-GDD9 PIC X(3).
                   14 LS-DOMS-EXP-H9X.
                      16 LS-DOMS-EXP-H9 PIC S9(9) COMP-3.
      *
      *   VARIABLES DE TRAVAIL POUR DOM
      *
      *--     10 IX-DOMS-IND-MAX-REF  PIC S9(3) COMP-3 VALUE   2.
      *--     10 IX-DOMS-IND-MAX      PIC S9(3) COMP-3 VALUE   2.
      ******* 10 IX-DOMS-GDD-MAX      PIC 99 VALUE 2.
              10 LS-IX-DOMS-GDD-MAX      PIC S9(3) COMP-3 VALUE   2.
      *
      *--     10 LS-XXXH-DOMS PIC X(3) VALUE 'DOM'.
      *                               GDD 3 + DATDEB 5 + DATFIN 5 + 1
      *--     10 LS-DOMS-CLE PIC S9(3) COMP-3 VALUE 014.
      *--     10 LS-DOMS-OCC PIC 999.
      *
      *   VARIABLES DE TRAVAIL (CGM?01-CGRDOMAK)
      *
      *--     10 LS-DOMS-ZNOCCD-MAX PIC 99 VALUE 7.
      *---------------------------------------------------------------
      *                VERSION : V03310
      *
      * CHANTIER : 1R331     DéBUT : 17/11/2010     FIN : 17/11/2010
      *
      * TEXTE  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03410
      *
      * Chantier : 2050E     Début : 20/05/2011     Fin : 20/05/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03500
      *
      * Chantier : 2050H     Début : 16/08/2011     Fin : 29/08/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03510
      *
      * Chantier : 2050L     Début : 07/09/2011     Fin : 07/09/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBDO2W.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBDO2W.CPY"
      *    *-- suppression de cgbdo2ak et cgrdo2ak-remplacé par cgrtabak
           05 LS-CGLBDO2W       PIC X.
      *---------------------------------------------------------------
      *                Version : V04000
      *
      * Chantier : 2273T     Début : 20/03/2013     Fin : 20/03/2013
      *
      * Texte  : suppression CGBDO2AK et CGRDO2AK
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBFOHW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBFOHW.CPY"
      *-----------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE FOH
      *   BLOC INDIRECTION POUR LES PERSONNES ET LES GDDS RELATIFS
      *   POUR CHAQUE PERSONNE
      *   LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *      RAIDMA = RANG DE LA FAMILLE AIDE-FAMILLE
      *      DEBBAN = POSITION DE DEBUT FOH DANS BANALISE
      *      FINBAN = POSITION DE FIN FOH DANS BANALISE
      *      LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *          CONTROLE DANS LE CGS100 SI PLUS DE 2 GDD
      *      LES INDICATEURS DE GDDS (*2 ARBITRAIRE)
      *          NOM DU GDD
      *          PR0 = POS ORIG DU 1 ER GDD DS BANALISE
      *          PR5 = POS ORIG DU GDD 31 M - 1
      *                    PUIS DU GDD ENCADRANT 31 M OU
      *                         DU GDD IMMEDIATEMENT SUPERIEURE
      *                         OU ZERO SI PLUS DE GDD
      *          PR9 = POS ORIG DU DERNIER GDD DS BANALISE
      *      L INDICATEUR EXPLOSION DU TABLEAU DE GDD
      *      L INDICATEUR EXPLOSION DE LA ZONE BANALISE
      *
      *   VARIABLES DE TRAVAIL (CGS100-CGBFOHAK)
      *     NOMBRE MAXI DE GDD FOH POUR LE CONTROLE
      *     NOMBRE MAXI DE GDD FOH POUR LE STOCKAGE
      *     LITTERAL FOH
      *     LONGUEUR DE LA CLE FOH
      *     NOMBRE D'OCCURS POUR LIRE FOH EN L0H
      *   VARIABLES DE TRAVAIL (CGM?01-CGRFOHAK)
      *     NOMBRE D'OCCURS MAXIMUM DANS CGS?????
      *-----------------------------------------------------
           05 LS-CGLBFOHW.
      *--     10 LS-FOHH-PERS.
      *???       12 FOHH-PER OCCURS 5 INDEXED BY IX-FOHH-PER.
      *--        12 LS-FOHH-PER.
      *--           14 LS-FOHH-NDOMAT PIC S9(7) COMP-3.
      *--           14 LS-FOHH-RAIDMA PIC S9(3) COMP-3.
      *--           14 LS-FOHH-DEBBAN PIC S9(5) COMP-3.
      *--           14 LS-FOHH-FINBAN PIC S9(5) COMP-3.
      *
      *--           14 LS-FOHH-INDS OCCURS 2 INDEXED BY IX-FOHH-IND.
      *--              16 LS-FOHH-IND PIC 9.
      *
      *--           14 LS-FOHH-GDDS OCCURS 2 INDEXED BY IX-FOHH-GDD.
      *--              16 LS-FOHH-GDD PIC X(3).
      *--              16 LS-FOHH-PR0 PIC S9(5) COMP-3.
      *--              16 LS-FOHH-PR5 PIC S9(5) COMP-3.
      *--              16 LS-FOHH-PR9 PIC S9(5) COMP-3.
      *
      *--           14 LS-FOHH-EXP-GDD8 PIC X(3).
      *
      *--           14 LS-FOHH-EXP-GDD9 PIC X(3).
      *--           14 LS-FOHH-EXP-H9X.
      *--              16 LS-FOHH-EXP-H9 PIC S9(9) COMP-3.
      *
      *--    10 IX-FOHH-IND-MAX      PIC 99 VALUE 2.
      *--    10 IX-FOHH-GDD-MAX      PIC 99 VALUE 2.
      *
             10 LS-XXXH-FOHH PIC X(3) VALUE 'FOH'.
      *                              GDD 3 + DATDEB 5 + DATFIN 5 + 1
             10 LS-XXXH-FOHH-CLE PIC S9(3) COMP-3 VALUE 014.
             10 LS-XXXH-FOHH-OCC PIC 999.
      *
             10 LS-XXXH-FOHH-ZNOCCD-MAX PIC 99 VALUE 7.
      *---------------------------------------------------------------
      *                VERSION : V00310
      *
      * CHANTIER : 0110O     DéBUT : 08/07/1997     FIN : 01/09/1997
      *
      * TEXTE  : RECHERCHE DANS LA BANALISE
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03500
      *
      * Chantier : 2050H     Début : 29/08/2011     Fin : 29/08/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03510
      *
      * Chantier : 2050L     Début : 07/09/2011     Fin : 07/09/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03600
      *
      * Chantier : 2149T     Début : 28/11/2011     Fin : 28/11/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBFOSW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBFOSW.CPY"
      *-----------------------------------------------------
      *-----------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE FOS
      *   BLOC INDIRECTION POUR LES PERSONNES ET LES GDDS RELATIFS
      *   POUR CHAQUE PERSONNE
      *   LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *      RAIDMA = RANG DE LA FAMILLE AIDE-FAMILLE
      *      DEBBAN = POSITION DE DEBUT FOS DANS BANALISE
      *      FINBAN = POSITION DE FIN FOS DANS BANALISE
      *      LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *          CONTROLE DANS LE CGS100 SI PLUS DE 2 GDD
      *      LES INDICATEURS DE GDDS (*2 ARBITRAIRE)
      *          NOM DU GDD
      *          PR0 = POS ORIG DU 1 ER GDD DS BANALISE
      *          PR5 = POS ORIG DU GDD 31 M - 1
      *                    PUIS DU GDD ENCADRANT 31 M OU
      *                         DU GDD IMMEDIATEMENT SUPERIEURE
      *                         OU ZERO SI PLUS DE GDD
      *          PR9 = POS ORIG DU DERNIER GDD DS BANALISE
      *      L INDICATEUR EXPLOSION DU TABLEAU DE GDD
      *      L INDICATEUR EXPLOSION DE LA ZONE BANALISE
      *
      *   VARIABLES DE TRAVAIL (CGS100-CGBFOSAK)
      *     NOMBRE MAXI DE GDD FOS POUR LE CONTROLE
      *     NOMBRE MAXI DE GDD FOS POUR LE STOCKAGE
      *     LITTERAL FOS
      *     LONGUEUR DE LA CLE FOS
      *     NOMBRE D'OCCURS POUR LIRE FOS EN L0H
      *   VARIABLES DE TRAVAIL (CGM?01-CGRFOSAK)
      *     NOMBRE D'OCCURS MAXIMUM DANS CGS?????
      *-----------------------------------------------------
           05 LS-CGLBFOSW.
              10 LS-FOSH-PERS.
      *          12 FOSH-PER OCCURS 5 INDEXED BY IX-FOSH-PER.
      *          12 FOSH-PER.
                    14 LS-FOSH-NDOMAT PIC S9(7) COMP-3.
                    14 LS-FOSH-RAIDMA PIC S9(3) COMP-3.
                    14 LS-FOSH-DEBBAN PIC S9(5) COMP-3.
                    14 LS-FOSH-FINBAN PIC S9(5) COMP-3.
      *
                    14 LS-FOSH-INDS OCCURS 2 INDEXED BY IX-FOSH-IND.
                       16 LS-FOSH-IND PIC 9.
      *
                    14 LS-FOSH-GDDS OCCURS 2 INDEXED BY IX-FOSH-GDD.
                       16 LS-FOSH-GDD PIC X(3).
                       16 LS-FOSH-PR0 PIC S9(5) COMP-3.
                       16 LS-FOSH-PR5 PIC S9(5) COMP-3.
                       16 LS-FOSH-PR9 PIC S9(5) COMP-3.
      *
                    14 LS-FOSH-EXP-GDD8 PIC X(3).
      *
                    14 LS-FOSH-EXP-GDD9 PIC X(3).
                    14 LS-FOSH-EXP-H9X.
                       16 LS-FOSH-EXP-H9 PIC S9(9) COMP-3.
      *
      *---   10 IX-FOSH-IND-MAX      PIC S9(3) COMP-3 VALUE 2.
      *--    10 IX-FOSH-GDD-MAX      PIC S9(3) COMP-3 VALUE 2.
      *
             10 LS-XXXH-FOSH PIC X(3) VALUE 'FOS'.
      *                              GDD 3 + DATDEB 5 + DATFIN 5 + 1
             10 LS-XXXH-FOSH-CLE PIC S9(3) COMP-3 VALUE 014.
             10 LS-XXXH-FOSH-OCC PIC 999.
      *
             10 LS-XXXH-FOSH-ZNOCCD-MAX PIC 99 VALUE 7.
      *---------------------------------------------------------------
      *                VERSION : V00310
      *
      * CHANTIER : 00000     DéBUT : 01/09/1997     FIN : 01/09/1997
      *
      * TEXTE  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V00310
      *
      * CHANTIER : 0110O     DéBUT : 08/07/1997     FIN : 01/09/1997
      *
      * TEXTE  : RECHERCHE DANS LA BANALISE
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03600
      *
      * Chantier : 2050O     Début : 07/02/2012     Fin : 07/02/2012
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03800
      *
      * Chantier : 1R380     Début : 31/08/2012     Fin : 31/08/2012
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBLGHW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBLGHW.CPY"
      *-----------------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE LGH
      *   BLOC INDIRECTION POUR LES GDD RELATIFS
      *   DEBBAN = POSITION DE DEBUT LGH DANS BANALISE
      *   FINBAN = POSITION DE FIN LGH DANS BANALISE
      *   LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *       CONTROLE DANS LE CGS100 SI PLUS DE 40 GDD
      *   LES INDICATEURS DE GDDS (*12 ARBITRAIRE)
      *       NOM DU GDD
      *       PR0 = POS ORIG DU 1 ER GDD DS BANALISE
      *       PR5 = POS ORIG DU GDD 31 M - 1
      *                 PUIS DU GDD ENCADRANT 31 M OU
      *                      DU GDD IMMEDIATEMENT SUPERIEURE
      *                      OU ZERO SI PLUS DE GDD
      *       PR9 = POS ORIG DU DERNIER GDD DS BANALISE
      *   L INDICATEUR EXPLOSION DU TABLEAU DE GDD
      *   L INDICATEUR EXPLOSION DE LA ZONE BANALISE
      *
      *   VARIABLES DE TRAVAIL (CGS100-CGBLGHAK)
      *     NOMBRE MAXI DE GDD LGH POUR LE CONTROLE
      *     NOMBRE MAXI DE GDD LGH DE STOCKAGE
      *     LONGUEUR DE LA CLE LGH
      *     NOMBRE D'OCCURS POUR LIRE LGH EN L0H
      *   VARIABLES DE TRAVAIL (CGM?01-CGRLGHAK)
      *     NOMBRE D'OCCURS MAXIMUM DANS CGS10000
      *-----------------------------------------------------
           05 LS-CGLBLGHW.
              10 LS-LGHH-LOGS.
                12 LS-LGHH-LOG.
                   14 LS-LGHH-DEBBAN PIC S9(5) COMP-3.
                   14 LS-LGHH-FINBAN PIC S9(5) COMP-3.
      *
      *--          14 LS-LGHH-INDS OCCURS 18 INDEXED BY IX-LGHH-IND.
                   14 LS-LGHH-INDS OCCURS 20 INDEXED BY IX-LGHH-IND.
                      16 LS-LGHH-IND PIC 9.
      *
      *--          14 LS-LGHH-GDDS OCCURS 18 INDEXED BY IX-LGHH-GDD.
                   14 LS-LGHH-GDDS OCCURS 20 INDEXED BY IX-LGHH-GDD.
                      16 LS-LGHH-GDD PIC X(3).
                      16 LS-LGHH-PR0 PIC S9(5) COMP-3.
                      16 LS-LGHH-PR5 PIC S9(5) COMP-3.
                      16 LS-LGHH-PR9 PIC S9(5) COMP-3.
      *
                   14 LS-LGHH-EXP-GDD8 PIC X(3).
      *
                   14 LS-LGHH-EXP-GDD9 PIC X(3).
                   14 LS-LGHH-EXP-H9X.
                      16 LS-LGHH-EXP-H9 PIC S9(9) COMP-3.
      *
      *   VARIABLES DE TRAVAIL POUR LGH
      *
      *--     10 LS-IX-LGHH-IND-MAX-REF  PIC S9(3) COMP-3 VALUE 18.
              10 LS-IX-LGHH-IND-MAX-REF  PIC S9(3) COMP-3 VALUE 20.
              10 LS-IX-LGHH-IND-MAX      PIC S9(3) COMP-3.
      *--     10 IX-LGHH-GDD-MAX      PIC S9(3) COMP-3 VALUE 17.
      *--     10 LS-IX-LGHH-GDD-MAX   PIC S9(3) COMP-3 VALUE 18.
              10 LS-IX-LGHH-GDD-MAX   PIC S9(3) COMP-3 VALUE 20.
      *--                             GDD 3 + DATDEB 5 + DATFIN 5 + 1
              10 LS-LGHH-CLE PIC S9(3) COMP-3 VALUE 014.
              10 LS-LGHH-OCC PIC 999.
      * VARIABLE DE SAUVEGARDE AVANT INITIALISATION
      *--     10 LS-LGHH-WS-DEBBAN PIC S9(5) COMP-3.
      * INDICATEUR DE RUPTURE DE RANG
              10 LS-LGHH-FL-RLOGEM PIC 999.
      ********10 LGHH-LSBA-MAX PIC S9(4) COMP-3 VALUE 2000.
              10 LS-LGHH-LSBA-MAX PIC S9(5) COMP-3 VALUE +2000.
              10 LS-LGHH-LSBA-ORI PIC S9(5) COMP-3.
      *
      *   VARIABLES DE TRAVAIL (CGM?01-CGRLGHAK)
      *
              10 LS-LGHH-ZNOCCD-MAX PIC 99 VALUE 7.
      *---------------------------------------------------------------
      *                VERSION : V01201
      *
      * CHANTIER : 0041O     DéBUT : 07/04/1997     FIN : 09/06/1997
      *
      * TEXTE  : BUFFERISATION DU COMPTE - DMO041
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V00310
      *
      * CHANTIER : 0110O     DéBUT : 07/07/1997     FIN : 04/09/1997
      *
      * TEXTE  : SUITE DE LA DMO 041 - RECHERCHE EN BANALISé
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V00320
      *
      * CHANTIER : 0110C     DéBUT : 11/02/1998     FIN : 24/02/1998
      *
      * TEXTE  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V00320
      *
      * CHANTIER : 110C     DéBUT : 19/02/1998     FIN : 19/02/1998
      *
      * TEXTE  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V00530
      *
      * CHANTIER : 00410     DéBUT : 15/01/1999     FIN : 15/01/1999
      *
      * TEXTE  : SUPPRESSION PRéFIXE XXXH POUR GARDER LGHH OU LGHS
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V00530
      *
      * CHANTIER : O110C     DéBUT : 20/04/1999     FIN : 22/04/1999
      *
      * TEXTE  : NOUVELLE TABLE LOGEMENT (VERTICALE). MISE EN BANALISéE.
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V00720
      *
      * CHANTIER : 0904T     DéBUT : 14/03/2001     FIN : 14/03/2001
      *
      * TEXTE  : AUGMENTATION TAILLE RANG LOGEMENT
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V00930
      *
      * CHANTIER : H2697     DéBUT : 02/09/2002     FIN : 02/09/2002
      *
      * TEXTE  : AUGMENTAT°/TAILLE/ZONE BANALISéE DéDIéE AUX GDD/CDLGH P
      *          éVITER L'EXPLOSION DUE AU NOMBRE IMPORTANT / GDD 'MPL'
      *          DATE => 1 GDD/MOIS SUR TOUT L'HISTORIQUE) à STOCKER EN
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V02300
      *
      * CHANTIER : 1445A     DéBUT : 15/10/2007     FIN : 15/10/2007
      *
      * TEXTE  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *                VERSION : V03310
      *
      * CHANTIER : 1989E     DéBUT : 17/11/2010     FIN : 17/11/2010
      *
      * TEXTE  : A998.CCR1989E:REFONTE DU STOCKAGE DES INFORMATIONS
      *          IMPAYES HISTORIQUE
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04300
      *
      * Chantier : 2300J     Début : 22/04/2014     Fin : 22/04/2014
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBODEW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBODEW.CPY"
      *    SUPRESSION CGBODEAK ET CGRODEAK
           05 LS-CGLBODEW            PIC X.
      *---------------------------------------------------------------
      *                Version : V04000
      *
      * Chantier : 2273T     Début : 20/03/2013     Fin : 20/03/2013
      *
      * Texte  : normalisation des acces - appel lecture cdode par cgrta
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBPEHW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBPEHW.CPY"
      *-----------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE PEH
      *   INUTILE DEPUIS LA VERSION V03900
      *-----------------------------------------------------
           05 LS-CGLBPEHW   PIC X.
      *---------------------------------------------------------------
      *                Version : V04000
      *
      * Chantier : 1R400     Début : 04/03/2013     Fin : 04/03/2013
      *
      * Texte  : grand nettoyage
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBPEXW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBPEXW.CPY"
      *-----------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE PEX
      *   cgbpexak et cgrpexak supprimés
      *-----------------------------------------------------
           05 LS-CGLBPEXW               PIC X.
      *---------------------------------------------------------------
      *                Version : V04000
      *
      * Chantier : 2273T     Début : 15/03/2013     Fin : 15/03/2013
      *
      * Texte  : suppression cgbpexak et cgrpexak
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBPOMW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBPOMW.CPY"
      *-----------------------------------------------------
      *-----------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE POM
      *   BLOC INDIRECTION POUR LES PERSONNES ET LES GDDS RELATIFS
      *   POUR CHAQUE PERSONNE
      *   LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *      NFICPN = NUMERO FICTIF DE LA PERSONNE
      *      DEBBAN = POSITION DE DEBUT POM DANS BANALISE
      *      FINBAN = POSITION DE FIN POM DANS BANALISE
      *      LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *          CONTROLE DANS LE CGS100 SI PLUS DE 2 GDD
      *      LES INDICATEURS DE GDDS (*2 ARBITRAIRE)
      *          NOM DU GDD
      *          PR0 = POS ORIG DU 1 ER GDD DS BANALISE
      *          PR5 = POS ORIG DU GDD 31 M - 1
      *                    PUIS DU GDD ENCADRANT 31 M OU
      *                         DU GDD IMMEDIATEMENT SUPERIEURE
      *                         OU ZERO SI PLUS DE GDD
      *          PR9 = POS ORIG DU DERNIER GDD DS BANALISE
      *      L INDICATEUR EXPLOSION DU TABLEAU DE GDD
      *      L INDICATEUR EXPLOSION DE LA ZONE BANALISE
      *
      *   VARIABLES DE TRAVAIL (CGS100-CGBPOMAK)
      *     NOMBRE MAXI DE GDD POM POUR LE CONTROLE
      *     NOMBRE MAXI DE GDD POM POUR LE STOCKAGE
      *     LITTERAL POM
      *     LONGUEUR DE LA CLE POM
      *     NOMBRE D'OCCURS POUR LIRE POM EN L0H
      *   VARIABLES DE TRAVAIL (CGM?01-CGRPOMAK)
      *     NOMBRE D'OCCURS MAXIMUM DANS CGS?????
      *-----------------------------------------------------
           05 LS-CGLBPOMW.
              10 LS-POMH-PERS.
                 12 LS-POMH-PER OCCURS 27 INDEXED BY IX-POMH-PER.
                    14 LS-POMH-NFICPN PIC S9(7) COMP-3.
                    14 LS-POMH-DEBBAN PIC S9(5) COMP-3.
                    14 LS-POMH-FINBAN PIC S9(5) COMP-3.
      *
                    14 LS-POMH-INDS OCCURS 2 INDEXED BY IX-POMH-IND.
                       16 LS-POMH-IND PIC 9.
      *
                    14 LS-POMH-GDDS OCCURS 2 INDEXED BY IX-POMH-GDD.
                       16 LS-POMH-GDD PIC X(3).
                       16 LS-POMH-PR0 PIC S9(5) COMP-3.
                       16 LS-POMH-PR5 PIC S9(5) COMP-3.
                       16 LS-POMH-PR9 PIC S9(5) COMP-3.
      *
                    14 LS-POMH-EXP-GDD8 PIC X(3).
      *
                    14 LS-POMH-EXP-GDD9 PIC X(3).
                    14 LS-POMH-EXP-H9X.
                       16 LS-POMH-EXP-H9 PIC S9(9) COMP-3.
      *
      *--    10 IX-POMH-IND-MAX      PIC 99 VALUE 2.
      *--    10 IX-POMH-GDD-MAX      PIC 99 VALUE 2.
             10 LS-IX-POMH-GDD-MAX   PIC S9(3) COMP-3 VALUE 02.
      *
             10 LS-XXXH-POMH PIC X(3) VALUE 'POM'.
      *                              GDD 3 + DATDEB 5 + DATFIN 5 + 1
             10 LS-XXXH-POMH-CLE PIC S9(3) COMP-3 VALUE 014.
             10 LS-XXXH-POMH-OCC PIC 999.
      *
             10 LS-XXXH-POMH-ZNOCCD-MAX PIC 99 VALUE 7.
      *---------------------------------------------------------------
      *                VERSION : V00310
      *
      * CHANTIER : 0110O     DéBUT : 08/07/1997     FIN : 01/09/1997
      *
      * TEXTE  : RECHERCHE DANS LA BANALISE
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03800
      *
      * Chantier : 1R380     Début : 03/09/2012     Fin : 03/09/2012
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBRESW.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBRESW.CPY"
      *-----------------------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE DES RESSOURCES - CDREV
      *   BLOC INDIRECTION POUR LES PERSONNES ET LES GDDS RELATIFS
      *   POUR CHAQUE PERSONNE
      *   LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *      NFICPN = NUMERO FICTIF DE LA PERSONNE
      *      DEBBAN = POSITION DE DEBUT PER DANS BANALISE
      *      FINBAN = POSITION DE FIN PER DANS BANALISE
      *      LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *          CONTROLE DANS LE CGS100 SI PLUS DE 60 GDD
      *      LES INDICATEURS DE GDDS (*12 ARBITRAIRE)
      *          NOM DU GDD
      *          PR0 = POS ORIG DU 1 ER GDD DS BANALISE
      *          PR5 = POS ORIG DU GDD 31 M - 1
      *                    PUIS DU GDD ENCADRANT 31 M OU
      *                         DU GDD IMMEDIATEMENT SUPERIEUR
      *                         OU ZERO SI PLUS DE GDD
      *          PR9 = POS ORIG DU DERNIER GDD DS BANALISE
      *      L INDICATEUR EXPLOSION DU TABLEAU DE GDD
      *      L INDICATEUR EXPLOSION DE LA ZONE BANALISE
      *
      *   VARIABLES DE TRAVAIL (CGS100-CGBRESAK)
      *     NOMBRE MAXI DE GDD DE CDRES POUR LE CONTROLE
      *     NOMBRE MAXI DE GDD DE CDRES POUR LE STOCKAGE
      *     LONGUEUR DE LA CLE DE CDRES
      *     NOMBRE D'OCCURS POUR LIRE CDRES EN L0H
      *   VARIABLES DE TRAVAIL (CGM?01-CGRRESAK)
      *
      *-----------------------------------------------------------------
           05 LS-CGLBRESW.
      *---    STOCKAGE RES BANALISéE ENTRéE = RESE
              10 LS-RESE-PERS.
                 12 LS-RESE-PER OCCURS 27 INDEXED BY IX-RESE-PER.
                    14 LS-RESE-NFICPN PIC S9(7) COMP-3.
                    14 LS-RESE-DEBBAN PIC S9(5) COMP-3.
                    14 LS-RESE-FINBAN PIC S9(5) COMP-3.
      *
                    14 LS-RESE-INDS OCCURS 05 INDEXED BY IX-RESE-IND.
                       16 LS-RESE-IND PIC 9.
      *
                    14 LS-RESE-GDDS OCCURS 05 INDEXED BY IX-RESE-GDD.
                       16 LS-RESE-GDD PIC X(3).
                       16 LS-RESE-PR0 PIC S9(5) COMP-3.
                       16 LS-RESE-PR5 PIC S9(5) COMP-3.
                       16 LS-RESE-PR9 PIC S9(5) COMP-3.
      *
                    14 LS-RESE-EXP-GDD8 PIC X(3).
      *
                    14 LS-RESE-EXP-GDD9 PIC X(3).
                    14 LS-RESE-EXP-H9X.
                       16 LS-RESE-EXP-H9 PIC S9(9) COMP-3.
      *
             10 IX-RESE-IND-MAX-REF  PIC S9(3) COMP-3 VALUE 5.
             10 IX-RESE-IND-MAX      PIC S9(3) COMP-3.
             10 IX-RESE-GDD-MAX      PIC S9(3) COMP-3 VALUE 5.
      *                              GDD 3 + DATDEB 5 + DATFIN 5 + 1
             10 LS-RESE-CLE PIC S9(3) COMP-3 VALUE 014.
             10 LS-RESE-OCC PIC 999.
      *
             10 LS-RESE-ZNOCCD-MAX PIC 99 VALUE 5.
      *
      *---    STOCKAGE RES BANALISéE SORTIE = RESS
              10 LS-RESS-PERS.
                 12 LS-RESS-PER OCCURS 27 INDEXED BY IX-RESS-PER.
                    14 LS-RESS-NFICPN PIC S9(7) COMP-3.
                    14 LS-RESS-DEBBAN PIC S9(5) COMP-3.
                    14 LS-RESS-FINBAN PIC S9(5) COMP-3.
      *
                    14 LS-RESS-INDS OCCURS 05 INDEXED BY IX-RESS-IND.
                       16 LS-RESS-IND PIC 9.
      *
                    14 LS-RESS-GDDS OCCURS 5 INDEXED BY IX-RESS-GDD.
                       16 LS-RESS-GDD PIC X(3).
                       16 LS-RESS-PR0 PIC S9(5) COMP-3.
                       16 LS-RESS-PR5 PIC S9(5) COMP-3.
                       16 LS-RESS-PR9 PIC S9(5) COMP-3.
      *
                    14 LS-RESS-EXP-GDD8 PIC X(3).
      *
                    14 LS-RESS-EXP-GDD9 PIC X(3).
                    14 LS-RESS-EXP-H9X.
                       16 LS-RESS-EXP-H9 PIC S9(9) COMP-3.
                  12 LS-RESS-GDDS-MAJ PIC X(3).
                    88 RESS-GDD-MAJ    VALUE 'EVA'.
                    88 RESS-GDD-MAJ-DE VALUE 'EVA'.
      *
             10 IX-RESS-GDD-MAX      PIC S9(3) COMP-3 VALUE 5.
      *
             10 LS-RESS-ZNOCCD-MAX PIC 99 VALUE 7.
      *---
      *---   MISE EN BANALISEE DE LA TABLE PER RES
      *---   STOCKAGE EN VERTICAL PAR OCCURENCE
      *---   OPTION DECLARATION D' UNE NOUVELLE ZONE DE STOCKAGE
      *---   POUR EVITER DES VERRUES ET DES PROBLEMES  POUR LA
      *---   TABLE PER EVA
      *---   EN AJOUT DERRIERE LES NOMS DE DONNEES -N (NOUVEAU)
      *---   STOCKAGE RES BANALISéE ENTRéE = RESE
      *---
             10 LS-RESE-PERS-N.
                12 LS-RESE-PER-N OCCURS 27 INDEXED BY IX-RESE-PER-N.
                   14 LS-RESE-NFICPN-N PIC S9(7) COMP-3.
                   14 LS-RESE-DEBBAN-N PIC S9(5) COMP-3.
                   14 LS-RESE-FINBAN-N PIC S9(5) COMP-3.
      *
                   14 LS-RESE-IND-N PIC 9.
      *
                   14 LS-RESE-GDDS-N.
                      16 LS-RESE-GDD-N PIC X(3).
                      16 LS-RESE-PR0-N PIC S9(5) COMP-3.
                      16 LS-RESE-PR5-N PIC S9(5) COMP-3.
                      16 LS-RESE-PR9-N PIC S9(5) COMP-3.
      *
                   14 LS-RESE-EXP-GDD8-N PIC X(3).
      *
                   14 LS-RESE-EXP-GDD9-N PIC X(3).
                   14 LS-RESE-EXP-H9X-N.
                      16 LS-RESE-EXP-H9-N PIC S9(9) COMP-3.
      *
      *---      GDD-RES
             10 LS-RESE-GDD-LNG-N.
                14 LS-RESE-LG-CDRESH0 PIC S9(3) COMP-3.
                14 LS-RESE-LG-CDRESH1 PIC S9(3) COMP-3.
                14 LS-RESE-LG-CDRESRE1 PIC S9(3) COMP-3.
                14 LS-RESE-LG-CDRESRE2 PIC S9(3) COMP-3.
                14 LS-RESE-LG-PARTIE2 PIC S9(3) COMP-3.
                14 LS-RESE-LG-OCC-BANAL PIC S9(3) COMP-3.
             10 IX-RESE-IND-MAX-REF-N   PIC S9(3) COMP-3 VALUE 5.
      ****   10 IX-RESE-GDD-MAX-N       PIC S9(3) COMP-3 VALUE 3.
      *                              GDD 3 + DATDEB 5 + DATFIN 5 + 1
             10 LS-RESE-CLE-N PIC S9(3) COMP-3 VALUE 014.
             10 LS-RESE-OCC-N PIC 999.
      *
             10 LS-RESE-ZNOCCD-MAX-N PIC 99 VALUE 5.
      *
      *
             10 LS-RESE-DMCDOS-MOIN5ANS PIC S9(9) COMP-3.
      ***    10 IX-RESS-IND-MAX-REF-N   PIC 99 VALUE 3.
      ***    10 IX-RESS-IND-MAX-N       PIC 99.
      ***    10 IX-RESS-GDD-MAX-N       PIC 99 VALUE 3.
      *                              GDD 3 + DATDEB 5 + DATFIN 5 + 1
             10 LS-RESS-CLE-N PIC S9(3) COMP-3 VALUE 014.
             10 LS-RESS-OCC-N PIC 999.
      *
             10 LS-RESE-ZNOCCD-MAX-N PIC 99 VALUE 7.
             10 LS-RESE-E-ACCES-GDD-RES.
               15 LS-RESE-ENTREE.
                 20 LS-RESE-E-NFICPN-N PIC S9(7) COMP-3.
                 20 LS-RESE-E-CPTRSA-N PIC X(1).
                 20 LS-RESE-E-CIDGDD-N PIC X(3).
                 20 LS-RESE-E-CDHIS001-N PIC S9(9) COMP-3.
                 20 LS-RESE-E-CDHIS002-N PIC S9(9) COMP-3.
                 20 LS-RESE-E-NETIMA PIC S9(1) COMP-3.
      *---------------------------------------------------------------
      *                Version : V04400
      *
      * Chantier : 2365E     Début : 04/09/2014     Fin : 05/09/2014
      *
      * Texte  : Problème de maximums de tableaux banalisées CDRESH
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLBSP1W.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLBSP1W.CPY"
      *-----------------------------------------------------
      *-----------------------------------------------------
      *   TABLEAU DIRECTEUR POUR LA TABLE SP1
      *   BLOC INDIRECTION POUR LES GRPE DE PREST ET GDDS RELATIFS
      *   POUR CHAQUE GROUPE DE PRESTATION
      *   LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *      RAIDMA = RANG DE LA FAMILLE AIDE-FAMILLE
      *      DEBBAN = POSITION DE DEBUT SP1 DANS BANALISE
      *      FINBAN = POSITION DE FIN SP1 DANS BANALISE
      *      LES INDICATEURS DE PRESENCE OU ABSENCE PAR GDD
      *          CONTROLE DANS LE CGS100 SI PLUS DE 2 GDD
      *      LES INDICATEURS DE GDDS (*2 ARBITRAIRE)
      *          NOM DU GDD
      *          PR0 = POS ORIG DU 1 ER GDD DS BANALISE
      *          PR5 = POS ORIG DU GDD 31 M - 1
      *                    PUIS DU GDD ENCADRANT 31 M OU
      *                         DU GDD IMMEDIATEMENT SUPERIEURE
      *                         OU ZERO SI PLUS DE GDD
      *          PR9 = POS ORIG DU DERNIER GDD DS BANALISE
      *      L INDICATEUR EXPLOSION DU TABLEAU DE GDD
      *      L INDICATEUR EXPLOSION DE LA ZONE BANALISE
      *
      *   VARIABLES DE TRAVAIL (CGS100-CGBSP1AK)
      *     NOMBRE MAXI DE GDD SP1 POUR LE CONTROLE
      *     NOMBRE MAXI DE GDD SP1 POUR LE STOCKAGE
      *     LITTERAL SP1
      *     LONGUEUR DE LA CLE SP1
      *     NOMBRE D'OCCURS POUR LIRE SP1 EN L0H
      *   VARIABLES DE TRAVAIL (CGM?01-CGRSP1AK)
      *     NOMBRE D'OCCURS MAXIMUM DANS CGS?????
      *-----------------------------------------------------
           05 LS-CGLBSP1W.
              10 LS-SP1H-SPFS.
                 12 LS-SP1H-SPF.
                    14 LS-SP1H-NDOMAT PIC S9(7) COMP-3.
                    14 LS-SP1H-CGRPPF PIC X(3).
                    14 LS-SP1H-DEBBAN PIC S9(5) COMP-3.
                    14 LS-SP1H-FINBAN PIC S9(5) COMP-3.
      *
                    14 LS-SP1H-INDS OCCURS 2 INDEXED BY IX-SP1H-IND.
                       16 LS-SP1H-IND PIC 9.
      *
                    14 LS-SP1H-GDDS OCCURS 2 INDEXED BY IX-SP1H-GDD.
                       16 LS-SP1H-GDD PIC X(3).
                       16 LS-SP1H-PR0 PIC S9(5) COMP-3.
                       16 LS-SP1H-PR5 PIC S9(5) COMP-3.
                       16 LS-SP1H-PR9 PIC S9(5) COMP-3.
      *
                    14 LS-SP1H-EXP-GDD8 PIC X(3).
      *
                    14 LS-SP1H-EXP-GDD9 PIC X(3).
                    14 LS-SP1H-EXP-H9X.
                       16 LS-SP1H-EXP-H9 PIC S9(9) COMP-3.
      *
             10 LS-IX-SP1H-IND-MAX      PIC 99 VALUE 2.
             10 LS-SP1H-GDD-MAX      PIC 99 VALUE 2.
      *
             10 LS-XXXH-SP1H PIC X(3) VALUE 'SP1'.
      *                              GDD 3 + DATDEB 5 + DATFIN 5 + 1
             10 LS-XXXH-SP1H-CLE PIC S9(3) COMP-3 VALUE 017.
             10 LS-XXXH-SP1H-OCC PIC 999.
      *
             10 LS-SP1H-ZNOCCD-MAX PIC 99 VALUE 7.
      *---------------------------------------------------------------
      *                VERSION : V03310
      *
      * CHANTIER : 1R331     DéBUT : 17/11/2010     FIN : 17/11/2010
      *
      * TEXTE  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03500
      *
      * Chantier : 2050H     Début : 22/08/2011     Fin : 22/08/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLKMO.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLKMO.CPY"
      *****************************************************************
      *                                                               *
      *   COPYBOOK NAME  : CGLKMO                                     *
      *                                                               *
      *   COPYBOOK DESC  : LK OPERATION ACCES STANDA                  *
      *                                                               *
      *   GENERATION DATE: 06/21/17                                   *
      *              TIME: 11:17:54                                   *
      *****************************************************************
         05 LKMO-RECORD.
           08 LKMO-DOSSIER-TRAITE.
             11 LKMO-PERSONNES-PRESENTES.
               14 LKMO-ENFANTS-PRESENT.
               17 LKMO-ENFP-IBAN032
                            OCCURS 027 TIMES
                            INDEXED BY IX-ENFP   PIC S9(3) COMP-3.
               14 LKMO-AUT-PERSONNE-PRESENT.
               17 LKMO-AUTP-IBAN032
                            OCCURS 027 TIMES
                            INDEXED BY IX-AUTP   PIC S9(3) COMP-3.
               14 LKMO-MRMME-PRESENT.
               17 LKMO-MMEP-IBAN032
                            OCCURS 002 TIMES
                            INDEXED BY IX-MMEP   PIC S9(3) COMP-3.
               14 LKMO-MRMME-PRESRES.
               17 LKMO-MMER-IBAN032
                            OCCURS 002 TIMES
                            INDEXED BY IX-MMER   PIC S9(3) COMP-3.
             11 LKMO-COMPOSITION.
               14 LKMO-INDICE-DES-ENFANTS.
               17 LKMO-ENF-IBAN032
                            OCCURS 027 TIMES
                            INDEXED BY IX-ENF    PIC S9(3) COMP-3.
               14 LKMO-INDICE-AUT-PERSONNE.
               17 LKMO-AUT-IBAN032
                            OCCURS 027 TIMES
                            INDEXED BY IX-AUT    PIC S9(3) COMP-3.
               14 LKMO-INDICE-DES-MRMME.
               17 LKMO-MME-IBAN032
                            OCCURS 027 TIMES
                            INDEXED BY IX-MME    PIC S9(3) COMP-3.
               14 LKMO-PERS-COMP-DOSS
                            OCCURS 027 TIMES
                            INDEXED BY IX-PER.
               17 LKMO-NFICPN                    PIC S9(7) COMP-3.
               17 LKMO-CGDP0CDP
                            OCCURS 026 TIMES
                            INDEXED BY IX-GDD.
               20 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               20 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               20 LKMO-CDDP0CDP.
               23 LKMO-CTYPER                    PIC X(3).
                 88 LKMO-FL-MR-FAMI-PET            VALUE 'MON'.
                 88 LKMO-FL-MME-FAMI-PET           VALUE 'MME'.
                 88 LKMO-FL-ENF-PET                VALUE 'ENF'.
                 88 LKMO-FL-AUTR-PERS-PET          VALUE 'AUT'.
             11 LKMO-PERSONNES-DU-DOSSIER.
               14 LKMO-DETAIL-PERSONNE
                            OCCURS 027 TIMES
                            INDEXED BY IX-PE0.
               17 LKMO-CDPEIS1.
               20 LKMO-CDPEIZZZ.
               23 LKMO-LNPAPN                    PIC X(63).
               23 LKMO-LNOUSA                    PIC X(28).
               23 LKMO-LISPRE                    PIC X(50).
               23 LKMO-LPRENM                    PIC X(32).
               23 LKMO-CQUAPN                    PIC X(3).
                 88 LKMO-FL-MR-PER                 VALUE 'MR '.
                 88 LKMO-FL-MME-PER                VALUE 'MME'.
                 88 LKMO-FL-MLE-PER                VALUE 'MLE'.
               23 LKMO-CDSEXE                    PIC X(1).
                 88 LKMO-FL-CDSEXE-F               VALUE 'F'.
                 88 LKMO-FL-CDSEXE-M               VALUE 'M'.
               23 LKMO-DNAIPN                    PIC S9(9) COMP-3.
               23 LKMO-RNAISE                    PIC S9(1) COMP-3.
               23 LKMO-DDECPN                    PIC S9(9) COMP-3.
               23 LKMO-CCERDC                    PIC X(1).
                 88 LKMO-FL-CCERDC-1               VALUE '1'.
                 88 LKMO-FL-CCERDC-2               VALUE '2'.
                 88 LKMO-FL-CCERDC-3               VALUE '3'.
                 88 LKMO-FL-CCERDC-4               VALUE '4'.
                 88 LKMO-FL-CCERDC-5               VALUE '5'.
                 88 LKMO-FL-CCERDC-6               VALUE '6'.
                 88 LKMO-FL-CCERDC-7               VALUE '7'.
                 88 LKMO-FL-CCERDC-8               VALUE '8'.
                 88 LKMO-FL-CCERDC-9               VALUE '9'.
               23 LKMO-NIRNIR                    PIC X(15).
               23 LKMO-DRENIR                    PIC S9(9) COMP-3.
               23 LKMO-CVANIR                    PIC X(1).
                 88 LKMO-FL-PAS-INTG-DU-SNGI       VALUE '0'.
                 88 LKMO-FL-SNGI-INTG              VALUE '1'.
                 88 LKMO-FL-NIR-VALD               VALUE '2'.
                 88 LKMO-FL-NO-SNGI-NIR-INCO       VALUE '3'.
                 88 LKMO-FL-NO-SNGI-NIR-CONU       VALUE '4'.
                 88 LKMO-FL-DERE-SNGI-NINC         VALUE '5'.
                 88 LKMO-FL-CVANIR-6               VALUE '6'.
               23 LKMO-DOBNIR                    PIC S9(9) COMP-3.
               23 LKMO-CCSNGI                    PIC X(1).
                 88 LKMO-FL-CCSNGI-0               VALUE '0'.
                 88 LKMO-FL-CCSNGI-1               VALUE '1'.
                 88 LKMO-FL-CCSNGI-2               VALUE '2'.
                 88 LKMO-FL-CCSNGI-3               VALUE '3'.
                 88 LKMO-FL-CCSNGI-4               VALUE '4'.
                 88 LKMO-FL-CCSNGI-5               VALUE '5'.
                 88 LKMO-FL-CCSNGI-6               VALUE '6'.
                 88 LKMO-FL-CCSNGI-7               VALUE '7'.
               23 LKMO-LNOUSN                    PIC X(54).
               23 LKMO-LPRUSN                    PIC X(32).
               23 LKMO-DNAISN                    PIC X(8).
               23 LKMO-CORIDE                    PIC X(1).
                 88 LKMO-FL-CORIDE-G               VALUE 'G'.
                 88 LKMO-FL-CORIDE-R               VALUE 'R'.
                 88 LKMO-FL-CORIDE-S               VALUE 'S'.
               23 LKMO-CLIEUN                    PIC X(2).
                 88 LKMO-FL-CLIEUN-01              VALUE '01'.
                 88 LKMO-FL-CLIEUN-02              VALUE '02'.
                 88 LKMO-FL-CLIEUN-03              VALUE '03'.
                 88 LKMO-FL-CLIEUN-04              VALUE '04'.
                 88 LKMO-FL-CLIEUN-05              VALUE '05'.
                 88 LKMO-FL-CLIEUN-06              VALUE '06'.
                 88 LKMO-FL-CLIEUN-07              VALUE '07'.
                 88 LKMO-FL-CLIEUN-08              VALUE '08'.
                 88 LKMO-FL-CLIEUN-09              VALUE '09'.
                 88 LKMO-FL-CLIEUN-10              VALUE '10'.
                 88 LKMO-FL-CLIEUN-11              VALUE '11'.
                 88 LKMO-FL-CLIEUN-12              VALUE '12'.
                 88 LKMO-FL-CLIEUN-13              VALUE '13'.
                 88 LKMO-FL-CLIEUN-14              VALUE '14'.
                 88 LKMO-FL-CLIEUN-15              VALUE '15'.
                 88 LKMO-FL-CLIEUN-16              VALUE '16'.
                 88 LKMO-FL-CLIEUN-17              VALUE '17'.
                 88 LKMO-FL-CLIEUN-18              VALUE '18'.
                 88 LKMO-FL-CLIEUN-19              VALUE '19'.
                 88 LKMO-FL-CLIEUN-20              VALUE '20'.
                 88 LKMO-FL-CLIEUN-2A              VALUE '2A'.
                 88 LKMO-FL-CLIEUN-2B              VALUE '2B'.
                 88 LKMO-FL-CLIEUN-21              VALUE '21'.
                 88 LKMO-FL-CLIEUN-22              VALUE '22'.
                 88 LKMO-FL-CLIEUN-23              VALUE '23'.
                 88 LKMO-FL-CLIEUN-24              VALUE '24'.
                 88 LKMO-FL-CLIEUN-25              VALUE '25'.
                 88 LKMO-FL-CLIEUN-26              VALUE '26'.
                 88 LKMO-FL-CLIEUN-27              VALUE '27'.
                 88 LKMO-FL-CLIEUN-28              VALUE '28'.
                 88 LKMO-FL-CLIEUN-29              VALUE '29'.
                 88 LKMO-FL-CLIEUN-30              VALUE '30'.
                 88 LKMO-FL-CLIEUN-31              VALUE '31'.
                 88 LKMO-FL-CLIEUN-32              VALUE '32'.
                 88 LKMO-FL-CLIEUN-33              VALUE '33'.
                 88 LKMO-FL-CLIEUN-34              VALUE '34'.
                 88 LKMO-FL-CLIEUN-35              VALUE '35'.
                 88 LKMO-FL-CLIEUN-36              VALUE '36'.
                 88 LKMO-FL-CLIEUN-37              VALUE '37'.
                 88 LKMO-FL-CLIEUN-38              VALUE '38'.
                 88 LKMO-FL-CLIEUN-39              VALUE '39'.
                 88 LKMO-FL-CLIEUN-40              VALUE '40'.
                 88 LKMO-FL-CLIEUN-41              VALUE '41'.
                 88 LKMO-FL-CLIEUN-42              VALUE '42'.
                 88 LKMO-FL-CLIEUN-43              VALUE '43'.
                 88 LKMO-FL-CLIEUN-44              VALUE '44'.
                 88 LKMO-FL-CLIEUN-45              VALUE '45'.
                 88 LKMO-FL-CLIEUN-46              VALUE '46'.
                 88 LKMO-FL-CLIEUN-47              VALUE '47'.
                 88 LKMO-FL-CLIEUN-48              VALUE '48'.
                 88 LKMO-FL-CLIEUN-49              VALUE '49'.
                 88 LKMO-FL-CLIEUN-50              VALUE '50'.
                 88 LKMO-FL-CLIEUN-51              VALUE '51'.
                 88 LKMO-FL-CLIEUN-52              VALUE '52'.
                 88 LKMO-FL-CLIEUN-53              VALUE '53'.
                 88 LKMO-FL-CLIEUN-54              VALUE '54'.
                 88 LKMO-FL-CLIEUN-55              VALUE '55'.
                 88 LKMO-FL-CLIEUN-56              VALUE '56'.
                 88 LKMO-FL-CLIEUN-57              VALUE '57'.
                 88 LKMO-FL-CLIEUN-58              VALUE '58'.
                 88 LKMO-FL-CLIEUN-59              VALUE '59'.
                 88 LKMO-FL-CLIEUN-60              VALUE '60'.
                 88 LKMO-FL-CLIEUN-61              VALUE '61'.
                 88 LKMO-FL-CLIEUN-62              VALUE '62'.
                 88 LKMO-FL-CLIEUN-63              VALUE '63'.
                 88 LKMO-FL-CLIEUN-64              VALUE '64'.
                 88 LKMO-FL-CLIEUN-65              VALUE '65'.
                 88 LKMO-FL-CLIEUN-66              VALUE '66'.
                 88 LKMO-FL-CLIEUN-67              VALUE '67'.
                 88 LKMO-FL-CLIEUN-68              VALUE '68'.
                 88 LKMO-FL-CLIEUN-69              VALUE '69'.
                 88 LKMO-FL-CLIEUN-70              VALUE '70'.
                 88 LKMO-FL-CLIEUN-71              VALUE '71'.
                 88 LKMO-FL-CLIEUN-72              VALUE '72'.
                 88 LKMO-FL-CLIEUN-73              VALUE '73'.
                 88 LKMO-FL-CLIEUN-74              VALUE '74'.
                 88 LKMO-FL-CLIEUN-75              VALUE '75'.
                 88 LKMO-FL-CLIEUN-76              VALUE '76'.
                 88 LKMO-FL-CLIEUN-77              VALUE '77'.
                 88 LKMO-FL-CLIEUN-78              VALUE '78'.
                 88 LKMO-FL-CLIEUN-79              VALUE '79'.
                 88 LKMO-FL-CLIEUN-80              VALUE '80'.
                 88 LKMO-FL-CLIEUN-81              VALUE '81'.
                 88 LKMO-FL-CLIEUN-82              VALUE '82'.
                 88 LKMO-FL-CLIEUN-83              VALUE '83'.
                 88 LKMO-FL-CLIEUN-84              VALUE '84'.
                 88 LKMO-FL-CLIEUN-85              VALUE '85'.
                 88 LKMO-FL-CLIEUN-86              VALUE '86'.
                 88 LKMO-FL-CLIEUN-87              VALUE '87'.
                 88 LKMO-FL-CLIEUN-88              VALUE '88'.
                 88 LKMO-FL-CLIEUN-89              VALUE '89'.
                 88 LKMO-FL-CLIEUN-90              VALUE '90'.
                 88 LKMO-FL-CLIEUN-91              VALUE '91'.
                 88 LKMO-FL-CLIEUN-92              VALUE '92'.
                 88 LKMO-FL-CLIEUN-93              VALUE '93'.
                 88 LKMO-FL-CLIEUN-94              VALUE '94'.
                 88 LKMO-FL-CLIEUN-95              VALUE '95'.
                 88 LKMO-FL-CLIEUN-97              VALUE '97'.
                 88 LKMO-FL-CLIEUN-98              VALUE '98'.
                 88 LKMO-FL-CLIEUN-99              VALUE '99'.
               23 LKMO-LLOCNA                    PIC X(40).
               23 LKMO-CDTOMN                    PIC X(3).
                 88 LKMO-FL-CDTOMN-971             VALUE '971'.
                 88 LKMO-FL-CDTOMN-972             VALUE '972'.
                 88 LKMO-FL-CDTOMN-973             VALUE '973'.
                 88 LKMO-FL-CDTOMN-974             VALUE '974'.
                 88 LKMO-FL-CDTOMN-975             VALUE '975'.
                 88 LKMO-FL-CDTOMN-976             VALUE '976'.
                 88 LKMO-FL-CDTOMN-977             VALUE '977'.
                 88 LKMO-FL-CDTOMN-978             VALUE '978'.
                 88 LKMO-FL-CDTOMN-984             VALUE '984'.
                 88 LKMO-FL-CDTOMN-985             VALUE '985'.
                 88 LKMO-FL-CDTOMN-986             VALUE '986'.
                 88 LKMO-FL-CDTOMN-987             VALUE '987'.
                 88 LKMO-FL-CDTOMN-988             VALUE '988'.
                 88 LKMO-FL-CDTOMN-989             VALUE '989'.
               23 LKMO-LPAYNA                    PIC X(40).
               23 LKMO-DAAVPF                    PIC S9(9) COMP-3.
               23 LKMO-DAESMA                    PIC S9(9) COMP-3.
               23 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               23 LKMO-M05AAH                    PIC S9(5)V9(2) COMP-3.
               23 LKMO-M06AAH                    PIC S9(5)V9(2) COMP-3.
               23 LKMO-DDADES                    PIC S9(9) COMP-3.
               23 LKMO-DSTFLU                    PIC S9(9) COMP-3.
               23 LKMO-FSTFLU                    PIC S9(9) COMP-3.
               23 LKMO-CDRVI001                  PIC X(3).
               23 LKMO-CNAREF                    PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF          VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF          VALUE 'M'.
               23 LKMO-NREFER                    PIC S9(7) COMP-3.
               23 LKMO-CDRAPE                    PIC X(1).
               23 LKMO-NIDASS                    PIC X(8).
               23 LKMO-NAGDRE                    PIC X(10).
               23 LKMO-NDUPLI                    PIC S9(3) COMP-3.
               23 LKMO-CFORAF                    PIC X(1).
               23 LKMO-NPSCMG                    PIC X(14).
               23 LKMO-NDRSAL                    PIC X(15).
               23 LKMO-DETDED                    PIC S9(9) COMP-3.
               23 LKMO-CNAREF1                   PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF1         VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF1         VALUE 'M'.
               23 LKMO-NREFER1                   PIC S9(7) COMP-3.
               23 LKMO-CNAISP                    PIC X(1).
                 88 LKMO-FL-CNAISP-O               VALUE 'O'.
                 88 LKMO-FL-CNAISP-N               VALUE 'N'.
                 88 LKMO-FL-CNAISP-J               VALUE 'J'.
               23 LKMO-LPREN2                    PIC X(15).
               23 LKMO-LPREN3                    PIC X(15).
               23 LKMO-LCONAI                    PIC X(26).
               23 LKMO-NORIMM                    PIC S9(5) COMP-3.
               23 LKMO-DTRSDI                    PIC S9(9) COMP-3.
               23 LKMO-CORGNA                    PIC X(4).
               23 LKMO-CODRNC                    PIC X(4).
               23 LKMO-CNIR20                    PIC X(1).
                 88 LKMO-FL-CNIR20-E               VALUE 'E'.
                 88 LKMO-FL-CNIR20-A               VALUE 'A'.
                 88 LKMO-FL-CNIR20-P               VALUE 'P'.
               23 LKMO-DOBNIA                    PIC S9(9) COMP-3.
               23 LKMO-CNAREF2                   PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF2         VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF2         VALUE 'M'.
               23 LKMO-NREFER2                   PIC S9(7) COMP-3.
               17 LKMO-CGPEH1
                            OCCURS 003 TIMES
                            INDEXED BY IX-OCP.
               20 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               20 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               20 LKMO-CGPEHIND.
               23 LKMO-INDAAH                    PIC 9(1).
               23 LKMO-INDABM                    PIC 9(1).
               23 LKMO-INDABP                    PIC 9(1).
               23 LKMO-INDABS                    PIC 9(1).
               23 LKMO-INDACC                    PIC 9(1).
               23 LKMO-INDACE                    PIC 9(1).
               23 LKMO-INDACH                    PIC 9(1).
               23 LKMO-INDAES                    PIC 9(1).
               23 LKMO-INDAFE                    PIC 9(1).
               23 LKMO-INDAGE                    PIC 9(1).
               23 LKMO-INDAPC                    PIC 9(1).
               23 LKMO-INDAPH                    PIC 9(1).
               23 LKMO-INDARS                    PIC 9(1).
               23 LKMO-INDAVM                    PIC 9(1).
               23 LKMO-INDBEP                    PIC 9(1).
               23 LKMO-INDCAP                    PIC 9(1).
               23 LKMO-INDCIB                    PIC 9(1).
               23 LKMO-INDCOT                    PIC 9(1).
               23 LKMO-INDCOV                    PIC 9(1).
               23 LKMO-INDCRA                    PIC 9(1).
               23 LKMO-INDCRE                    PIC 9(1).
               23 LKMO-INDCRM                    PIC 9(1).
               23 LKMO-INDCTS                    PIC 9(1).
               23 LKMO-INDDAE                    PIC 9(1).
               23 LKMO-INDDAP                    PIC 9(1).
               23 LKMO-INDDAR                    PIC 9(1).
               23 LKMO-INDDDA                    PIC 9(1).
               23 LKMO-INDDDI                    PIC 9(1).
               23 LKMO-INDDER                    PIC 9(1).
               23 LKMO-INDDPE                    PIC 9(1).
               23 LKMO-INDDPO                    PIC 9(1).
               23 LKMO-INDDRJ                    PIC 9(1).
               23 LKMO-INDEAA                    PIC 9(1).
               23 LKMO-INDEBO                    PIC 9(1).
               23 LKMO-INDHAH                    PIC 9(1).
               23 LKMO-INDHMI                    PIC 9(1).
               23 LKMO-INDHOS                    PIC 9(1).
               23 LKMO-INDHRA                    PIC 9(1).
               23 LKMO-INDIAG                    PIC 9(1).
               23 LKMO-INDICE                    PIC 9(1).
               23 LKMO-INDINC                    PIC 9(1).
               23 LKMO-INDINV                    PIC 9(1).
               23 LKMO-INDJUE                    PIC 9(1).
               23 LKMO-INDLAF                    PIC 9(1).
               23 LKMO-INDLIM                    PIC 9(1).
               23 LKMO-INDLIP                    PIC 9(1).
               23 LKMO-INDMGA                    PIC 9(1).
               23 LKMO-INDMGG                    PIC 9(1).
               23 LKMO-INDMRP                    PIC 9(1).
               23 LKMO-INDNAA                    PIC 9(1).
               23 LKMO-INDOAH                    PIC 9(1).
               23 LKMO-INDOES                    PIC 9(1).
               23 LKMO-INDPAC                    PIC 9(1).
               23 LKMO-INDPAH                    PIC 9(1).
               23 LKMO-INDPEN                    PIC 9(1).
               23 LKMO-INDRAA                    PIC 9(1).
               23 LKMO-INDRAL                    PIC 9(1).
               23 LKMO-INDRAT                    PIC 9(1).
               23 LKMO-INDRD0                    PIC 9(1).
               23 LKMO-INDRSD                    PIC 9(1).
               23 LKMO-INDSAI                    PIC 9(1).
               23 LKMO-INDSEJ                    PIC 9(1).
               23 LKMO-INDSRP                    PIC 9(1).
               23 LKMO-INDSUS                    PIC 9(1).
               23 LKMO-INDTAG                    PIC 9(1).
               23 LKMO-INDTPA                    PIC 9(1).
               23 LKMO-INDTPE                    PIC 9(1).
               20 LKMO-CGPEHGDD.
               23 LKMO-PE0AAH.
               26 LKMO-EACTPN                    PIC S9(9) COMP-3.
               26 LKMO-FACTPN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIAAH.
               29 LKMO-CACTIV                    PIC X(3).
                 
                 88 LKMO-FL-CACTIV-AMI-MAL         VALUE 'MAL'.
                 88 LKMO-FL-CACTIV-AMI-CHOACT      VALUE 'CDA' 'CDN'.
                 88 LKMO-FL-CACTIV-MLD             VALUE 'MLD'.
               29 LKMO-NCTAPP                    PIC X(7).
               29 LKMO-CPAYSX                    PIC X(3).
                 88 LKMO-FL-PAY-FRA                VALUE 'FRA'.
                 88 LKMO-FL-PAY-CEE-ASS            VALUE 'CEE'.
                 88 LKMO-FL-PAY-CONV               VALUE 'CNV'.
                 88 LKMO-FL-PAY-AUT                VALUE 'AUT'.
                 88 LKMO-FL-CPAYSX-ACE             VALUE 'ACE'.
                
                 88 LKMO-FL-CPAYSX-LUX             VALUE 'LUX'.
               29 LKMO-NSIRPN                    PIC X(18).
               29 LKMO-CREGIM                    PIC X(2).
                 88 LKMO-FL-GENE                   VALUE 'GE'.
                 88 LKMO-FL-ADMT-NO-OUV-DRT        VALUE 'AD'.
                 88 LKMO-FL-ADM-AL-ABS-PF          VALUE 'AL'.
                 88 LKMO-FL-ADMT-OUV-DRT-CAF       VALUE 'AM'.
                 88 LKMO-FL-AGRI                   VALUE 'AG'.
                 88 LKMO-FL-MAR1-DE-COMR           VALUE 'MC'.
                 88 LKMO-FL-MINE                   VALUE 'MI'.
                 88 LKMO-FL-MINE-OUEST             VALUE 'MO'.
                 88 LKMO-FL-NAVI-INT               VALUE 'NI'.
                 88 LKMO-FL-PECH                   VALUE 'PM'.
                 88 LKMO-FL-CLTV-LOCL              VALUE 'CL'.
                 88 LKMO-FL-PENS-AUTR-REGI         VALUE 'TG'.
                 88 LKMO-FL-CREGIM-RP              VALUE 'RP'.
                 88 LKMO-FL-CREGIM-RE              VALUE 'RE'.
                 88 LKMO-FL-CREGIM-RL              VALUE 'RL'.
                 88 LKMO-FL-CREGIM-AA              VALUE 'AA'.
                 88 LKMO-FL-CREGIM-FT              VALUE 'FT'.
                 88 LKMO-FL-CREGIM-SN              VALUE 'SN'.
                 88 LKMO-FL-CREGIM-PT              VALUE 'PT'.
                 88 LKMO-FL-CREGIM-EF              VALUE 'EF'.
                 88 LKMO-FL-CREGIM-FP              VALUE 'FP'.
                 88 LKMO-FL-CREGIM-EN              VALUE 'EN'.
                 88 LKMO-FL-CREGIM-TR              VALUE 'TR'.
                 88 LKMO-FL-CREGIM-TS              VALUE 'TS'.
                 88 LKMO-FL-CREGIM-TM              VALUE 'TM'.
               29 LKMO-TAUXAC                    PIC S9(3)V9(2) COMP-3.
               29 LKMO-CNAREF                    PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF          VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF          VALUE 'M'.
               29 LKMO-NREFER                    PIC S9(7) COMP-3.
               29 LKMO-CFISCO                    PIC X(2).
                 88 LKMO-FL-CFISCO-PR              VALUE 'PR'.
                 88 LKMO-FL-CFISCO-PC              VALUE 'PC'.
                 88 LKMO-FL-CFISCO-SR              VALUE 'SR'.
                 88 LKMO-FL-CFISCO-SC              VALUE 'SC'.
                 88 LKMO-FL-CFISCO-ND              VALUE 'ND'.
                 88 LKMO-FL-CFISCO-EP              VALUE 'EP'.
                 88 LKMO-FL-CFISCO-CO              VALUE 'CO'.
                 88 LKMO-FL-CFISCO-LY              VALUE 'LY'.
                 88 LKMO-FL-CFISCO-2012            VALUE 'EP' 'CO' 'LY'.
               29 LKMO-CINAPE                    PIC X(1).
                 88 LKMO-FL-CINAPE-I               VALUE 'I'.
                 88 LKMO-FL-CINAPE-F               VALUE 'F'.
                 88 LKMO-FL-CINAPE-R               VALUE 'R'.
               29 LKMO-CSIRSO                    PIC X(2).
               29 LKMO-CIMADI                    PIC X(3).
                 88 LKMO-FL-CIMADI-DPE             VALUE 'DPE'.
                 88 LKMO-FL-CIMADI-PPE             VALUE 'PPE'.
                 88 LKMO-FL-CIMADI-PPF             VALUE 'PPF'.
                 88 LKMO-FL-CIMADI-INA             VALUE 'INA'.
                 88 LKMO-FL-CIMADI-AOI             VALUE 'AOI'.
                 88 LKMO-FL-CIMADI-CCD             VALUE 'CCD'.
                 88 LKMO-FL-CIMADI-CCN             VALUE 'CCN'.
                 88 LKMO-FL-CIMADI-XPE             VALUE 'XPE'.
                 88 LKMO-FL-CIMADI-XNA             VALUE 'XNA'.
               29 LKMO-CHAREM                    PIC X(1).
                 88 LKMO-FL-CHAREM-O               VALUE 'O'.
                 88 LKMO-FL-CHAREM-N               VALUE 'N'.
               29 LKMO-COTRSA                    PIC X(3).
                 88 LKMO-FL-COTRSA-AUT             VALUE 'AUT'.
                 88 LKMO-FL-COTRSA-CA              VALUE 'CA '.
                 88 LKMO-FL-COTRSA-CDD             VALUE 'CDD'.
                 88 LKMO-FL-COTRSA-CDI             VALUE 'CDI'.
                 88 LKMO-FL-COTRSA-CUI             VALUE 'CUI'.
                 88 LKMO-FL-COTRSA-CU1             VALUE 'CU1'.
                 88 LKMO-FL-COTRSA-CU2             VALUE 'CU2'.
                 88 LKMO-FL-COTRSA-CU3             VALUE 'CU3'.
                 88 LKMO-FL-COTRSA-CU4             VALUE 'CU4'.
                 88 LKMO-FL-COTRSA-INT             VALUE 'INT'.
                 88 LKMO-FL-COTRSA-AEN             VALUE 'AEN'.
                 88 LKMO-FL-COTRSA-VDI             VALUE 'VDI'.
                 88 LKMO-FL-COTRSA-DET             VALUE 'DET'.
              
               23 LKMO-PE0ABM.
               26 LKMO-EASFEM                    PIC S9(9) COMP-3.
               26 LKMO-FASFEM                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIABM.
               29 LKMO-CSSFRP1                   PIC X(2).
                 88 LKMO-FL-DCD                    VALUE 'DC'.
                 88 LKMO-FL-NO-RECO-ENF            VALUE 'NR'.
                 88 LKMO-FL-HORS-ETAT              VALUE 'HB'.
                 88 LKMO-FL-ABAN-NO-JUGE           VALUE 'OE'.
                 88 LKMO-FL-ABAN-JUGE-SS-PENS      VALUE 'PA'.
                 88 LKMO-FL-ABAN-PENS-FIXE         VALUE 'TP'.
                 88 LKMO-FL-AUTR-SITU              VALUE 'AS'.
                 88 LKMO-FL-ASF-ADOP               VALUE 'AD'.
                 88 LKMO-FL-CSSFRP-RS              VALUE 'RS'.
                 88 LKMO-FL-CSSFRP-CP              VALUE 'CP'.
                 88 LKMO-FL-SITASF-APP             VALUE 'AS' 'AD'.
                 88 LKMO-FL-SITASF-INC             VALUE 'NR' 'HB'.
                 88 LKMO-FL-SITASF-ABA             VALUE 'OE' 'PA' 'TP'.
               29 LKMO-CMOAS1                    PIC X(3).
                 88 LKMO-FL-CMOASF-VIOLENT         VALUE 'VAJ' 'VAP'.
               
               29 LKMO-DPSFEM                    PIC S9(9) COMP-3.
               29 LKMO-DAPSFM                    PIC S9(9) COMP-3.
               29 LKMO-CNAREF5                   PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF2         VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF2         VALUE 'M'.
               29 LKMO-NREFER5                   PIC S9(7) COMP-3.
               23 LKMO-PE0ABP.
               26 LKMO-EASPEP                    PIC S9(9) COMP-3.
               26 LKMO-FASFEP                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIABP.
               29 LKMO-CSSFRP                    PIC X(2).
                 88 LKMO-FL-DCD                    VALUE 'DC'.
                 88 LKMO-FL-NO-RECO-ENF            VALUE 'NR'.
                 88 LKMO-FL-HORS-ETAT              VALUE 'HB'.
                 88 LKMO-FL-ABAN-NO-JUGE           VALUE 'OE'.
                 88 LKMO-FL-ABAN-JUGE-SS-PENS      VALUE 'PA'.
                 88 LKMO-FL-ABAN-PENS-FIXE         VALUE 'TP'.
                 88 LKMO-FL-AUTR-SITU              VALUE 'AS'.
                 88 LKMO-FL-ASF-ADOP               VALUE 'AD'.
                 88 LKMO-FL-CSSFRP-RS              VALUE 'RS'.
                 88 LKMO-FL-CSSFRP-CP              VALUE 'CP'.
                 88 LKMO-FL-SITASF-APP             VALUE 'AS' 'AD'.
                 88 LKMO-FL-SITASF-INC             VALUE 'NR' 'HB'.
                 88 LKMO-FL-SITASF-ABA             VALUE 'OE' 'PA' 'TP'.
               29 LKMO-CMOASF                    PIC X(3).
                 88 LKMO-FL-CMOASF-VIOLENT         VALUE 'VAJ' 'VAP'.
               
               29 LKMO-DPSFEP                    PIC S9(9) COMP-3.
               29 LKMO-DAPSFP                    PIC S9(9) COMP-3.
               29 LKMO-CNAREF4                   PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF2         VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF2         VALUE 'M'.
               29 LKMO-NREFER4                   PIC S9(7) COMP-3.
               23 LKMO-PE0ABS.
               26 LKMO-EABFYO                    PIC S9(9) COMP-3.
               26 LKMO-FABFYO                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIABS.
               29 LKMO-CTYAES                    PIC X(1).
                 88 LKMO-FL-NO-DRT                 VALUE '0'.
                 88 LKMO-FL-DRT-AES-SIMP           VALUE '1'.
                 88 LKMO-FL-DRT-AES-1ERE-CAT       VALUE '2'.
                 88 LKMO-FL-DRT-AES-2ERE-CAT       VALUE '3'.
                 88 LKMO-FL-DRT-AES-3ERE-CAT       VALUE '4'.
                 88 LKMO-FL-DRT-CMP-1ERE-CAT       VALUE '5'.
                 88 LKMO-FL-DRT-CMP-2ERE-CAT       VALUE '6'.
                 88 LKMO-FL-CTYAES-A               VALUE 'A'.
                 88 LKMO-FL-CTYAES-B               VALUE 'B'.
                 88 LKMO-FL-CTYAES-C               VALUE 'C'.
                 88 LKMO-FL-CTYAES-D               VALUE 'D'.
                 88 LKMO-FL-CTYAES-E               VALUE 'E'.
                 88 LKMO-FL-CTYAES-F               VALUE 'F'.
                 88 LKMO-FL-CTYAES-G               VALUE 'G'.
                 88 LKMO-FL-CTYAES-H               VALUE 'H'.
                 88 LKMO-FL-CTYAES-I               VALUE 'I'.
                 88 LKMO-FL-CTYAES-J               VALUE 'J'.
                 88 LKMO-FL-CTYAES-K               VALUE 'K'.
                 88 LKMO-FL-CTYAES-L               VALUE 'L'.
                 88 LKMO-FL-CTYAES-MPI             VALUE 'B' 'C' 'D' 'E'
            'F' 'H' 'I' 'J' 'K' 'L'.
               29 LKMO-CIEDES                    PIC X(1).
                 88 LKMO-FL-INTN                   VALUE 'I'.
                 88 LKMO-FL-EXTN                   VALUE 'E'.
                 88 LKMO-FL-SEM-INTN               VALUE 'S'.
               29 LKMO-CPCDES                    PIC X(1).
                 88 LKMO-FL-PRIS-CHRG-TOT          VALUE 'O'.
                 88 LKMO-FL-PRIS-CHRG-PART         VALUE 'N'.
               29 LKMO-CORCOM                    PIC X(1).
                 88 LKMO-FL-CORCOM-E               VALUE 'E'.
                 88 LKMO-FL-CORCOM-F               VALUE 'F'.
               29 LKMO-CHOPCH                    PIC X(1).
                 88 LKMO-FL-CHOPCH-P               VALUE 'P'.
                 88 LKMO-FL-CHOPCH-C               VALUE 'C'.
               29 LKMO-CELPCH                    PIC X(1).
                 88 LKMO-FL-CELPCH-1               VALUE '1'.
                 88 LKMO-FL-CELPCH-3               VALUE '3'.
                 88 LKMO-FL-CELPCH-A               VALUE 'A'.
               23 LKMO-PE0ACC.
               26 LKMO-EACDES                    PIC S9(9) COMP-3.
               26 LKMO-FACDES                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIACC.
               29 LKMO-CSDMES                    PIC X(1).
                 88 LKMO-FL-CDES-ACC               VALUE 'A'.
                 88 LKMO-FL-CDES-HOS               VALUE 'H'.
                 88 LKMO-FL-CDES-REF               VALUE 'R'.
                 88 LKMO-FL-CSDMES-ACC             VALUE 'A' 'H'.
               29 LKMO-NCMDES                    PIC S9(7) COMP-3.
               29 LKMO-DCMDES                    PIC S9(9) COMP-3.
               29 LKMO-DPROUR                    PIC S9(9) COMP-3.
               29 LKMO-CPROUR                    PIC X(1).
                 88 LKMO-FL-CPROUR-A               VALUE 'A'.
                 88 LKMO-FL-CPROUR-C               VALUE 'C'.
               23 LKMO-PE0ACH.
               26 LKMO-EACHAR                    PIC S9(9) COMP-3.
               26 LKMO-FACHAR                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIACH.
               29 LKMO-CACHAR                    PIC X(1).
                 88 LKMO-FLA-CHRG-SENS-CGOD        VALUE 'O'.
                 88 LKMO-FLA-NO-A-CHRG             VALUE 'N'.
                 88 LKMO-FL-CACHAR-A               VALUE 'A'.
               23 LKMO-PE0AES.
               26 LKMO-EPSFYO                    PIC S9(9) COMP-3.
               26 LKMO-FPSFYO                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIAES.
               29 LKMO-CTYAES1                   PIC X(1).
                 88 LKMO-FL-CTYAES1-MPI            VALUE 'B' 'C' 'D' 'E'
            'F' 'H' 'I' 'J' 'K' 'L'.
               29 LKMO-CORCO1                    PIC X(1).
                 88 LKMO-FL-CORCOM-E               VALUE 'E'.
                 88 LKMO-FL-CORCOM-F               VALUE 'F'.
               29 LKMO-CHOPC1                    PIC X(1).
                 88 LKMO-FL-CHOPC1-P               VALUE 'P'.
                 88 LKMO-FL-CHOPC1-C               VALUE 'C'.
               29 LKMO-CELPC1                    PIC X(1).
                 88 LKMO-FL-CELPC1-1               VALUE '1'.
                 88 LKMO-FL-CELPC1-3               VALUE '3'.
                 88 LKMO-FL-CELPC1-A               VALUE 'A'.
               23 LKMO-PE0AFE.
               26 LKMO-AFEDEB                    PIC S9(9) COMP-3.
               26 LKMO-AFEFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIAFE.
               29 LKMO-DEMPUR                    PIC S9(9) COMP-3.
               29 LKMO-NEMPUR                    PIC 9(18).
               29 LKMO-CNAREF2                   PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF2         VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF2         VALUE 'M'.
               29 LKMO-NREFER2                   PIC S9(7) COMP-3.
               29 LKMO-NPSEUD                    PIC S9(15) COMP-3.
               23 LKMO-PE0AGE.
               26 LKMO-AGEDEB                    PIC S9(9) COMP-3.
               26 LKMO-AGEFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIAGE.
               29 LKMO-DEMPUR1                   PIC S9(9) COMP-3.
               29 LKMO-NEMPUR1                   PIC 9(18).
               29 LKMO-CNAREF1                   PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF1         VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF1         VALUE 'M'.
               29 LKMO-NREFER1                   PIC S9(7) COMP-3.
               23 LKMO-PE0APC.
               26 LKMO-EAVAPE                    PIC S9(9) COMP-3.
               26 LKMO-FAVAPE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIAPC.
               29 LKMO-DDEMDS                    PIC S9(9) COMP-3.
               29 LKMO-DREFAP                    PIC S9(9) COMP-3.
               29 LKMO-CRGAPE                    PIC 9(1).
               29 LKMO-DRETDS                    PIC S9(9) COMP-3.
               29 LKMO-CRETDS                    PIC X(1).
               29 LKMO-NFICPN6                   PIC S9(7) COMP-3.
               23 LKMO-PE0APH.
               26 LKMO-EAVICH                    PIC S9(9) COMP-3.
               26 LKMO-FAVICH                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIAPH.
               29 LKMO-CAVICH                    PIC X(1).
                 88 LKMO-FL-CAVICH-I               VALUE 'I'.
                 88 LKMO-FL-CAVICH-A               VALUE 'A'.
                 88 LKMO-FL-CAVICH-R               VALUE 'R'.
                 88 LKMO-FL-CAVICH-M               VALUE 'M'.
               23 LKMO-PE0ARS.
               26 LKMO-DANARS                    PIC S9(9) COMP-3.
               26 LKMO-FANARS                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIARS.
               29 LKMO-CATARS                    PIC X(1).
                 88 LKMO-FL-ARS-ATT                VALUE 'A'.
                 88 LKMO-FL-ARS-CHA                VALUE 'T'.
                 88 LKMO-FL-ARS-ATT-CHA            VALUE 'X'.
                 88 LKMO-FL-ARS-AUT-REG            VALUE 'P'.
               23 LKMO-PE0AVM.
               26 LKMO-EAMAIN                    PIC S9(9) COMP-3.
               26 LKMO-FAMAIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIAVM.
               29 LKMO-CAMAIN                    PIC X(1).
                 88 LKMO-FL-CAMAIN-D               VALUE 'D'.
                 88 LKMO-FL-CAMAIN-A               VALUE 'A'.
                 88 LKMO-FL-CAMAIN-R               VALUE 'R'.
               23 LKMO-PE0BEP.
               26 LKMO-EBAMRE                    PIC S9(9) COMP-3.
               26 LKMO-FBAMRE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIBEP.
               29 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               29 LKMO-MEMOMA                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-CINDMR                    PIC X(1).
                 88 LKMO-FL-CINDMR-B               VALUE 'B'.
                 88 LKMO-FL-CINDMR-F               VALUE 'F'.
                 88 LKMO-FL-CINDMR-9               VALUE '9'.
               29 LKMO-MAEF10                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MAEF20                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MAEF30                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MENEUR                    PIC S9(7)V9(2) COMP-3.
               23 LKMO-PE0CAP.
               26 LKMO-EMOCRM                    PIC S9(9) COMP-3.
               26 LKMO-FMOCRM                    PIC S9(9) COMP-3.
               26 LKMO-CDPEICAP.
               29 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               29 LKMO-MANAPI                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-MINTPI                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-MITHEP                    PIC S9(5)V9(2) COMP-3.
               23 LKMO-PE0CIB.
               26 LKMO-ETICIR1                   PIC S9(9) COMP-3.
               26 LKMO-FTICIR1                   PIC S9(9) COMP-3.
               26 LKMO-CDPEICIB.
               29 LKMO-ETICIR                    PIC S9(9) COMP-3.
               29 LKMO-FTICIR                    PIC S9(9) COMP-3.
               29 LKMO-FILLER
                            OCCURS 023 TIMES     PIC X(1).
               23 LKMO-PE0COT.
               26 LKMO-EACOAH                    PIC S9(9) COMP-3.
               26 LKMO-FACOAH                    PIC S9(9) COMP-3.
               26 LKMO-CDPEICOT.
               29 LKMO-CACOAH                    PIC X(1).
                 88 LKMO-FL-INI-COTO-AAH           VALUE 'I'.
                 88 LKMO-FL-REN-COTO-AAH           VALUE 'A'.
                 88 LKMO-FL-REFU-COTO-AAH          VALUE 'R'.
                 88 LKMO-FL-CACOAH-M               VALUE 'M'.
               29 LKMO-NCODAH                    PIC S9(11) COMP-3.
               23 LKMO-PE0COV.
               26 LKMO-EACOAV                    PIC S9(9) COMP-3.
               26 LKMO-FACOAV                    PIC S9(9) COMP-3.
               26 LKMO-CDPEICOV.
               29 LKMO-CACOAV                    PIC X(1).
                 88 LKMO-FL-COTAV-ACC              VALUE 'A'.
                 88 LKMO-FL-COTAV-REJ              VALUE 'R'.
               29 LKMO-NACOAV                    PIC X(10).
               23 LKMO-PE0CRA.
               26 LKMO-ECRALI                    PIC S9(9) COMP-3.
               26 LKMO-FCRALI                    PIC S9(9) COMP-3.
               26 LKMO-CDPEICRA.
               29 LKMO-CCRALI                    PIC X(2).
                 88 LKMO-FL-CCRALI-DD              VALUE 'DD'.
                 88 LKMO-FL-CCRALI-DA              VALUE 'DA'.
                 88 LKMO-FL-CCRALI-DR              VALUE 'DR'.
                 88 LKMO-FL-CCRALI-TR              VALUE 'TR'.
                 88 LKMO-FL-CCRALI-PE              VALUE 'PE'.
                 88 LKMO-FL-CCRALI-SF              VALUE 'SF'.
                 88 LKMO-FL-CCRALI-RE              VALUE 'RE'.
                 88 LKMO-FL-CCRALI-PS              VALUE 'PS'.
                 88 LKMO-FL-CCRALI-SA              VALUE 'SA'.
                 88 LKMO-FL-CCRALI-AT              VALUE 'AT'.
                 88 LKMO-FL-CCRALI-AC              VALUE 'AC'.
                 88 LKMO-FL-CCRALI-AA              VALUE 'AA'.
                 88 LKMO-FL-CCRALI-DS              VALUE 'DS'.
                 88 LKMO-FL-CCRALI-MS              VALUE 'MS'.
                 88 LKMO-FL-CCRALI-RM              VALUE 'RM'.
                 88 LKMO-FL-CCRALI-SI              VALUE 'SI'.
                 88 LKMO-FL-CCRALI-MA              VALUE 'MA'.
               29 LKMO-COROBA                    PIC X(3).
                 88 LKMO-FL-CORCRA-CJT             VALUE 'CJT'.
                 88 LKMO-FL-CORCRA-PAR             VALUE 'PAR'.
               29 LKMO-CMDOBA                    PIC X(3).
                 88 LKMO-FL-CMDOBA-AVA             VALUE 'AVA'.
                 88 LKMO-FL-CMDOBA-LOG             VALUE 'LOG'.
                 88 LKMO-FL-CMDOBA-PAM             VALUE 'PAM'.
                 88 LKMO-FL-CMDOBA-PHE             VALUE 'PHE'.
                 88 LKMO-FL-CMDOBA-DCG             VALUE 'DCG'.
                 88 LKMO-FL-CMDOBA-AUT             VALUE 'AUT'.
               29 LKMO-CEASFC                    PIC X(1).
                 88 LKMO-FL-CEASFC-O               VALUE 'O'.
                 88 LKMO-FL-CEASFC-N               VALUE 'N'.
               29 LKMO-MSNCRA                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MPACRA                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-LCOCRA                    PIC X(50).
               23 LKMO-PE0CRE.
               26 LKMO-EBAMRE                    PIC S9(9) COMP-3.
               26 LKMO-FBAMRE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEICRE.
               29 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               29 LKMO-MBMRPE                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-CABNEU                    PIC X(2).
                 88 LKMO-FL-NEU-GEN                VALUE 'NG'.
                 88 LKMO-FL-ABA-AUT-GEN            VALUE 'AG'.
                 88 LKMO-FL-ABA-CHO-GEN            VALUE 'CG'.
                 88 LKMO-FL-NEU-CAT                VALUE 'NC'.
                 88 LKMO-FL-NEU-AAH                VALUE 'NA'.
                 88 LKMO-FL-CABNEU-NR              VALUE 'NR'.
                 88 LKMO-FL-CABNEU-NP              VALUE 'NP'.
                 88 LKMO-FL-CABNEU-CP              VALUE 'CP'.
                 88 LKMO-FL-CABNEU-CN              VALUE 'CN'.
               29 LKMO-CABNER                    PIC X(2).
                 88 LKMO-FL-CABNER-RN              VALUE 'RN'.
                 88 LKMO-FL-CABNER-RM              VALUE 'RM'.
               29 LKMO-CMERES                    PIC X(1).
                 88 LKMO-FL-CMERES-A               VALUE 'A'.
                 88 LKMO-FL-CMERES-C               VALUE 'C'.
                 88 LKMO-FL-CMERES-N               VALUE 'N'.
                 88 LKMO-FL-CMERES-H               VALUE 'H'.
               23 LKMO-PE0CRM.
               26 LKMO-EMOCRM                    PIC S9(9) COMP-3.
               26 LKMO-FMOCRM                    PIC S9(9) COMP-3.
               26 LKMO-CDPEICRM.
               29 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               29 LKMO-MABNEU                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-MINTRM                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-MABIND                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-MREDHO                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-MITHEM                    PIC S9(5)V9(2) COMP-3.
               23 LKMO-PE0CTS.
               26 LKMO-ETSEJO                    PIC S9(9) COMP-3.
               26 LKMO-FTSEJO                    PIC S9(9) COMP-3.
               26 LKMO-CDPEICTS.
               29 LKMO-CTSNAT                    PIC X(3).
                 88 LKMO-FL-CTSNAT-AND             VALUE 'AND'.
                 88 LKMO-FL-CTSNAT-APF             VALUE 'APF'.
                 88 LKMO-FL-CTSNAT-APS             VALUE 'APS'.
                 88 LKMO-FL-CTSNAT-APT             VALUE 'APT'.
                 88 LKMO-FL-CTSNAT-AUT             VALUE 'AUT'.
                 88 LKMO-FL-CTSNAT-CCT             VALUE 'CCT'.
                 88 LKMO-FL-CTSNAT-CRA             VALUE 'CRA'.
                 88 LKMO-FL-CTSNAT-CRC             VALUE 'CRC'.
                 88 LKMO-FL-CTSNAT-CRE             VALUE 'CRE'.
                 88 LKMO-FL-CTSNAT-CST             VALUE 'CST'.
                 88 LKMO-FL-CTSNAT-CTS             VALUE 'CTS'.
                 88 LKMO-FL-CTSNAT-DIS             VALUE 'DIS'.
                 88 LKMO-FL-CTSNAT-DCE             VALUE 'DCE'.
                 88 LKMO-FL-CTSNAT-FRO             VALUE 'FRO'.
                 88 LKMO-FL-CTSNAT-MON             VALUE 'MON'.
                 88 LKMO-FL-CTSNAT-OFP             VALUE 'OFP'.
                 88 LKMO-FL-CTSNAT-OMI             VALUE 'OMI'.
                 88 LKMO-FL-CTSNAT-PDC             VALUE 'PDC'.
                 88 LKMO-FL-CTSNAT-RCS             VALUE 'RCS'.
                 88 LKMO-FL-CTSNAT-REF             VALUE 'REF'.
                 88 LKMO-FL-CTSNAT-RRA             VALUE 'RRA'.
                 88 LKMO-FL-CTSNAT-RRC             VALUE 'RRC'.
                 88 LKMO-FL-CTSNAT-RRE             VALUE 'RRE'.
                 88 LKMO-FL-CTSNAT-RTS             VALUE 'RTS'.
                 88 LKMO-FL-CTSNAT-RSA             VALUE 'RSA'.
                 88 LKMO-FL-CTSNAT-RSR             VALUE 'RSR'.
                 88 LKMO-FL-CTSNAT-RUN             VALUE 'RUN'.
                 88 LKMO-FL-CTSNAT-RVA             VALUE 'RVA'.
                 88 LKMO-FL-CTSNAT-VAC             VALUE 'VAC'.
                 88 LKMO-FL-CTSNAT-VLS             VALUE 'VLS'.
                 88 LKMO-FL-CTSNAT-CVC             VALUE 'CVC'.
                 88 LKMO-FL-CTSNAT-RAF             VALUE 'RAF'.
                 88 LKMO-FL-CTSNAT-RDA             VALUE 'RDA'.
                 88 LKMO-FL-CTSNAT-RPI             VALUE 'RPI'.
               
               29 LKMO-CTSMEN                    PIC X(2).
                 88 LKMO-FL-CTSMEN-AM              VALUE 'AM'.
                 88 LKMO-FL-CTSMEN-AO              VALUE 'AO'.
                 88 LKMO-FL-CTSMEN-AP              VALUE 'AP'.
                 88 LKMO-FL-CTSMEN-A5              VALUE 'A5'.
                 88 LKMO-FL-CTSMEN-AS              VALUE 'AS'.
                 88 LKMO-FL-CTSMEN-AT              VALUE 'AT'.
                 88 LKMO-FL-CTSMEN-DR              VALUE 'DR'.
                 88 LKMO-FL-CTSMEN-DS              VALUE 'DS'.
                 88 LKMO-FL-CTSMEN-MF              VALUE 'MF'.
                 88 LKMO-FL-CTSMEN-RF              VALUE 'RF'.
                 88 LKMO-FL-CTSMEN-RR              VALUE 'RR'.
                 88 LKMO-FL-CTSMEN-RS              VALUE 'RS'.
                 88 LKMO-FL-CTSMEN-VF              VALUE 'VF'.
                 88 LKMO-FL-CTSMEN-V5              VALUE 'V5'.
                 88 LKMO-FL-CTSMEN-RE              VALUE 'RE'.
                 88 LKMO-FL-CTSMEN-CS              VALUE 'CS'.
                 88 LKMO-FL-CTSMEN-PF              VALUE 'PF'.
                 88 LKMO-FL-CTSMEN-PS              VALUE 'PS'.
                 88 LKMO-FL-CTSMEN-SC              VALUE 'SC'.
                 88 LKMO-FL-CTSMEN-S5              VALUE 'S5'.
                 88 LKMO-FL-CTSMEN-PE              VALUE 'PE'.
                 88 LKMO-FL-CTSMEN-PT              VALUE 'PT'.
                 88 LKMO-FL-CTSMEN-JT              VALUE 'JT'.
                 88 LKMO-FL-CTSMEN-VI              VALUE 'VI'.
                 88 LKMO-FL-CTSMEN-IO              VALUE 'IO'.
                 88 LKMO-FL-CTSMEN-ET              VALUE 'ET'.
                 88 LKMO-FL-CTSMEN-EO              VALUE 'EO'.
                 88 LKMO-FL-CTSMEN-SA              VALUE 'SA'.
                 88 LKMO-FL-CTSMEN-SO              VALUE 'SO'.
                 88 LKMO-FL-CTSMEN-TT              VALUE 'TT'.
                 88 LKMO-FL-CTSMEN-TO              VALUE 'TO'.
                 88 LKMO-FL-CTSMEN-VO              VALUE 'VO'.
                 88 LKMO-FL-CTSMEN-R5              VALUE 'R5'.
                 88 LKMO-FL-CTSMEN-AC              VALUE 'AC'.
                 88 LKMO-FL-CTSMEN-AD              VALUE 'AD'.
                 88 LKMO-FL-CTSMEN-CA              VALUE 'CA'.
                 88 LKMO-FL-CTSMEN-CN              VALUE 'CN'.
                 88 LKMO-FL-CTSMEN-CR              VALUE 'CR'.
                 88 LKMO-FL-CTSMEN-DO              VALUE 'DO'.
                 88 LKMO-FL-CTSMEN-DT              VALUE 'DT'.
                 88 LKMO-FL-CTSMEN-RT              VALUE 'RT'.
                 88 LKMO-FL-CTSMEN-RM              VALUE 'RM'.
                 88 LKMO-FL-CTSMEN-PR              VALUE 'PR'.
                 88 LKMO-FL-CTSMEN-CH              VALUE 'CH'.
                 88 LKMO-FL-CTSMEN-C0              VALUE 'CO'.
                 88 LKMO-FL-CTSMEN-G0              VALUE 'GO'.
                 88 LKMO-FL-CTSMEN-SG              VALUE 'SG'.
                 88 LKMO-FL-CTSMEN-FA              VALUE 'FA'.
               23 LKMO-PE0DAE.
               26 LKMO-EENAPE                    PIC S9(9) COMP-3.
               26 LKMO-FENAPE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDAE.
               29 LKMO-CENAPE                    PIC X(1).
                 88 LKMO-FL-ENF-ORIG-DRT-APE       VALUE 'O'.
                 88 LKMO-FL-ENF-NO-CONC-APE        VALUE 'N'.
                 88 LKMO-FL-CENAPE-A               VALUE 'A'.
               23 LKMO-PE0DAP.
               26 LKMO-EENAPI                    PIC S9(9) COMP-3.
               26 LKMO-FENAPI                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDAP.
               29 LKMO-CENAPI                    PIC X(1).
                 88 LKMO-FL-ENF-ORIG-DRT-API       VALUE 'O'.
                 88 LKMO-FL-ENF-NO-CONC            VALUE 'N'.
               23 LKMO-PE0DAR.
               26 LKMO-EBAMRE                    PIC S9(9) COMP-3.
               26 LKMO-FBAMRE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDAR.
               29 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               29 LKMO-MABAAH                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MABF10                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MABF20                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MABF30                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MNEURE                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MARGAH                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-MABA10                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-CPPNEX                    PIC X(1).
               23 LKMO-PE0DDA.
               26 LKMO-EWADSF                    PIC S9(9) COMP-3.
               26 LKMO-FWADSF                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDDA.
               29 LKMO-CWADSF                    PIC X(1).
                 88 LKMO-FL-REFU-DISP              VALUE 'R'.
                 88 LKMO-FL-ACOD-DISP-AVR          VALUE 'A'.
                 88 LKMO-FL-ACOD-DISP-SS-REDU      VALUE 'S'.
                 88 LKMO-FL-CWADSF-P               VALUE 'P'.
               23 LKMO-PE0DDI.
               26 LKMO-DDIDEB                    PIC S9(9) COMP-3.
               26 LKMO-DDIFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDDI.
               29 LKMO-DWDDSF                    PIC S9(9) COMP-3.
               29 LKMO-CWDDSF                    PIC X(2).
                 88 LKMO-FL-PRO-REF-DIS            VALUE 'RF'.
                 88 LKMO-FL-PRO-DISP-AVR           VALUE 'DR'.
                 88 LKMO-FL-PRO-DISP-TOT           VALUE 'DT'.
                 88 LKMO-FL-ACT-ENG                VALUE 'AE'.
               23 LKMO-PE0DER.
               26 LKMO-EWDEPR                    PIC S9(9) COMP-3.
               26 LKMO-FWDEPR                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDER.
               29 LKMO-CWDEAG                    PIC X(1).
                 88 LKMO-FL-CWDEAG-D               VALUE 'D'.
                 88 LKMO-FL-CWDEAG-O               VALUE 'O'.
                 88 LKMO-FL-CWDEAG-N               VALUE 'N'.
               29 LKMO-CWDERE                    PIC X(1).
                 88 LKMO-FL-CWDERE-D               VALUE 'D'.
                 88 LKMO-FL-CWDERE-O               VALUE 'O'.
                 88 LKMO-FL-CWDERE-N               VALUE 'N'.
               29 LKMO-CWDENA                    PIC X(1).
                 88 LKMO-FL-CWDENA-D               VALUE 'D'.
                 88 LKMO-FL-CWDENA-O               VALUE 'O'.
                 88 LKMO-FL-CWDENA-N               VALUE 'N'.
               29 LKMO-CWDEAC                    PIC X(1).
                 88 LKMO-FL-CWDEAC-D               VALUE 'D'.
                 88 LKMO-FL-CWDEAC-O               VALUE 'O'.
                 88 LKMO-FL-CWDEAC-N               VALUE 'N'.
               29 LKMO-CWDESU                    PIC X(1).
                 88 LKMO-FL-CWDESU-D               VALUE 'D'.
                 88 LKMO-FL-CWDESU-O               VALUE 'O'.
                 88 LKMO-FL-CWDESU-N               VALUE 'N'.
               23 LKMO-PE0DPE.
               26 LKMO-EDOPER                    PIC S9(9) COMP-3.
               26 LKMO-FDOPER                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDPE.
               29 LKMO-CDOPER                    PIC X(3).
                 88 LKMO-FL-AGNT-CAF               VALUE 'CAF'.
                 88 LKMO-FL-AGNT-CTRI              VALUE 'CTI'.
                 88 LKMO-FL-ADTR-CTRI              VALUE 'ADM'.
               23 LKMO-PE0DPO.
               26 LKMO-EPOTRM                    PIC S9(9) COMP-3.
               26 LKMO-FPOTRM                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDPO.
               29 LKMO-CWDRPO                    PIC X(1).
                 88 LKMO-FL-DRT-POTI-RMI           VALUE 'O'.
                 88 LKMO-FL-PAS-DRT-POTI-RMI       VALUE 'N'.
                 88 LKMO-FL-CWDRPO-J               VALUE 'J'.
                 88 LKMO-FL-CWDRPO-P               VALUE 'P'.
               23 LKMO-PE0DRJ.
               26 LKMO-EDTSEJ                    PIC S9(9) COMP-3.
               26 LKMO-FDTSEJ                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIDRJ.
               29 LKMO-CTDTSJ                    PIC X(1).
                 88 LKMO-FL-CTDTSJ-P               VALUE 'P'.
                 88 LKMO-FL-CTDTSJ-D               VALUE 'D'.
               29 LKMO-CODTSJ                    PIC X(2).
                 88 LKMO-FL-CODTSJ-AC              VALUE 'AC'.
                 88 LKMO-FL-CODTSJ-IN              VALUE 'IN'.
                 88 LKMO-FL-CODTSJ-EF              VALUE 'EF'.
                 88 LKMO-FL-CODTSJ-CJ              VALUE 'CJ'.
                 88 LKMO-FL-CODTSJ-DE              VALUE 'DE'.
                 88 LKMO-FL-CODTSJ-TR              VALUE 'TR'.
               29 LKMO-CNDTSJ                    PIC X(3).
                 88 LKMO-FL-CNDTSJ-DSA             VALUE 'DSA'.
                 88 LKMO-FL-CNDTSJ-DSM             VALUE 'DSM'.
                 88 LKMO-FL-CNDTSJ-DSP             VALUE 'DSP'.
                 88 LKMO-FL-CNDSTJ-NDS             VALUE 'NDS'.
               23 LKMO-PE0EAA.
               26 LKMO-EACAAH                    PIC S9(9) COMP-3.
               26 LKMO-FACAAH                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIEAA.
               29 LKMO-CACTIV1                   PIC X(3).
               23 LKMO-PE0EBO.
               26 LKMO-EBODEB                    PIC S9(9) COMP-3.
               26 LKMO-EBOFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIEBO.
               29 LKMO-FILLER                    PIC X(1).
               23 LKMO-PE0HAH.
               26 LKMO-EEFHAH                    PIC S9(9) COMP-3.
               26 LKMO-FAFHAH                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIHAH.
               29 LKMO-CHOSPI2                   PIC X(6).
               29 LKMO-CPADFJ2                   PIC X(1).
               23 LKMO-PE0HMI.
               26 LKMO-EWEFHO                    PIC S9(9) COMP-3.
               26 LKMO-FWEFHO                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIHMI.
               29 LKMO-CHOSPI1                   PIC X(6).
               29 LKMO-CPADFJ1                   PIC X(1).
               23 LKMO-PE0HOS.
               26 LKMO-EPMHOS1                   PIC S9(9) COMP-3.
               26 LKMO-FPMHOS                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIHOS.
               29 LKMO-QJRFYM                    PIC S9(3) COMP-3.
               29 LKMO-EPMHOS                    PIC S9(9) COMP-3.
               23 LKMO-PE0HRA.
               26 LKMO-EHOSPE                    PIC S9(9) COMP-3.
               26 LKMO-FHOSPE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIHRA.
               29 LKMO-CHOSPI                    PIC X(6).
                 88 LKMO-FL-HOSP-SS-INDM-JOUR      VALUE 'HOSSIJ'.
                 88 LKMO-FL-HOSP-AVEC-IND          VALUE 'HOSIND'.
                 88 LKMO-FL-HOSP-NON-PEC           VALUE 'HOSNPC'.
                 88 LKMO-FL-HOSP-AVEC-PEC          VALUE 'HOSPEC'.
                 88 LKMO-FL-PLAC-EN-MAS            VALUE 'PLAMAS'.
                 88 LKMO-FL-HEBE-EN-CHRS           VALUE 'HEBCHR'.
                 88 LKMO-FL-MAFY-SR-AVIS-COTO      VALUE 'MAIFOY'.
                 88 LKMO-FL-HEBE-TEMP              VALUE 'HEBTEM'.
                 88 LKMO-FL-HEBE-DFNT              VALUE 'HEBDEF'.
                 88 LKMO-FL-MEI-AVEC-OEM           VALUE 'MAIMAS'.
              
               29 LKMO-CPADFJ                    PIC X(1).
                 88 LKMO-FL-CPADFJ-T               VALUE 'T'.
                 88 LKMO-FL-CPADFJ-M               VALUE 'M'.
                 88 LKMO-FL-AAH-PAI-FOJ            VALUE 'O'.
                 88 LKMO-FL-AAH-NON-FOJ            VALUE 'N'.
               29 LKMO-DSUIFJ                    PIC S9(9) COMP-3.
               29 LKMO-CSUIFJ                    PIC X(1).
                 88 LKMO-FL-CSUIFJ-A               VALUE 'A'.
                 88 LKMO-FL-CSUIFJ-N               VALUE 'N'.
                 88 LKMO-FL-CSUIFJ-R               VALUE 'R'.
               23 LKMO-PE0IAG.
               26 LKMO-ETRIAG                    PIC S9(9) COMP-3.
               26 LKMO-FTRIAG1                   PIC S9(9) COMP-3.
               26 LKMO-CDPEIIAG.
               29 LKMO-CCUVAG                    PIC X(1).
                 88 LKMO-FL-AGED-COTI              VALUE 'O'.
                 88 LKMO-FL-AGED-NO-COTI           VALUE 'N'.
               29 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               29 LKMO-MCOTAG                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-CCAVAC                    PIC X(1).
               29 LKMO-FTRIAG                    PIC S9(9) COMP-3.
               23 LKMO-PE0INC.
               26 LKMO-EINCPE                    PIC S9(9) COMP-3.
               26 LKMO-FINCPE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIINC.
               29 LKMO-TINCPN                    PIC S9(3)V9(2) COMP-3.
               23 LKMO-PE0INV.
               26 LKMO-EINVPE                    PIC S9(9) COMP-3.
               26 LKMO-FINVPE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIINV.
               29 LKMO-CCAINV                    PIC X(1).
                 88 LKMO-FL-CRT-INV-TRA            VALUE 'T'.
                 88 LKMO-FL-CRT-INV-GUE            VALUE 'G'.
                 88 LKMO-FL-CRT-INV-S80            VALUE 'Z'.
                 88 LKMO-FL-CRT-INV-DEF            VALUE 'D'.
               29 LKMO-NDCINV                    PIC X(9).
               23 LKMO-PE0JUE.
               26 LKMO-JUEDEB                    PIC S9(9) COMP-3.
               26 LKMO-JUEFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIJUE.
               29 LKMO-CJUENF                    PIC X(1).
                 88 LKMO-FL-CJUENF-O               VALUE 'O'.
                 88 LKMO-FL-CJUENF-N               VALUE 'N'.
                 88 LKMO-FL-CJUENF-I               VALUE 'I'.
                 88 LKMO-FL-CJUENF-P               VALUE 'P'.
               29 LKMO-CNOREP                    PIC X(2).
                 88 LKMO-FL-CNOREP-HD              VALUE 'HD'.
                 88 LKMO-FL-CNOREP-HM              VALUE 'HM'.
                 88 LKMO-FL-CNOREP-PV              VALUE 'SP'.
                 88 LKMO-FL-CNOREP-CO              VALUE 'CO'.
                 88 LKMO-FL-CNOREP-XX              VALUE 'XX'.
               23 LKMO-PE0LAF.
               26 LKMO-EPLACE                    PIC S9(9) COMP-3.
               26 LKMO-FPLACE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEILAF.
               29 LKMO-CNADES1                   PIC X(1).
               29 LKMO-NDESTI1                   PIC S9(7) COMP-3.
               29 LKMO-CLAFMA                    PIC X(1).
                 88 LKMO-FL-LIEN-AFFE-MAIN         VALUE 'O'.
                 88 LKMO-FL-LIEN-AFFE-NO-MAIN      VALUE 'N'.
                 88 LKMO-FL-LIEN-MAIN-PAI-PAR      VALUE 'M'.
               29 LKMO-CTYPLA                    PIC X(3).
                 88 LKMO-FL-CTYPLA-ASE             VALUE 'ASE'.
                 88 LKMO-FL-CTYPLA-ORG             VALUE 'ORG'.
                 88 LKMO-FL-CTYPLA-URG             VALUE 'URG'.
                 88 LKMO-FL-CTYPLA-AED             VALUE 'AED'.
               23 LKMO-PE0LIM.
               26 LKMO-ELIPEA                    PIC S9(9) COMP-3.
               26 LKMO-FLIPEA                    PIC S9(9) COMP-3.
               26 LKMO-CDPEILIM.
               29 LKMO-NFICPN1                   PIC S9(7) COMP-3.
               29 LKMO-CTYPAR1                   PIC X(3).
                 88 LKMO-FL-LGIT                   VALUE 'LEG'.
                 88 LKMO-FL-CTYPAR-LEA             VALUE 'LEA'.
                 88 LKMO-FL-RECL                   VALUE 'REC'.
                 88 LKMO-FL-REV-ADOP               VALUE 'REA'.
                 88 LKMO-FL-ADOP                   VALUE 'ADP'.
                 88 LKMO-FL-NATU                   VALUE 'NAT'.
                 88 LKMO-FL-FRER-OU-SOEU           VALUE 'FRE'.
                 88 LKMO-FL-NEVE-OU-NIEC           VALUE 'NEV'.
                 88 LKMO-FL-DECD                   VALUE 'DES'.
                 88 LKMO-FL-ASCD                   VALUE 'ASC'.
                 88 LKMO-FL-ONCL-OU-TANT           VALUE 'ONC'.
                 88 LKMO-FL-AUTR-OU-SS-LDP         VALUE 'AUT'.
                 88 LKMO-FL-BAFI-OU-BEFI           VALUE 'BFI'.
                 88 LKMO-FL-COLL-DE-DEGR-QUA       VALUE 'COL'.
                 88 LKMO-FL-CTYPAR-CPAM-E          VALUE 'LEG' 'REC' 'RE
      -    'A' 'ADP' 'NAT' 'LEA'.
                 88 LKMO-FL-CTYPAR-CPAM-AD         VALUE 'FRE' 'NEV' 'DE
      -    'S' 'ASC' 'ONC' 'BFI' 'COL'.
                 88 LKMO-FL-CTYPAR-CPAM-AA         VALUE 'AUT'.
               23 LKMO-PE0LIP.
               26 LKMO-ELIPER                    PIC S9(9) COMP-3.
               26 LKMO-FLIPER                    PIC S9(9) COMP-3.
               26 LKMO-CDPEILIP.
               29 LKMO-NFICPN2                   PIC S9(7) COMP-3.
               29 LKMO-CTYPAR                    PIC X(3).
                 88 LKMO-FL-LGIT                   VALUE 'LEG'.
                 88 LKMO-FL-CTYPAR-LEA             VALUE 'LEA'.
                 88 LKMO-FL-RECL                   VALUE 'REC'.
                 88 LKMO-FL-REV-ADOP               VALUE 'REA'.
                 88 LKMO-FL-ADOP                   VALUE 'ADP'.
                 88 LKMO-FL-NATU                   VALUE 'NAT'.
                 88 LKMO-FL-FRER-OU-SOEU           VALUE 'FRE'.
                 88 LKMO-FL-NEVE-OU-NIEC           VALUE 'NEV'.
                 88 LKMO-FL-DECD                   VALUE 'DES'.
                 88 LKMO-FL-ASCD                   VALUE 'ASC'.
                 88 LKMO-FL-ONCL-OU-TANT           VALUE 'ONC'.
                 88 LKMO-FL-AUTR-OU-SS-LDP         VALUE 'AUT'.
             
                 88 LKMO-FL-CTYPAR-CPAM-AA         VALUE 'AUT'.
               23 LKMO-PE0MGA.
               26 LKMO-MGADEB                    PIC S9(9) COMP-3.
               26 LKMO-MGAFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIMGA.
               29 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               29 LKMO-MREVCM                    PIC S9(7)V9(2) COMP-3.
               29 LKMO-CCAVAV                    PIC X(1).
                 88 LKMO-FL-CCAVAV-O               VALUE 'O'.
                 88 LKMO-FL-CCAVAV-N               VALUE 'N'.
               23 LKMO-PE0MGG.
               26 LKMO-MGGDEB                    PIC S9(9) COMP-3.
               26 LKMO-MGGFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIMGG.
               29 LKMO-FILLER                    PIC X(1).
               23 LKMO-PE0MRP.
               26 LKMO-MRPDEB                    PIC S9(9) COMP-3.
               26 LKMO-MRPFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIMRP.
               29 LKMO-MRPRMN                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-MRPABN                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-MRPEXC                    PIC S9(5)V9(2) COMP-3.
               23 LKMO-PE0NAA.
               26 LKMO-EACMAH                    PIC S9(9) COMP-3.
               26 LKMO-FACMAH                    PIC S9(9) COMP-3.
               26 LKMO-CDPEINAA.
               29 LKMO-CACTIV2                   PIC X(3).
               29 LKMO-EACTPN3                   PIC S9(9) COMP-3.
               23 LKMO-PE0OAH.
               26 LKMO-EOPPOS                    PIC S9(9) COMP-3.
               26 LKMO-FOPPOS                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIOAH.
               29 LKMO-CNADES2                   PIC X(1).
               29 LKMO-NDESTI2                   PIC S9(7) COMP-3.
               23 LKMO-PE0OES.
               26 LKMO-EOAESE                    PIC S9(9) COMP-3.
               26 LKMO-FOAESE                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIOES.
               29 LKMO-CNADES3                   PIC X(1).
               29 LKMO-NDESTI3                   PIC S9(7) COMP-3.
               23 LKMO-PE0PAC.
               26 LKMO-EACCOM                    PIC S9(9) COMP-3.
               26 LKMO-FACCOM                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIPAC.
               29 LKMO-CACNAT                    PIC X(4).
                 88 LKMO-FL-CACNAT-PP              VALUE 'PP'.
                 88 LKMO-FL-CACNAT-CT              VALUE 'CT'.
                 88 LKMO-FL-CACNAT-CERM            VALUE 'CERM'.
                 88 LKMO-FL-CACNAT-CERP            VALUE 'CERP'.
                 88 LKMO-FL-CACNAT-CERS            VALUE 'CERS'.
               29 LKMO-CACETA                    PIC X(1).
                 88 LKMO-FL-CACETA-I               VALUE 'I'.
                 88 LKMO-FL-CACETA-R               VALUE 'R'.
               29 LKMO-YCORSA                    PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF          VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF          VALUE 'M'.
               29 LKMO-NCORS1                    PIC S9(7) COMP-3.
               23 LKMO-PE0PAH.
               26 LKMO-EGESAH                    PIC S9(9) COMP-3.
               26 LKMO-FGESAH                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIPAH.
               29 LKMO-CGESAH                    PIC X(1).
                 88 LKMO-FL-CGESAH-A               VALUE 'A'.
                 88 LKMO-FL-CGESAH-T               VALUE 'T'.
               23 LKMO-CDPE0PEN.
               26 LKMO-DRDMPE                    PIC S9(9) COMP-3.
               26 LKMO-CRDMPN                    PIC X(1).
                 88 LKMO-FL-RCP-DEP                VALUE 'D'.
                 88 LKMO-FL-REPO-DE-LIQU-PERR      VALUE 'R'.
                 88 LKMO-FL-NO-RECU-PERR           VALUE 'N'.
                 88 LKMO-FL-CRDMPN-M               VALUE 'M'.
               23 LKMO-PE0RAL.
               26 LKMO-RALDEB                    PIC S9(9) COMP-3.
               26 LKMO-RALFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIRAL.
               29 LKMO-EAVPAF                    PIC S9(9) COMP-3.
               29 LKMO-CAVPAF                    PIC X(1).
                 88 LKMO-FL-CAVPAF-A               VALUE 'A'.
                 88 LKMO-FL-CAVPAF-D               VALUE 'D'.
               29 LKMO-CETPAF                    PIC X(1).
                 88 LKMO-FL-CETPAF-P               VALUE 'P'.
                 88 LKMO-FL-CETPAF-A               VALUE 'A'.
                 88 LKMO-FL-CETPAF-U               VALUE 'U'.
                 88 LKMO-FL-CETPAF-F               VALUE 'F'.
               23 LKMO-PE0RD0.
               26 LKMO-EPTPAY                    PIC S9(9) COMP-3.
               26 LKMO-FPTPAY                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIRD0.
               29 LKMO-DDPTRF                    PIC S9(9) COMP-3.
               29 LKMO-QJRTFP                    PIC S9(3) COMP-3.
               29 LKMO-QJRTRQ                    PIC S9(3) COMP-3.
               23 LKMO-PE0RSD.
               26 LKMO-ERESPN                    PIC S9(9) COMP-3.
               26 LKMO-FRESPX                    PIC S9(9) COMP-3.
               26 LKMO-CDPEIRSD.
               29 LKMO-CRESPN                    PIC X(2).
                 88 LKMO-FL-MTPL-SAUF-IDF          VALUE 'M0'.
                 88 LKMO-FL-DOM-RES                VALUE 'M2'.
                 88 LKMO-FL-ASML-TRDE-EN-CE        VALUE 'M3'.
                 88 LKMO-FL-ASML-TRDE-HORS-CE      VALUE 'M4'.
                 88 LKMO-FL-ETBL-BELG-AA-COTO      VALUE 'M5'.
                 88 LKMO-FL-HAE-CE-OU-HOCE         VALUE 'M6'.
                 88 LKMO-FL-CE-HORS-FRA-AUSI       VALUE 'M7'.
                 88 LKMO-FL-ETR-HORS-CEE-AUSI      VALUE 'M8'.
                 88 LKMO-FL-ETR-FAM-FRA            VALUE 'M9'.
                 88 LKMO-FL-ETR-FAM-SANS-PF        VALUE 'MA'.
                 88 LKMO-FL-ACC-PAR-DET            VALUE 'MB'.
               29 LKMO-CTSEJE                    PIC X(2).
                 88 LKMO-FL-SANT-RES               VALUE '10'.
                 88 LKMO-FL-ETUD-BOUR-RES          VALUE '11'.
                 88 LKMO-FL-APP-LANG-RES           VALUE '12'.
                 88 LKMO-FL-STAG-FORM-PROF         VALUE '13'.
                 88 LKMO-FL-APP-RES                VALUE '14'.
                 88 LKMO-FL-AUTR-RES               VALUE '15'.
                 88 LKMO-FL-ETUD-NON-BOUR-RES      VALUE '16'.
               29 LKMO-CPYRES                    PIC X(2).
                 88 LKMO-FL-CPYRES-UE-1            VALUE 'AT' 'BE' 'BG'
           'CY' 'CZ' 'DE' 'DK' 'EE' 'ES' 'FI' 'GB' 'GR'.
                 88 LKMO-FL-CPYRES-UE-2            VALUE 'HU' 'IE' 'IT'
           'LT' 'LU' 'LV' 'MT' 'NL' 'PL' 'PT' 'RO' 'SE'.
                 88 LKMO-FL-CPYRES-UE-3            VALUE 'SI' 'SK' 'HR'.
                 88 LKMO-FL-CPYRES-EEE             VALUE 'IS' 'LI' 'NO'.
                 88 LKMO-FL-CPYRES-SUISSE          VALUE 'CH'.
               23 LKMO-PE0SAI.
               26 LKMO-EWCASA                    PIC S9(9) COMP-3.
               26 LKMO-FWCASA                    PIC S9(9) COMP-3.
               26 LKMO-CDPEISAI.
               29 LKMO-CASETI                    PIC X(1).
                 88 LKMO-FL-COND-ADMF              VALUE 'O'.
                 88 LKMO-FL-COND-ADMF-NO-REMP      VALUE 'N'.
               23 LKMO-PE0SEJ.
               26 LKMO-ETISEJ                    PIC S9(9) COMP-3.
               26 LKMO-FTISEJ                    PIC S9(9) COMP-3.
               26 LKMO-CDPEISEJ.
               29 LKMO-CNATSE                    PIC X(3).
                 88 LKMO-FL-TIS-AVP                VALUE 'AVP'.
                 88 LKMO-FL-TIS-ENT-REG            VALUE 'ERG'.
                 88 LKMO-FL-TIS-NON-DRO            VALUE 'NDR'.
                 88 LKMO-FL-TIS-LOG-PF             VALUE 'PFL'.
                 88 LKMO-FL-TIS-TOU-PRE            VALUE 'TTP'.
                 88 LKMO-FL-TIS-SAUF-RMI           VALUE 'TTM'.
                 88 LKMO-FL-TIS-RMI                VALUE 'RMI'.
                 88 LKMO-FL-CNATSE-TTV             VALUE 'TTV'.
                 88 LKMO-FL-CNATSE-RSA             VALUE 'RSA'.
                 88 LKMO-FL-CNATSE-PPA             VALUE 'PPA'.
                 88 LKMO-FL-CNATSE-PAM             VALUE 'PAM'.
               23 LKMO-PE0SRP.
               26 LKMO-ESUCPA                    PIC S9(9) COMP-3.
               26 LKMO-FSUCPA                    PIC S9(9) COMP-3.
               26 LKMO-CDPEISRP.
               29 LKMO-CPECSU                    PIC X(1).
                 88 LKMO-FL-CPECSU-L               VALUE 'L'.
                 88 LKMO-FL-CPECSU-S               VALUE 'S'.
               29 LKMO-CORCPA                    PIC X(2).
                 88 LKMO-FL-CORCPA-IA              VALUE 'IA'.
                 88 LKMO-FL-CORCPA-CG              VALUE 'CG'.
               29 LKMO-QMOCPA                    PIC S9(3) COMP-3.
               29 LKMO-CNAPRS                    PIC X(3).
                 
               23 LKMO-PE0SUS.
               26 LKMO-ESUSPN                    PIC S9(9) COMP-3.
               26 LKMO-FSUSPN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEISUS.
               29 LKMO-CSUSPN                    PIC X(1).
                 88 LKMO-FL-AUTR-MTF-SUS           VALUE 'A'.
                 88 LKMO-FL-CSUSPN-B               VALUE 'B'.
                 88 LKMO-FL-CTRL-CHRG-ENF-SUS      VALUE 'C'.
                 88 LKMO-FL-CTRL-RSDT-ENF-SUS      VALUE 'R'.
                 88 LKMO-FL-CSUSPN-E               VALUE 'E'.
                 88 LKMO-FL-CSUSPN-G               VALUE 'G'.
                 88 LKMO-FL-CSUSPN-V               VALUE 'V'.
               23 LKMO-PE0TAG.
               26 LKMO-ETRIAG                    PIC S9(9) COMP-3.
               26 LKMO-FTRIAG                    PIC S9(9) COMP-3.
               26 LKMO-CDPEITAG.
               29 LKMO-TAUXAG                    PIC X(3).
                 88 LKMO-FL-AGED-75                VALUE '075'.
                 88 LKMO-FL-AGED-50                VALUE '050'.
                 88 LKMO-FL-AGED-MI                VALUE 'MIN'.
                 88 LKMO-FL-AGED-75-MAIN           VALUE '75M'.
                 88 LKMO-FL-AGED-50-MAIN           VALUE '50M'.
                 88 LKMO-FL-AGED-75-SAI            VALUE '75S'.
                 88 LKMO-FL-AGED-50-SAI            VALUE '50S'.
               23 LKMO-PE0TPA.
               26 LKMO-TPADEB                    PIC S9(9) COMP-3.
               26 LKMO-TPAFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEITPA.
               29 LKMO-DACTNA                    PIC S9(9) COMP-3.
               29 LKMO-CTPAYS                    PIC X(1).
                 88 LKMO-FL-FRAN-TPA               VALUE 'F'.
                 88 LKMO-FL-CE-TPA                 VALUE 'C'.
                 88 LKMO-FL-AUTR-TPA               VALUE 'A'.
               29 LKMO-CNATIO                    PIC X(2).
                 88 LKMO-FL-CNATIO-UE-1            VALUE 'AT' 'BE' 'BG'
           'CY' 'CZ' 'DE' 'DK' 'EE' 'ES' 'FI' 'FR' 'GB'.
                 88 LKMO-FL-CNATIO-UE-2            VALUE 'GR' 'HU' 'IE'
           'IT' 'LT' 'LU' 'LV' 'MT' 'NL' 'PL' 'PT' 'RO'.
                 88 LKMO-FL-CNATIO-UE-3            VALUE 'SE' 'SI' 'SK'.
                 88 LKMO-FL-CNATIO-EEE             VALUE 'IS' 'LI' 'NO'.
               23 LKMO-PE0TPE.
               26 LKMO-TPEDEB                    PIC S9(9) COMP-3.
               26 LKMO-TPEFIN                    PIC S9(9) COMP-3.
               26 LKMO-CDPEITPE.
               29 LKMO-CTAPAR                    PIC X(3).
                 88 LKMO-FL-CTAPAR-TX1             VALUE 'TX1'.
                 88 LKMO-FL-CTAPAR-TX2             VALUE 'TX2'.
               17 LKMO-CGPEPOS.
               20 LKMO-CGPOSRES.
               23 LKMO-RESS-IBAN03               PIC S9(3) COMP-3.
               20 LKMO-CGPOSJUG.
               23 LKMO-JUG-IBAN03                PIC S9(3) COMP-3.
               17 LKMO-CGDEMAN.
               20 LKMO-CGDMASF.
               23 LKMO-DSF-DDMASF                PIC S9(9) COMP-3.
               23 LKMO-DSF-CCH1PA                PIC X(1).
             11 LKMO-RESSOURCES
                            OCCURS 013 TIMES
                            INDEXED BY IX-PERSS.
               14 LKMO-CGPE0RES
                            OCCURS 011 TIMES
                            INDEXED BY IX-CPR1.
               17 LKMO-CPTRSA                    PIC X(1).
                 88 LKMO-FL-ANN-REP                VALUE 'A'.
                 88 LKMO-FL-REP-ANN-BIC            VALUE 'B'.
                 88 LKMO-FL-TRI-API-REP            VALUE 'T'.
                 88 LKMO-FL-TRI-RMI-REP            VALUE 'R'.
                 88 LKMO-FL-TRI-AGD-REP            VALUE 'G'.
                 88 LKMO-FL-PER-EVA-NOU            VALUE 'N'.
                 88 LKMO-FL-MENS-REP               VALUE 'M'.
                 88 LKMO-FL-MENS-AGD               VALUE 'D'.
                 88 LKMO-FL-CPTRSA-API             VALUE 'F'.
                 88 LKMO-FL-EVA-REP                VALUE 'E'.
                 88 LKMO-FL-PER-EVA-CAT            VALUE 'C'.
                 88 LKMO-FL-PER-GR                 VALUE 'H'.
                 88 LKMO-FL-CPTRSA-J               VALUE 'J'.
                 88 LKMO-FL-CPTRSA-L               VALUE 'L'.
                 88 LKMO-FL-PER-CAR-RMI            VALUE 'Q'.
                 88 LKMO-FL-PER-CUM-PEN            VALUE 'P'.
                 88 LKMO-FL-ANN-AVT-TDF            VALUE 'Z'.
                 88 LKMO-FL-CPTRSA-Y               VALUE 'Y'.
                 88 LKMO-FL-CPTRSA-I               VALUE 'I'.
                 88 LKMO-FL-CPTRSA-K               VALUE 'K'.
                 88 LKMO-FL-CPTRSA-S               VALUE 'S'.
                 88 LKMO-FL-CPTRSA-U               VALUE 'U'.
                 88 LKMO-FL-CPTRSA-V               VALUE 'V'.
                 88 LKMO-FL-CPTRSA-W               VALUE 'W'.
                 88 LKMO-FL-CPTRSA-X               VALUE 'X'.
                 88 LKMO-FL-CPTRSA-O               VALUE 'O'.
                 88 LKMO-FL-CPTRSA-1               VALUE '1'.
               17 LKMO-INDRES                    PIC 9(1).
               17 LKMO-RESSOURC.
               20 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               20 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               20 LKMO-CGPERRES.
               23 LKMO-CORRES                    PIC X(1).
                 88 LKMO-FL-CORRES-D               VALUE 'D'.
                 88 LKMO-FL-CORRES-T               VALUE 'T'.
                 88 LKMO-FL-CORRES-W               VALUE 'W'.
                 88 LKMO-FL-CORRES-L               VALUE 'L'.
                 88 LKMO-FL-CORRES-V               VALUE 'V'.
                 88 LKMO-FL-CORRES-S               VALUE 'S'.
                 88 LKMO-FL-CORRES-C               VALUE 'C'.
                 88 LKMO-FL-CORRES-G               VALUE 'G'.
                 88 LKMO-FL-CORRES-H               VALUE 'H'.
               23 LKMO-ERARES                    PIC S9(9) COMP-3.
               23 LKMO-NAT-RESS
                            OCCURS 012 TIMES
                            INDEXED BY IX-RES1.
               26 LKMO-CNARES                    PIC X(3).
                 88 LKMO-FL-RES-NUL                VALUE '000'.
                 88 LKMO-FL-PA-VER                 VALUE '060'.
                 
               26 LKMO-MTREPN                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-TRESPN                    PIC S9(3)V9(2) COMP-3.
               26 LKMO-QM2JAR                    PIC S9(5) COMP-3.
               26 LKMO-QHREPN                    PIC S9(3) COMP-3.
               26 LKMO-CDEVIS                    PIC X(2).
                 88 LKMO-FL-DEV-DAN                VALUE 'CD'.
                 88 LKMO-FL-CDEVIS-CE              VALUE 'CE'.
                 88 LKMO-FL-CDEVIS-CQ              VALUE 'CQ'.
                 88 LKMO-FL-MARK                   VALUE 'DM'.
                 88 LKMO-FL-DEV-GRE                VALUE 'DG'.
                 88 LKMO-FL-DEV-POR                VALUE 'EP'.
                 88 LKMO-FL-DEV-EUR                VALUE 'EU'.
                 88 LKMO-FL-DEV-NEE                VALUE 'FN'.
                 88 LKMO-FL-FR-BELG                VALUE 'FB'.
                 88 LKMO-FL-FR-SUIS                VALUE 'FS'.
                 88 LKMO-FL-LIVR                   VALUE 'LS'.
                 88 LKMO-FL-DEV-IRL                VALUE 'LR'.
                 88 LKMO-FL-DEV-ITA                VALUE 'LT'.
                 88 LKMO-FL-DEV-ESP                VALUE 'PE'.
                 88 LKMO-FL-DEV-ISL                VALUE 'CI'.
                 88 LKMO-FL-DEV-NOR                VALUE 'CN'.
                 88 LKMO-FL-DEV-SUE                VALUE 'CS'.
                 88 LKMO-FL-DEV-FIN                VALUE 'MF'.
                 88 LKMO-FL-DEV-AUT                VALUE 'SA'.
                 88 LKMO-FL-CDEVIS-CT              VALUE 'CT'.
                 88 LKMO-FL-CDEVIS-FH              VALUE 'FH'.
                 88 LKMO-FL-CDEVIS-ZP              VALUE 'ZP'.
                 88 LKMO-FL-CDEVIS-LO              VALUE 'LO'.
                 88 LKMO-FL-CDEVIS-LL              VALUE 'LL'.
                 88 LKMO-FL-CDEVIS-LB              VALUE 'LB'.
                 88 LKMO-FL-CDEVIS-LU              VALUE 'LU'.
                 88 LKMO-FL-CDEVIS-ZONE-EURO       VALUE 'PE' 'EP' 'LT'
           'SA' 'DM' 'FN' 'LR' 'MF' 'FB' 'DG'.
                 88 LKMO-FL-CDEVIS-DA              VALUE 'DA'.
                 88 LKMO-FL-CDEVIS-ES              VALUE 'ES'.
                 88 LKMO-FL-CDEVIS-CF              VALUE 'CF'.
                 88 LKMO-FL-CDEVIS-AR              VALUE 'AR'.
                 88 LKMO-FL-CDEVIS-UM              VALUE 'UM'.
               26 LKMO-MTREPN1                   PIC S9(7)V9(2) COMP-3.
               14 LKMO-CGPE0EVA.
               17 LKMO-NFICPN                    PIC S9(7) COMP-3.
               17 LKMO-CGPEREVA
                            OCCURS 005 TIMES
                            INDEXED BY IX-EVA2.
               20 LKMO-INDEVA                    PIC 9(1).
               20 LKMO-CPTRSA                    PIC X(1).
                 88 LKMO-FL-ANN-REP                VALUE 'A'.
                 88 LKMO-FL-REP-ANN-BIC            VALUE 'B'.
                 88 LKMO-FL-TRI-API-REP            VALUE 'T'.
                 88 LKMO-FL-TRI-RMI-REP            VALUE 'R'.
                 88 LKMO-FL-TRI-AGD-REP            VALUE 'G'.
                 88 LKMO-FL-PER-EVA-NOU            VALUE 'N'.
                 88 LKMO-FL-MENS-REP               VALUE 'M'.
                 88 LKMO-FL-MENS-AGD               VALUE 'D'.
                 88 LKMO-FL-CPTRSA-API             VALUE 'F'.
                 88 LKMO-FL-EVA-REP                VALUE 'E'.
                 88 LKMO-FL-PER-EVA-CAT            VALUE 'C'.
                 88 LKMO-FL-PER-GR                 VALUE 'H'.
                 88 LKMO-FL-CPTRSA-J               VALUE 'J'.
                 88 LKMO-FL-CPTRSA-L               VALUE 'L'.
                 88 LKMO-FL-PER-CAR-RMI            VALUE 'Q'.
                 88 LKMO-FL-PER-CUM-PEN            VALUE 'P'.
                 88 LKMO-FL-ANN-AVT-TDF            VALUE 'Z'.
                 88 LKMO-FL-CPTRSA-Y               VALUE 'Y'.
                 88 LKMO-FL-CPTRSA-I               VALUE 'I'.
                 88 LKMO-FL-CPTRSA-K               VALUE 'K'.
                 88 LKMO-FL-CPTRSA-S               VALUE 'S'.
                 88 LKMO-FL-CPTRSA-U               VALUE 'U'.
                 88 LKMO-FL-CPTRSA-V               VALUE 'V'.
                 88 LKMO-FL-CPTRSA-W               VALUE 'W'.
                 88 LKMO-FL-CPTRSA-X               VALUE 'X'.
                 88 LKMO-FL-CPTRSA-O               VALUE 'O'.
                 88 LKMO-FL-CPTRSA-1               VALUE '1'.
               20 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               20 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               20 LKMO-CDRESEVA.
               23 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               23 LKMO-CNARES1                   PIC X(3).
                 88 LKMO-FL-STA-ANN-ETI            VALUE '030' '031'.
                 88 LKMO-FL-STA-ANN-AGR            VALUE '032' '033'.
                
               23 LKMO-MAEVFO                    PIC S9(7)V9(2) COMP-3.
               23 LKMO-MMSEVF                    PIC S9(7)V9(2) COMP-3.
               23 LKMO-CDEVA003                  PIC S9(3)V9(2) COMP-3.
               23 LKMO-DMOIEF                    PIC S9(9) COMP-3.
               14 LKMO-CGPE0RAB
                            OCCURS 002 TIMES
                            INDEXED BY IX-CPR2.
               17 LKMO-CPTRSA                    PIC X(1).
                 88 LKMO-FL-ANN-REP                VALUE 'A'.
                 88 LKMO-FL-REP-ANN-BIC            VALUE 'B'.
                 88 LKMO-FL-TRI-API-REP            VALUE 'T'.
                 88 LKMO-FL-TRI-RMI-REP            VALUE 'R'.
                 88 LKMO-FL-TRI-AGD-REP            VALUE 'G'.
                 88 LKMO-FL-PER-EVA-NOU            VALUE 'N'.
                 88 LKMO-FL-MENS-REP               VALUE 'M'.
                 88 LKMO-FL-MENS-AGD               VALUE 'D'.
                 88 LKMO-FL-CPTRSA-API             VALUE 'F'.
                 88 LKMO-FL-EVA-REP                VALUE 'E'.
                 88 LKMO-FL-PER-EVA-CAT            VALUE 'C'.
                 88 LKMO-FL-PER-GR                 VALUE 'H'.
                 88 LKMO-FL-CPTRSA-J               VALUE 'J'.
                 88 LKMO-FL-CPTRSA-L               VALUE 'L'.
                 88 LKMO-FL-PER-CAR-RMI            VALUE 'Q'.
                 88 LKMO-FL-PER-CUM-PEN            VALUE 'P'.
                 88 LKMO-FL-ANN-AVT-TDF            VALUE 'Z'.
                 88 LKMO-FL-CPTRSA-Y               VALUE 'Y'.
                 88 LKMO-FL-CPTRSA-I               VALUE 'I'.
                 88 LKMO-FL-CPTRSA-K               VALUE 'K'.
                 88 LKMO-FL-CPTRSA-S               VALUE 'S'.
                 88 LKMO-FL-CPTRSA-U               VALUE 'U'.
                 88 LKMO-FL-CPTRSA-V               VALUE 'V'.
                 88 LKMO-FL-CPTRSA-W               VALUE 'W'.
                 88 LKMO-FL-CPTRSA-X               VALUE 'X'.
                 88 LKMO-FL-CPTRSA-O               VALUE 'O'.
                 88 LKMO-FL-CPTRSA-1               VALUE '1'.
               17 LKMO-INDRAB                    PIC 9(1).
               17 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               17 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               17 LKMO-ABATTEMENT.
               20 LKMO-CGPERRAB
                            OCCURS 005 TIMES
                            INDEXED BY IX-RES2.
               23 LKMO-CNARES2                   PIC X(3).
               23 LKMO-MABDPR                    PIC S9(5)V9(2) COMP-3.
               23 LKMO-CWARRA                    PIC X(1).
                 88 LKMO-FL-NEUT                   VALUE 'N'.
                 88 LKMO-FL-ABAT-SAD-PREF          VALUE 'A'.
                 88 LKMO-FL-ABAT-ATDE-PREF         VALUE 'S'.
                 88 LKMO-FL-RMI-REF-PRE            VALUE 'R'.
             11 LKMO-DETAIL-DOSSIER-MOIS.
               14 LKMO-CDDOIZZZ.
               17 LKMO-NDOPFE                    PIC X(15).
               17 LKMO-CLCNDO                    PIC X(1).
               17 LKMO-DIDAFF                    PIC S9(9) COMP-3.
               17 LKMO-DLVCPR                    PIC S9(9) COMP-3.
               17 LKMO-CIUGES                    PIC X(2).
               17 LKMO-D1ODPL                    PIC S9(9) COMP-3.
               17 LKMO-CSESOC                    PIC X(4).
               17 LKMO-CAPRES                    PIC X(2).
                 88 LKMO-FL-PAS-APEL-A-FAIR        VALUE '00'.
                 88 LKMO-FL-APEL-A-FAIR-RESS       VALUE '01'.
                 88 LKMO-FL-RELA-PF-SAUF-APL       VALUE '02'.
                 88 LKMO-FL-APEL-RECU              VALUE '03'.
                 88 LKMO-FL-PAS-RELA-SS-RESS       VALUE '04'.
                 88 LKMO-FL-RELA-APL-SAUF-OHE      VALUE '05'.
                 88 LKMO-FL-RELA-OHE-POTI          VALUE '07'.
                 88 LKMO-FL-CAPRES-08              VALUE '08'.
                 88 LKMO-FL-CAPRES-09              VALUE '09'.
                 88 LKMO-FL-CAPRES-10              VALUE '10'.
               17 LKMO-DMCDOS                    PIC S9(9) COMP-3.
               17 LKMO-CSTACP                    PIC X(1).
                 88 LKMO-FL-STAB                   VALUE '0'.
                 88 LKMO-FL-ISTA                   VALUE '1'.
                 88 LKMO-FL-LIQU-CVER-EN-CRS       VALUE '2'.
                 88 LKMO-FL-VERI-EN-CRS            VALUE '3'.
                 88 LKMO-FL-TRT-BATC-EN-CRS        VALUE '4'.
               17 LKMO-CUNGES                    PIC X(7).
               17 LKMO-CMETRA                    PIC X(1).
               17 LKMO-DANARS                    PIC S9(9) COMP-3.
               17 LKMO-DDECRA                    PIC S9(9) COMP-3.
               17 LKMO-DNOTPA                    PIC S9(9) COMP-3.
               17 LKMO-DDECAL                    PIC S9(9) COMP-3.
               17 LKMO-DMOCGM                    PIC S9(9) COMP-3.
               17 LKMO-DAPRES                    PIC S9(9) COMP-3.
               17 LKMO-DRERES                    PIC S9(9) COMP-3.
               17 LKMO-DMAJDO                    PIC S9(9) COMP-3.
               17 LKMO-DNDPOT                    PIC S9(9) COMP-3.
               17 LKMO-CONFID                    PIC X(4).
                 88 LKMO-FL-CONFID-RAZR            VALUE 'RAZR'.
               17 LKMO-COEFFK                    PIC X(1).
               17 LKMO-CORGIM                    PIC X(3).
               17 LKMO-CONFOR                    PIC X(1).
                 88 LKMO-FL-FOR-CONV               VALUE 'C'.
                 88 LKMO-FL-FOR-TECH               VALUE 'T'.
                 88 LKMO-FL-FOR-DEUX               VALUE 'D'.
               17 LKMO-DOHEIX                    PIC S9(9) COMP-3.
               17 LKMO-CTIMCO                    PIC X(2).
                 88 LKMO-FL-CTIMCO-BS              VALUE 'MA' 'TN'.
                 88 LKMO-FL-CTIMCO-RAT             VALUE 'AL' 'MA' 'TN'.
                 88 LKMO-FL-CTIMCO-CHOIN           VALUE 'AL' 'MA' 'TN'.
               17 LKMO-DEPAJE                    PIC S9(9) COMP-3.
               17 LKMO-DAPLMA                    PIC S9(9) COMP-3.
               17 LKMO-DBARSA                    PIC S9(9) COMP-3.
               17 LKMO-CTYBAS                    PIC X(1).
                 88 LKMO-FL-CTYBAS-D               VALUE 'D'.
                 88 LKMO-FL-CTYBAS-P               VALUE 'P'.
                 88 LKMO-FL-CTYBAS-T               VALUE 'T'.
                 88 LKMO-FL-CTYBAS-E               VALUE 'E'.
               17 LKMO-DMJDCP                    PIC S9(9) COMP-3.
               17 LKMO-HMJDCP                    PIC S9(7) COMP-3.
               17 LKMO-CORIMM                    PIC X(3).
                 88 LKMO-FL-CORIMM-TEC             VALUE 'TEC'.
                 88 LKMO-FL-CORIMM-WEB             VALUE 'WEB'.
               17 LKMO-DINCRA                    PIC S9(9) COMP-3.
               14 LKMO-CGDOH1
                            OCCURS 003 TIMES
                            INDEXED BY IX-DOS.
               17 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               17 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               17 LKMO-CGDOHIND.
               20 LKMO-INDAIA                    PIC 9(1).
               20 LKMO-INDAMI                    PIC 9(1).
               20 LKMO-INDAOH                    PIC 9(1).
               20 LKMO-INDAOR                    PIC 9(1).
               20 LKMO-INDAPR                    PIC 9(1).
               20 LKMO-INDASX                    PIC 9(1).
               20 LKMO-INDBEF                    PIC 9(1).
               20 LKMO-INDCCA                    PIC 9(1).
               20 LKMO-INDCLG                    PIC 9(1).
               20 LKMO-INDCPI                    PIC 9(1).
               20 LKMO-INDCRE                    PIC 9(1).
               20 LKMO-INDCRM                    PIC 9(1).
               20 LKMO-INDDAR                    PIC 9(1).
               20 LKMO-INDEEO                    PIC 9(1).
               20 LKMO-INDLIM                    PIC 9(1).
               20 LKMO-INDMCF                    PIC 9(1).
               20 LKMO-INDMGC                    PIC 9(1).
               20 LKMO-INDMGJ                    PIC 9(1).
               20 LKMO-INDMGP                    PIC 9(1).
               20 LKMO-INDMSD                    PIC 9(1).
               20 LKMO-INDNEC                    PIC 9(1).
               20 LKMO-INDOLG                    PIC 9(1).
               20 LKMO-INDPLP                    PIC 9(1).
               20 LKMO-INDQFA                    PIC 9(1).
               20 LKMO-INDQFR                    PIC 9(1).
               20 LKMO-INDQFV                    PIC 9(1).
               20 LKMO-INDQUI                    PIC 9(1).
               20 LKMO-INDRNG                    PIC 9(1).
               20 LKMO-INDRSF                    PIC 9(1).
               20 LKMO-INDSDO                    PIC 9(1).
               20 LKMO-INDSUR                    PIC 9(1).
               20 LKMO-INDTIE                    PIC 9(1).
               20 LKMO-INDTIT                    PIC 9(1).
               17 LKMO-CGDOHGDD.
               20 LKMO-DO0AOH.
               23 LKMO-ECRHLO                    PIC S9(9) COMP-3.
               23 LKMO-FINAOH                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIAOH.
               26 LKMO-CRHLOG                    PIC X(3).
                 88 LKMO-FL-CRHLOG-IND             VALUE 'IND'.
                 88 LKMO-FL-CRHLOG-DEP             VALUE 'DEP'.
                 88 LKMO-FL-CRHLOG-OLI             VALUE 'OLI'.
               20 LKMO-DO0AOR.
               23 LKMO-DEBAOR                    PIC S9(9) COMP-3.
               23 LKMO-FINAOR                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIAOR.
               26 LKMO-EWAFOC                    PIC S9(9) COMP-3.
               26 LKMO-CWOCLG                    PIC X(3).
                 88 LKMO-FL-HEBE-CLTI-A-TIGR       VALUE 'HCG'.
                 88 LKMO-FL-HEBE-CLTI-A-TION       VALUE 'HCO'.
                 88 LKMO-FL-HATG-PAR-PTCU          VALUE 'HGP'.
                 88 LKMO-FL-LOCT-OU-SLOC           VALUE 'LOC'.
                 88 LKMO-FL-HOT                    VALUE 'HOT'.
                 88 LKMO-FL-PROP-AV-CHRG-RBMT      VALUE 'ACC'.
                 88 LKMO-FL-PROP-SS-CHRG-RBMT      VALUE 'PRO'.
                 88 LKMO-FL-HE-ONER-PACU           VALUE 'HOP'.
                 88 LKMO-FL-SANS-RES-ONE           VALUE 'SRO'.
                 88 LKMO-FL-SANS-RES-GRA           VALUE 'SRG'.
                
                 88 LKMO-FL-RMI-AL-AUT             VALUE 'BAL'.
                 88 LKMO-FL-CWOCLG-OLI             VALUE 'OLI'.
               26 LKMO-CNAREF1                   PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF1         VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF1         VALUE 'M'.
               26 LKMO-NREFER1                   PIC S9(7) COMP-3.
               20 LKMO-DO0APR.
               23 LKMO-EWAVPR                    PIC S9(9) COMP-3.
               23 LKMO-FWAVPR                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0APR.
               26 LKMO-DAVIPR                    PIC S9(9) COMP-3.
               26 LKMO-CWEDOS                    PIC X(2).
                 88 LKMO-FL-ACC-PREF               VALUE 'AP'.
                 88 LKMO-FL-REFU-PREF              VALUE 'RP'.
                 88 LKMO-FL-REFU-CAF               VALUE 'RC'.
                 88 LKMO-FL-POSU                   VALUE 'PS'.
                 88 LKMO-FL-PROR                   VALUE 'PR'.
                 88 LKMO-FL-FIN-DE-DRT-PREF        VALUE 'FD'.
                 88 LKMO-FL-AJNM                   VALUE 'AJ'.
                 88 LKMO-FL-RNVL-RMI               VALUE 'RN'.
                 88 LKMO-FL-ACCO-OK                VALUE 'AP' 'PS' 'PR'
           'RN'.
               26 LKMO-DCOMPR                    PIC S9(9) COMP-3.
               20 LKMO-DO0ASX.
               23 LKMO-DEBASX                    PIC S9(9) COMP-3.
               23 LKMO-FINASX                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIASX.
               26 LKMO-MASREX                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-DO0BEF.
               23 LKMO-EBAMRE1                   PIC S9(9) COMP-3.
               23 LKMO-FBAMRE1                   PIC S9(9) COMP-3.
               23 LKMO-CDDO0BEF.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MEFOYE                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MDEBEV                    PIC S9(7)V9(2) COMP-3.
               20 LKMO-DO0CCA.
               23 LKMO-ECOMPC                    PIC S9(9) COMP-3.
               23 LKMO-FCOMPC                    PIC S9(9) COMP-3.
               23 LKMO-CDDOICCA.
               26 LKMO-CCOMPC                    PIC X(3).
                 88 LKMO-FL-CCOMPC-COP             VALUE 'COP'.
                 88 LKMO-FL-CCOMPC-CNP             VALUE 'CNP'.
               26 LKMO-CMFCOM                    PIC X(3).
                 88 LKMO-FL-CMFCOM-AUT             VALUE 'AUT'.
                 88 LKMO-FL-CMFCON-ERA             VALUE 'ERA'.
                 88 LKMO-FL-CMFCOM-DES             VALUE 'DES'.
                 88 LKMO-FL-CMFCOM-DFA             VALUE 'DFA'.
                 88 LKMO-FL-CMFCOM-NAT             VALUE 'NAT'.
                 88 LKMO-FL-CMFCOM-RFA             VALUE 'RFA'.
                 88 LKMO-FL-CMFCOM-SEP             VALUE 'SEP'.
               26 LKMO-CEDCES                    PIC X(1).
                 88 LKMO-FL-CEDCES-O               VALUE 'O'.
                 88 LKMO-FL-CEDCES-N               VALUE 'N'.
               20 LKMO-DO0CLG.
               23 LKMO-EMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-FMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-CDDOICLG.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MCHALO                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-DO0CPI.
               23 LKMO-EMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-FMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0CPI.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MFALAP                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MPFAPI                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MFALRF                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MRMAPI                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MCAVPI                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MSANPI                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MAPIRE                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-DO0CRE.
               23 LKMO-EBAMRE                    PIC S9(9) COMP-3.
               23 LKMO-FBAMRE                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0CRE.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MBMRFO                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MDEBRE                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MFIBRE                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MFILOG                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-DO0CRM.
               23 LKMO-EMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-FMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0CRM.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MASRES                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MRESPF                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MFORAL                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MPLAFO                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MONRMA                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MONCAV                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MASFID                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MPAFID                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-MRMIRE                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-DO0DAR.
               23 LKMO-EBAMRE                    PIC S9(9) COMP-3.
               23 LKMO-FBAMRE                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0DAR.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MABRES                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MABDAC                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MARPAP                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MAEPAP                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MRFRGA                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MEFRGA                    PIC S9(7)V9(2) COMP-3.
               20 LKMO-DO0EEO.
               23 LKMO-EPOBPE                    PIC S9(9) COMP-3.
               23 LKMO-FPOBPE                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIEEO.
               26 LKMO-CPOBPE                    PIC X(1).
                 88 LKMO-FL-CPOBPE-O               VALUE 'O'.
                 88 LKMO-FL-CPOBPE-N               VALUE 'N'.
               20 LKMO-DO0LIM.
               23 LKMO-ELIMAT                    PIC S9(9) COMP-3.
               23 LKMO-FLIMAT                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0LIM.
               26 LKMO-CTLMAT                    PIC X(3).
                 88 LKMO-FL-CELI                   VALUE 'CEL'.
                 88 LKMO-FL-MARG                   VALUE 'MAR'.
                 88 LKMO-FL-VIE-MART               VALUE 'VIM'.
                 88 LKMO-FL-CTLMAT-PAC             VALUE 'PAC'.
                 88 LKMO-FL-DIVO                   VALUE 'DIV'.
                 88 LKMO-FL-VEUV                   VALUE 'VEU'.
                 88 LKMO-FL-SEPA-DE-FAIT           VALUE 'SEF'.
                 88 LKMO-FL-SEPA-LEGA              VALUE 'SEL'.
                 88 LKMO-FL-ABAN                   VALUE 'ABA'.
                 88 LKMO-FL-ISOL-AVM               VALUE 'ISO'.
                 88 LKMO-FL-RVC-SR-MARG            VALUE 'RVM'.
                 88 LKMO-FL-RVC-SR-MART            VALUE 'RVC'.
                 88 LKMO-FL-CTLMAT-RPA             VALUE 'RPA'.
                 
                 88 LKMO-FL-SIT-CELIBAT            VALUE 'CEL' 'ISO'.
                 88 LKMO-FL-SIT-SEPARE             VALUE 'SEF' 'SEL'.
               20 LKMO-DO0MCF.
               23 LKMO-DEBMCF                    PIC S9(9) COMP-3.
               23 LKMO-FINMCF                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIMCF.
               26 LKMO-MAJCFA                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-DO0MGC.
               23 LKMO-EMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-FMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIMGC.
               26 LKMO-MPLACU                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-QE03CU                    PIC S9(3) COMP-3.
               26 LKMO-ME03CU                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-QE36CU                    PIC S9(3) COMP-3.
               26 LKMO-ME36CU                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-DO0MGP.
               23 LKMO-ECMGPL                    PIC S9(9) COMP-3.
               23 LKMO-FCMGPL                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIMGP.
               26 LKMO-CPLCMG                    PIC X(1).
                 88 LKMO-FL-CPLACMG-A              VALUE 'A'.
                 88 LKMO-FL-CPLACMG-B              VALUE 'B'.
                 88 LKMO-FL-CPLACMG-C              VALUE 'C'.
                 88 LKMO-FL-CPLACMG-D              VALUE 'D'.
               26 LKMO-MPLACO                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-DO0MSD.
               23 LKMO-EMSIDO                    PIC S9(9) COMP-3.
               23 LKMO-FMSIDO                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0MSD.
               26 LKMO-CMSIDO                    PIC X(2).
                 88 LKMO-FL-PREM-AFFI              VALUE 'AF'.
                 88 LKMO-FL-AFFI-SUIT-MUTA         VALUE 'AM'.
                 88 LKMO-FL-REGR-DOSI              VALUE 'RD'.
                 88 LKMO-FL-TRPT                   VALUE 'AT'.
                 88 LKMO-FL-FIN-DRT                VALUE 'RF'.
                 88 LKMO-FL-RDT-MUTA               VALUE 'RM'.
                 88 LKMO-FL-REA-RAD-FDR            VALUE 'AR'.
                 88 LKMO-FL-TRFT-ENF               VALUE 'TE'.
                 88 LKMO-FL-RDT-SUSP               VALUE 'RS'.
                 88 LKMO-FL-AFF-PART               VALUE 'AP'.
                 88 LKMO-FL-RAD-REIM               VALUE 'RR'.
                 88 LKMO-FL-RAD-ORG                VALUE 'RO'.
                 88 LKMO-FL-RAD-PUR                VALUE 'RG'.
                 88 LKMO-FL-CMSIDO-AFF             VALUE 'AF' 'AR' 'RD'
           'TE'.
                 88 LKMO-FL-CMSIDO-MUT             VALUE 'AM' 'AP'.
               26 LKMO-CSITDO                    PIC X(1).
                 88 LKMO-FL-AFFL                   VALUE 'A'.
                 88 LKMO-FL-RADT                   VALUE 'R'.
                 88 LKMO-FL-AFFL-EN-CRS            VALUE 'C'.
                 88 LKMO-FL-CSITDO-P               VALUE 'P'.
               26 LKMO-CNAPRS                    PIC X(3).
                 
               26 LKMO-FILLER                    PIC X(1).
               20 LKMO-DO0NEC.
               23 LKMO-ENECCG                    PIC S9(9) COMP-3.
               23 LKMO-FNECCG                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0NEC.
               26 LKMO-QECCGO                    PIC S9(3) COMP-3.
               20 LKMO-DO0OLG.
               23 LKMO-EOCLOG                    PIC S9(9) COMP-3.
               23 LKMO-FOCLOG                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0OLG.
               26 LKMO-RLOGEM                    PIC S9(3) COMP-3.
               20 LKMO-DO0QFA.
               23 LKMO-EQIFAM                    PIC S9(9) COMP-3.
               23 LKMO-FQIFAM                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0QFA.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MQIFAM                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-QPARQF                    PIC S9(2)V9(1) COMP-3.
               26 LKMO-MASSQF                    PIC S9(7)V9(2) COMP-3.
               20 LKMO-DO0QFR.
               23 LKMO-EMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-FMOCRM                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIQFR.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-CDQFR000.
               29 LKMO-MQIFAM3                   PIC S9(5)V9(2) COMP-3.
               29 LKMO-QPARPR3                   PIC S9(2)V9(1) COMP-3.
               29 LKMO-MTRESS                    PIC S9(9)V9(2) COMP-3.
               29 LKMO-MTPRES                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-CORICH                    PIC X(1).
                 88 LKMO-FL-CORICH-P               VALUE 'P'.
                 88 LKMO-FL-CORICH-I               VALUE 'I'.
                 88 LKMO-FL-CORICH-F               VALUE 'F'.
                 88 LKMO-FL-CORICH-L               VALUE 'L'.
               29 LKMO-MCHLOG                    PIC S9(5)V9(2) COMP-3.
               29 LKMO-CORIQF                    PIC X(1).
                 88 LKMO-FL-CORIQF-QFC             VALUE 'C'.
                 88 LKMO-FL-CORIQF-QFF             VALUE 'F'.
               29 LKMO-CREPRP                    PIC X(1).
                 88 LKMO-FL-CREPRP-A               VALUE 'A'.
                 88 LKMO-FL-CREPRP-H               VALUE 'H'.
                 88 LKMO-FL-CREPRP-S               VALUE 'S'.
               20 LKMO-DO0QFV.
               23 LKMO-EQFAAV                    PIC S9(9) COMP-3.
               23 LKMO-FQFAAV                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0QFV.
               26 LKMO-CMOFOR                    PIC X(1).
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MQIFAM2                   PIC S9(5)V9(2) COMP-3.
               26 LKMO-QPARQF2                   PIC S9(2)V9(1) COMP-3.
               20 LKMO-DO0QUI.
               23 LKMO-EELTDQ                    PIC S9(9) COMP-3.
               23 LKMO-FELTDQ                    PIC S9(9) COMP-3.
               23 LKMO-CDDOIQUI.
               26 LKMO-QENFDQ                    PIC S9(3) COMP-3.
               26 LKMO-MTPFDQ                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MTFLDQ                    PIC S9(7)V9(2) COMP-3.
               26 LKMO-MTREDQ                    PIC S9(7)V9(2) COMP-3.
               20 LKMO-DO0RNG.
               23 LKMO-EBAMRE                    PIC S9(9) COMP-3.
               23 LKMO-FBAMRE                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0RNG.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MREFOY                    PIC S9(7)V9(2) COMP-3.
               20 LKMO-DO0RSF.
               23 LKMO-ERESFA                    PIC S9(9) COMP-3.
               23 LKMO-FRESFA                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0RSF.
               26 LKMO-CRESFA                    PIC X(2).
                 88 LKMO-FL-RSDT-SEPA              VALUE 'RS'.
                 88 LKMO-FL-CHRG-FAM               VALUE 'CF'.
               20 LKMO-DO0SDO.
               23 LKMO-ESUSDO                    PIC S9(9) COMP-3.
               23 LKMO-FSUSDO                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0SDO.
               26 LKMO-CSUSDO                    PIC X(1).
                 88 LKMO-FL-SITU-DE-FAM            VALUE 'A'.
                 88 LKMO-FL-RESS                   VALUE 'B'.
                 88 LKMO-FL-ENQE-ADMF              VALUE 'C'.
                 88 LKMO-FL-ENQE-SOC               VALUE 'D'.
                 88 LKMO-FL-ABS-IMP-CAMP-CTRL      VALUE 'E'.
                 88 LKMO-FL-IMP-CHCA-NO-FRNI       VALUE 'F'.
                 88 LKMO-FL-DECE-MME               VALUE 'G'.
                 88 LKMO-FL-DECE-MR                VALUE 'H'.
                 88 LKMO-FL-AUTR-MTF-DSU           VALUE 'I'.
                 88 LKMO-FL-DSU-AVEC-PAI           VALUE 'J'.
                 88 LKMO-FL-DSU-CTRL-ASS           VALUE 'K'.
                 88 LKMO-FL-DSU-NPAI               VALUE 'L'.
                 88 LKMO-FL-DSU-RES-INC            VALUE 'M'.
                 88 LKMO-FL-DSU-DIV-SANS-SUS       VALUE 'N'.
                 88 LKMO-FL-DSU-DIV-AVEC-SUS       VALUE 'O'.
                 88 LKMO-FL-DSU-ASF-HET            VALUE 'P'.
                 88 LKMO-FL-CSUSDO-Q               VALUE 'Q'.
                 88 LKMO-FL-CSUSDO-R               VALUE 'R'.
                 88 LKMO-FL-CSUSDO-S               VALUE 'S'.
                 88 LKMO-FL-CSUSDO-T               VALUE 'T'.
                 88 LKMO-FL-CSUSDO-U               VALUE 'U'.
                 88 LKMO-FL-CSUSDO-V               VALUE 'V'.
               20 LKMO-DO0TIT.
               23 LKMO-DEBTIT                    PIC S9(9) COMP-3.
               23 LKMO-FINTIT                    PIC S9(9) COMP-3.
               23 LKMO-CDDO0TIT.
               26 LKMO-DTPEDO                    PIC S9(9) COMP-3.
               26 LKMO-NFICPN                    PIC S9(7) COMP-3.
             11 LKMO-LOGEMENT.
               14 LKMO-RLOGEM                    PIC S9(3) COMP-3.
               14 LKMO-CDLOGZZZ.
               17 LKMO-DCONVE                    PIC S9(9) COMP-3.
               17 LKMO-CPGLGT                    PIC X(5).
               17 LKMO-CLGTRE                    PIC X(13).
               17 LKMO-DACHTV                    PIC S9(9) COMP-3.
               17 LKMO-DDEMEN                    PIC S9(9) COMP-3.
               17 LKMO-CDDPDE                    PIC X(1).
                 88 LKMO-FL-ACC-DERO               VALUE 'A'.
                 88 LKMO-FL-REFU-DERO              VALUE 'R'.
               17 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               17 LKMO-MTFRDE                    PIC S9(5)V9(2) COMP-3.
               17 LKMO-MPAREX                    PIC S9(5)V9(2) COMP-3.
               17 LKMO-DDMPDE                    PIC S9(9) COMP-3.
               17 LKMO-CAPLOY                    PIC X(2).
                 88 LKMO-FL-PAS-APEL               VALUE '00'.
                 88 LKMO-FL-APEL-AL-A-FAIR         VALUE '01'.
                 88 LKMO-FL-APEL-AL-FAIT           VALUE '02'.
                 88 LKMO-FL-APEL-AL-RECU           VALUE '03'.
                 88 LKMO-FL-APEL-APL-A-FAIR        VALUE '05'.
                 88 LKMO-FL-APEL-APL-FAIT          VALUE '06'.
                 88 LKMO-FL-APEL-APL-RECU          VALUE '07'.
               17 LKMO-DAPLOY                    PIC S9(9) COMP-3.
               17 LKMO-DRELOY                    PIC S9(9) COMP-3.
               17 LKMO-CSULOY                    PIC X(1).
                 88 LKMO-FL-SUP-IND-BAI            VALUE 'J'.
                 88 LKMO-FL-SUP-MAG                VALUE 'M'.
                 88 LKMO-FL-SUP-LIS                VALUE 'L'.
                 88 LKMO-FL-SUP-RES-NAT            VALUE 'N'.
                 88 LKMO-FL-SUP-RES                VALUE 'R'.
                 88 LKMO-FL-SUP-PAP                VALUE 'J' 'L'.
                 88 LKMO-FL-CSULOY-T               VALUE 'T'.
                 88 LKMO-FL-CSULOY-Q               VALUE 'Q'.
                 88 LKMO-FL-CSULOY-P               VALUE 'P'.
                 88 LKMO-FL-CSULOY-EDI             VALUE 'N' 'R' 'M'.
               17 LKMO-CNATAO                    PIC X(1).
                 88 LKMO-FL-ATTE-EXIG-NO-FRNI      VALUE 'E'.
                 88 LKMO-FL-ATTE-EXIG-ET-FRNI      VALUE 'F'.
               17 LKMO-CJLGPR                    PIC X(1).
                 88 LKMO-FL-AJOU-CMS               VALUE 'O'.
                 88 LKMO-FL-NO-AJOU-CMS            VALUE 'N'.
                 88 LKMO-FL-CMS-APP-PIE            VALUE 'A'.
               17 LKMO-CDCAJ001                  PIC S9(9) COMP-3.
               17 LKMO-EDRAPL                    PIC S9(9) COMP-3.
               17 LKMO-FDRAPL                    PIC S9(9) COMP-3.
               17 LKMO-DDEMAL                    PIC S9(9) COMP-3.
               17 LKMO-DCONST                    PIC S9(9) COMP-3.
               17 LKMO-NINVLG                    PIC X(12).
               17 LKMO-RLOGEM1                   PIC S9(3) COMP-3.
               17 LKMO-CDLCO001                  PIC S9(7) COMP-3.
               17 LKMO-FILLER
                            OCCURS 007 TIMES     PIC X(1).
               14 LKMO-CGLGH1
                            OCCURS 002 TIMES
                            INDEXED BY IX-OCL.
               17 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               17 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               17 LKMO-CGLGHIND.
               20 LKMO-INDBAI                    PIC 9(1).
               20 LKMO-INDCAI                    PIC 9(1).
               20 LKMO-INDCAL                    PIC 9(1).
               20 LKMO-INDCHL                    PIC 9(1).
               20 LKMO-INDCML                    PIC 9(1).
               20 LKMO-INDCNA                    PIC 9(1).
               20 LKMO-INDCOL                    PIC 9(1).
               20 LKMO-INDDEC                    PIC 9(1).
               20 LKMO-INDDPL                    PIC 9(1).
               20 LKMO-INDETU                    PIC 9(1).
               20 LKMO-INDLAI                    PIC 9(1).
               20 LKMO-INDMPL                    PIC 9(1).
               20 LKMO-INDNRL                    PIC 9(1).
               20 LKMO-INDPPL                    PIC 9(1).
               20 LKMO-INDSAL                    PIC 9(1).
               20 LKMO-INDSIN                    PIC 9(1).
               17 LKMO-CGLGHGDD.
               20 LKMO-LG0BAI.
               23 LKMO-EEFBAI                    PIC S9(9) COMP-3.
               23 LKMO-FBAILL                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGBAI.
               26 LKMO-CNABAI                    PIC X(1).
                 88 LKMO-FL-PERS-PHYS-BAI          VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-BAI          VALUE 'M'.
               26 LKMO-NBAILL                    PIC S9(7) COMP-3.
               26 LKMO-CTIBAI                    PIC X(3).
                 88 LKMO-FL-CTIBAI-MON             VALUE 'MON'.
                 88 LKMO-FL-CTIBAI-MME             VALUE 'MME'.
                 88 LKMO-FL-CTIBAI-CPL             VALUE 'CPL'.
               20 LKMO-LG0CAI.
               23 LKMO-CAIDEB                    PIC S9(9) COMP-3.
               23 LKMO-CAIFIN                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGCAI.
               26 LKMO-COFCAD                    PIC X(1).
               20 LKMO-LG0CAL.
               23 LKMO-CALDEB                    PIC S9(9) COMP-3.
               23 LKMO-CALFIN                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGCAL.
               26 LKMO-DCARLO                    PIC S9(9) COMP-3.
               26 LKMO-CPLLGT                    PIC X(2).
                 88 LKMO-FL-AUTR-PAIE-NORM         VALUE '01'.
                 88 LKMO-FL-LOG-FOYR-PERS-AGE      VALUE '03'.
                 88 LKMO-FL-LFJT-OU-BNEF-RMI       VALUE '04'.
                 88 LKMO-FL-RESID-U                VALUE '06'.
                 88 LKMO-FL-LNPO-INF-0759          VALUE '10'.
                 88 LKMO-FL-LNPO-0759-0660         VALUE '11'.
                 88 LKMO-FL-LNPO-0760-0661         VALUE '12'.
                 88 LKMO-FL-LNPO-0761-0662         VALUE '13'.
                 88 LKMO-FL-LNPO-0762-0663         VALUE '14'.
                 88 LKMO-FL-LNPO-0763-0664         VALUE '15'.
                 88 LKMO-FL-0764-0666              VALUE '16'.
                 88 LKMO-FL-0764-0666-DEROG        VALUE '17'.
                 88 LKMO-FL-LNPO-0766-0672         VALUE '18'.
                 88 LKMO-FL-LNPO-0772-0674         VALUE '19'.
                 88 LKMO-FL-LNPO-0774-0675         VALUE '20'.
                 88 LKMO-FL-LNPO-0775-0676         VALUE '21'.
                 88 LKMO-FL-LNPO-0776-0677         VALUE '22'.
                 88 LKMO-FL-LNPO-0777-0678         VALUE '23'.
                 88 LKMO-FL-LNPO-0778-0679         VALUE '24'.
                 88 LKMO-FL-LNPO-0779-0680         VALUE '25'.
                 88 LKMO-FL-LNPO-0780-0681         VALUE '26'.
                 88 LKMO-FL-LNPO-0781-1181         VALUE '27'.
                 88 LKMO-FL-LNPO-1281-0682         VALUE '28'.
                 88 LKMO-FL-LNPO-0782-0683         VALUE '29'.
                 88 LKMO-FL-LAOC-INF-0762          VALUE '30'.
                 88 LKMO-FL-LAOC-0762-0664         VALUE '31'.
                 88 LKMO-FL-LAOC-0764-0672         VALUE '32'.
                 88 LKMO-FL-LALA-INF-01-07-62      VALUE '33'.
                 88 LKMO-FL-LALA-0762-0663         VALUE '34'.
                 88 LKMO-FL-LALA-0763-0664         VALUE '35'.
                 88 LKMO-FL-LALA-0764-0672         VALUE '36'.
                 88 LKMO-FL-LNPO-0783-0684         VALUE '37'.
                 88 LKMO-FL-LNPO-0784-0685         VALUE '38'.
                 88 LKMO-FL-LNPO-0785-0686         VALUE '39'.
                 88 LKMO-FL-LNPO-0786-0687         VALUE '40'.
                 88 LKMO-FL-LNPO-0787-0688         VALUE '41'.
                 88 LKMO-FL-LNPO-0788-0689         VALUE '42'.
                 88 LKMO-FL-LNPO-0789-0690         VALUE '43'.
                 88 LKMO-FL-LNPO-0790-0691         VALUE '44'.
                 88 LKMO-FL-LNPO-0791-0692         VALUE '45'.
                 88 LKMO-FL-LNPO-0792-0694         VALUE '46'.
                 88 LKMO-FL-LNPO-0794-0695         VALUE '47'.
                 88 LKMO-FL-LNPO-0795-0696         VALUE '48'.
                 88 LKMO-FL-LNPO-0796              VALUE '49'.
                 88 LKMO-FL-LNPO-0797              VALUE '50'.
                 88 LKMO-FL-LNPO-0798              VALUE '51'.
                 88 LKMO-FL-LNPO-0799              VALUE '52'.
                 88 LKMO-FL-CPLLGT-0700            VALUE '53'.
                 88 LKMO-FL-CPLLGT-0701            VALUE '54'.
                 88 LKMO-FL-CPLLGT-0702            VALUE '55'.
                 88 LKMO-FL-CPLLGT-0703            VALUE '56'.
                 88 LKMO-FL-CPLLGT-0704            VALUE '57'.
                 88 LKMO-FL-CPLLGT-0705            VALUE '58'.
                 88 LKMO-FL-FLLC-AV-0176-DOM       VALUE '60'.
                 88 LKMO-FL-FLLC-EE-0176-1285      VALUE '61'.
                 88 LKMO-FL-FLLC-APR-31-12-85      VALUE '62'.
                 88 LKMO-FL-PLA-LOC                VALUE '01' '03' '04'
           '06'.
                 88 LKMO-FL-PLA-LOC-DOM            VALUE '01' '03' '04'
           '06' '60' '61' '62' '63'.
                 88 LKMO-FL-PLA-ACC-PAR1           VALUE '10' '11' '12'
           '13' '14' '15' '16' '17' '18' '19'.
                 88 LKMO-FL-PLA-ACC-PAR2           VALUE '20' '21' '22'
           '23' '24' '25' '26' '27' '28' '29'.
                 88 LKMO-FL-PLA-ACC-PAR3           VALUE '30' '31' '32'
           '33' '34' '35' '36' '37' '38' '39'.
                 88 LKMO-FL-PLA-ACC-PAR4           VALUE '40' '41' '42'
           '43' '44' '45' '46' '47' '48' '49' '50' '51'.
                 88 LKMO-FL-PLA-ACC-PAR5           VALUE '52' '53' '54'
           '55' '56' '57' '58' '59' '70' '71' '72' '73'.
                 88 LKMO-FL-PLA-ACC-PAR6           VALUE '74' '75' '76'
           '77' '78'.
               26 LKMO-COCLGT                    PIC X(2).
                 88 LKMO-FL-LOCL-NU-OCI            VALUE '01'.
                 88 LKMO-FL-LOCT-MEUB-HOPE         VALUE '02'.
                 88 LKMO-FL-SOUS-LOCT-LOCL-NU      VALUE '03'.
                 88 LKMO-FL-LLNM-OU-SOUS-LOEP      VALUE '04'.
                 88 LKMO-FL-OCC-RESID-U            VALUE '05'.
                 88 LKMO-FL-COCLGT-5X              VALUE '5X'.
                 88 LKMO-FL-COCLGT-5Y              VALUE '5Y'.
                 88 LKMO-FL-OCC-FOY-AUT            VALUE '06'.
                 88 LKMO-FL-LOGE-FOYR-OCI          VALUE '07'.
                 88 LKMO-FL-MAIS-DE-RETR-OCI       VALUE '08'.
                 88 LKMO-FL-CTRE-DE-LG-SEJO        VALUE '09'.
                 88 LKMO-FL-CHA-MEU                VALUE '10'.
                 88 LKMO-FL-CHA-NUE                VALUE '11'.
                 88 LKMO-FL-SOUS-LOLO-MEUB         VALUE '13'.
                 88 LKMO-FL-LLMM-OU-SOUS-LOEP      VALUE '14'.
                 88 LKMO-FL-LOCT-RELV-DU-FEMG      VALUE '15'.
                 88 LKMO-FL-HEBE-PA-OU-PI-CHP      VALUE '16'.
                 88 LKMO-FL-LOCT-ACSO-CTDT         VALUE '17'.
                 88 LKMO-FL-NU-MIX                 VALUE '18'.
                 88 LKMO-FL-NU-MIX-HLM             VALUE '19'.
                 88 LKMO-FL-IMEU-ANCI-OCUP         VALUE '20'.
                 88 LKMO-FL-IMEU-ANCI-LIBR         VALUE '21'.
                 88 LKMO-FL-IMEU-NEU-INF-DEC       VALUE '22'.
                 88 LKMO-FL-IMEU-NEU-INEG-DEC      VALUE '23'.
                 88 LKMO-FL-AMEL-SAUF-HLM          VALUE '24'.
                 88 LKMO-FL-DOM-LOC-LTS            VALUE '30'.
                 88 LKMO-FL-DOM-LOC-LES            VALUE '31'.
                 88 LKMO-FL-DOM-ACC-LTS            VALUE '40'.
                 88 LKMO-FL-DOM-ACC-LES            VALUE '41'.
                 88 LKMO-FL-APL1-RES-SOC           VALUE '50'.
                 88 LKMO-FL-APL2-RES-SOC           VALUE '5A'.
                 88 LKMO-FL-HLM-NEU-OUAC-ETAM      VALUE '51'.
                 88 LKMO-FL-LOG-FOYR-OCI           VALUE '52'.
                 88 LKMO-FL-AUTR-LOG-NEU-OUAC      VALUE '53'.
                 88 LKMO-FL-APL1-FOY-JT            VALUE '54'.
                 88 LKMO-FL-HLM-CONV-AP-TRAV       VALUE '55'.
                 88 LKMO-FL-AUTR-LOCO-AP-TRAV      VALUE '56'.
                 88 LKMO-FL-HLM-CONV-SS-TRAV       VALUE '57'.
                 88 LKMO-FL-AUTR-LOCO-SS-TRAV      VALUE '58'.
                 88 LKMO-FL-OCC-FJT                VALUE '59'.
                 88 LKMO-FL-LOG-NEU-OUAC-ETAM      VALUE '60'.
                 88 LKMO-FL-LOG-AMEL-OCI           VALUE '61'.
                 88 LKMO-FL-LOG-SS-TRAV-OCI        VALUE '62'.
                 88 LKMO-FL-CHA                    VALUE '63'.
                 88 LKMO-FL-ACQU-LOG-NEU-OCI       VALUE '70'.
                 88 LKMO-FL-ACQU-ET-AMEL-OCI       VALUE '71'.
                 88 LKMO-FL-AGRD-OCI               VALUE '72'.
                 88 LKMO-FL-AMEL-OCI               VALUE '73'.
                 88 LKMO-FL-LOCA-ACES-OCI          VALUE '74'.
                 88 LKMO-FL-EXPR-ALA-SS-TRAV       VALUE '75'.
                 88 LKMO-FL-ACQU-LAN-SS-TRAV       VALUE '76'.
                 88 LKMO-FL-HLM-LOC-NU             VALUE '77'.
                 88 LKMO-FL-HLM-MIX-SSLO           VALUE '78'.
                 88 LKMO-FL-HLM-PAPI-PART          VALUE '79'.
                 88 LKMO-FL-HLM-ANC-OCC            VALUE '80'.
                 88 LKMO-FL-HLM-ANC-LIB            VALUE '81'.
                 88 LKMO-FL-HLM-AVT-07-72          VALUE '82'.
                 88 LKMO-FL-HLM-APR-07-72          VALUE '83'.
                 88 LKMO-FL-AMEL-HLM               VALUE '84'.
                 88 LKMO-FL-LOCA-ORDI              VALUE '01' '02' '03'
           '04' '13' '14' '15' '16' '17' '77' '78' '79'.
                 88 LKMO-FL-LOCA-ORDI-2            VALUE '10' '11' '30'
           '31' '18' '19' '5Y'.
                 88 LKMO-FL-FOYER-AL               VALUE '05' '06' '07'
           '08' '09' '5X'.
                 88 LKMO-FL-LOCA-AL                VALUE '01' '02' '03'
           '04' '05' '06' '07' '08' '09' '13' '10' '11'.
                 88 LKMO-FL-LOCA-AL2               VALUE '14' '15' '16'
           '17' '77' '78' '79' '30' '31' '18' '19'.
                 88 LKMO-FL-LOCA-AL3               VALUE '5X' '5Y'.
                 88 LKMO-FL-LOCA-APL1              VALUE '50' '51' '52'
           '53' '54' '60'.
                 88 LKMO-FL-LOCA-APL2              VALUE '5A' '55' '56'
           '57' '58' '59' '61' '62' '63'.
                 88 LKMO-FL-REF-APL-LOC            VALUE '51' '53' '55'
           '56' '57' '58' '60' '61' '62' '63'.
                 88 LKMO-FL-LOCA-ALDOM             VALUE '14' '16' '30'
           '31' '5X' '18' '19' '77' '78' '79' '5Y'.
                 88 LKMO-FL-LOCA-ALMET             VALUE '14' '15' '16'
           '17' '18' '19' '77' '78' '79' '5X' '5Y'.
                 88 LKMO-FL-ACCES-ALDOM            VALUE '23' '24' '40'
           '41' '83' '84'.
                 88 LKMO-FL-ACCES-ALMET            VALUE '20' '21' '22'
           '23' '24' '80' '81' '82' '83' '84'.
                 88 LKMO-FL-ACCES-AL               VALUE '20' '21' '22'
           '23' '24' '80' '81' '82' '83' '84' '40' '41'.
                 88 LKMO-FL-ACCES-APL              VALUE '70' '71' '72'
           '73' '74' '75' '76'.
                 88 LKMO-FL-HEB-ONER-APL-LOC       VALUE '60' '61'.
                 88 LKMO-FL-HEB-ONER-NEW-APL       VALUE '61' '62'.
                 88 LKMO-FL-HEB-ONER-AL            VALUE '16' '79'.
                 88 LKMO-FL-AUTRE-QUAMEL-APL       VALUE '70' '71' '72'
           '74' '75'.
                 88 LKMO-FL-FOYER-RET              VALUE '07' '08'.
                 88 LKMO-FL-ACC-ALS                VALUE '20' '21' '22'
           '23' '80' '81' '82' '83' '40' '41'.
                 88 LKMO-FL-AMEL-ALF               VALUE '24' '84'.
                 88 LKMO-FL-COCLGT-CRH1            VALUE '01' '02' '03'
           '04' '10' '11' '13' '14' '15' '17' '18' '16'.
                 88 LKMO-FL-COCLGT-CRH2            VALUE '30' '31' '51'
           '53' '55' '56' '57' '58' '60' '61' '62' '63'.
                 88 LKMO-FL-STA-LOC-HLM            VALUE '77' '78' '79'
           '19'.
                 88 LKMO-FL-STA-LOC-AUT            VALUE '01' '02' '03'
           '04' '13' '14' '15' '16' '17' '18' '30' '31'.
                 88 LKMO-FL-STA-LOC-CHA            VALUE '10' '11'.
                 88 LKMO-FL-STA-AME                VALUE '24' '84'.
                 88 LKMO-FL-STA-ACC-HLM            VALUE '80' '81' '82'
           '83'.
                 88 LKMO-FL-STA-ACC-AUT            VALUE '20' '21' '22'
           '23' '40' '41'.
                 88 LKMO-FL-STA-LOG-FOY            VALUE '06' '07'.
                 88 LKMO-FL-STA-MAI-RET            VALUE '08' '09'.
                 88 LKMO-FL-STA-LOC-MEU            VALUE '02' '03' '04'
           '10' '13' '14' '78'.
                 88 LKMO-FL-STA-APL-LOC            VALUE '51' '53' '55'
           '56' '57' '58' '60' '61' '62' '63'.
                 88 LKMO-FL-STA-APL-ACC-NEU        VALUE '70' '74'.
                 88 LKMO-FL-STA-APL1-FOY           VALUE '50' '52' '54'.
                 88 LKMO-FL-STA-APL2-FOY           VALUE '59' '5A'.
                 88 LKMO-FL-STA-APL-ACC-STR        VALUE '75' '76'.
                 88 LKMO-FL-OCC-QUI-RED            VALUE '02' '03' '04'
           '10' '13' '14' '78' '5Y'.
                 88 LKMO-FL-COCLGT-MAYOTTE         VALUE '01' '23' '24'
           '83' '84'.
               26 LKMO-CZGLGT                    PIC X(1).
                 88 LKMO-FL-ZONE-UN                VALUE '1'.
                 88 LKMO-FL-ZONE-DEU               VALUE '2'.
                 88 LKMO-FL-ZONE-TRO               VALUE '3'.
                 88 LKMO-FL-SPEC-DOM               VALUE '9'.
               26 LKMO-QSURLG                    PIC S9(5) COMP-3.
               26 LKMO-TSUHAB                    PIC S9(3)V9(2) COMP-3.
               26 LKMO-QM2HAB                    PIC S9(5) COMP-3.
               26 LKMO-QMPALF                    PIC S9(3) COMP-3.
               26 LKMO-QMPALS                    PIC S9(3) COMP-3.
               20 LKMO-LG0CHL.
               23 LKMO-CHLDEB                    PIC S9(9) COMP-3.
               23 LKMO-CHLFIN                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGCHL.
               26 LKMO-DCHRES                    PIC S9(9) COMP-3.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MCHRLG                    PIC S9(5)V9(2) COMP-3.
               26 LKMO-CNMTCL                    PIC X(1).
                 88 LKMO-FL-CHRG-RSDU              VALUE 'R'.
                 88 LKMO-FL-AVTG-SIML-ALS          VALUE 'S'.
                 88 LKMO-FL-LNM-ASS                VALUE 'A'.
               20 LKMO-LG0CML.
               23 LKMO-EPECML                    PIC S9(9) COMP-3.
               23 LKMO-FPECML                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGCML.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MMLRBT                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-LG0CNA.
               23 LKMO-CAIDEB                    PIC S9(9) COMP-3.
               23 LKMO-CAIFIN                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGCNA.
               26 LKMO-CONSAL                    PIC X(2).
                 88 LKMO-FL-CONSAL-IN              VALUE 'IN'.
                 88 LKMO-FL-CONSAL-I6              VALUE 'I6'.
                 88 LKMO-FL-CONSAL-R1              VALUE 'R1'.
                 88 LKMO-FL-CONSAL-R2              VALUE 'R2'.
               26 LKMO-DENRAL                    PIC S9(9) COMP-3.
               26 LKMO-DSABAI                    PIC S9(9) COMP-3.
               26 LKMO-CETCAL                    PIC X(2).
                 88 LKMO-FL-CETCAL-CO              VALUE 'CO'.
                 88 LKMO-FL-CETCAL-PA              VALUE 'PA'.
                 88 LKMO-FL-CETCAL-AN              VALUE 'AN'.
               20 LKMO-LG0COL.
               23 LKMO-COLDEB                    PIC S9(9) COMP-3.
               23 LKMO-COLFIN                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGCOL.
               26 LKMO-DANCOL                    PIC S9(9) COMP-3.
               26 LKMO-QCOLGT                    PIC S9(3) COMP-3.
               20 LKMO-LG0DEC.
               23 LKMO-EDECLG                    PIC S9(9) COMP-3.
               23 LKMO-FDECLG                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGDEC.
               26 LKMO-CDECLG                    PIC X(2).
                 88 LKMO-FL-CDECLG-AU              VALUE 'AU'.
                 88 LKMO-FL-CDECLG-DA              VALUE 'DA'.
                 88 LKMO-FL-CDECLG-DL              VALUE 'DL'.
                 88 LKMO-FL-CDECLG-IC              VALUE 'IC'.
                 88 LKMO-FL-CDECLG-PI              VALUE 'PI'.
               26 LKMO-DPROLO                    PIC S9(9) COMP-3.
               26 LKMO-CPROLO                    PIC X(1).
                 88 LKMO-FL-CPROLO-O               VALUE 'O'.
                 88 LKMO-FL-CPROLO-N               VALUE 'N'.
                 88 LKMO-FL-CPROLO-R               VALUE 'R'.
               26 LKMO-CDISAL                    PIC X(1).
                 88 LKMO-FL-CDISAL-C               VALUE 'C'.
                 88 LKMO-FL-CDISAL-S               VALUE 'S'.
               20 LKMO-LG0DPL.
               23 LKMO-EDEPLG                    PIC S9(9) COMP-3.
               23 LKMO-FDEPLG                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGDPL.
               26 LKMO-CDEPLG                    PIC X(1).
                 88 LKMO-FL-DERO-PAC-SUPL          VALUE '1'.
                 88 LKMO-FL-DERO-DECI              VALUE '2'.
                 88 LKMO-FL-DERO-LEG               VALUE '3'.
                 88 LKMO-FL-DERO-CRA               VALUE '4'.
                 88 LKMO-FL-DERO-SRVC-ADMF         VALUE '5'.
                 88 LKMO-FL-DERO-GEN               VALUE '6'.
                 88 LKMO-FL-DERO-DEFI              VALUE '7'.
                 88 LKMO-FL-DERO-REFU              VALUE '8'.
                 88 LKMO-FL-DERO-PAC-GEN           VALUE '9'.
               26 LKMO-QPDEPL                    PIC S9(3) COMP-3.
               20 LKMO-LG0ETU.
               23 LKMO-ETUDEB                    PIC S9(9) COMP-3.
               23 LKMO-ETUFIN                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGETU.
               26 LKMO-EETULO                    PIC S9(9) COMP-3.
               26 LKMO-CETULO                    PIC X(1).
                 88 LKMO-FL-CETULO-O               VALUE 'O'.
                 88 LKMO-FL-CETULO-N               VALUE 'N'.
                 88 LKMO-FL-CETULO-R               VALUE 'R'.
                 88 LKMO-FL-CETULO-E               VALUE 'E'.
               20 LKMO-LG0LAI.
               23 LKMO-LAIDEB                    PIC S9(9) COMP-3.
               23 LKMO-LAIFIN                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGLAI.
               26 LKMO-CELIFC                    PIC X(1).
                 88 LKMO-FL-CELIFC-E               VALUE 'E'.
                 88 LKMO-FL-CELIFC-N               VALUE 'N'.
               20 LKMO-LG0MPL.
               23 LKMO-MPLDEB                    PIC S9(9) COMP-3.
               23 LKMO-MPLFIN                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGMPL.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MCALLO                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-LG0NRL.
               23 LKMO-ENRPNL                    PIC S9(9) COMP-3.
               23 LKMO-FNRPNL                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGNRL.
               26 LKMO-QPNLGT                    PIC S9(3) COMP-3.
               20 LKMO-LG0PPL.
               23 LKMO-ETYPRE                    PIC S9(9) COMP-3.
               23 LKMO-FTYPRE                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGPPL.
               26 LKMO-RPRETX                    PIC S9(3) COMP-3.
               20 LKMO-LG0SAL.
               23 LKMO-EDSALG                    PIC S9(9) COMP-3.
               23 LKMO-FDSALG                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGSAL.
               26 LKMO-CDSALG                    PIC X(1).
                 88 LKMO-FL-DERO-SRVC-ADMF-LD      VALUE '1'.
                 88 LKMO-FL-DERO-CA-LD             VALUE '2'.
                 88 LKMO-FL-DERO-REFU-LD           VALUE '3'.
                 88 LKMO-FL-FIN-DE-DERO-ATT        VALUE '4'.
               20 LKMO-LG0SIN.
               23 LKMO-DDEROL                    PIC S9(9) COMP-3.
               23 LKMO-FDEROL                    PIC S9(9) COMP-3.
               23 LKMO-CDLOGSIN.
               26 LKMO-CDEROL                    PIC X(1).
                 88 LKMO-FL-CDEROL-P               VALUE 'P'.
                 88 LKMO-FL-CDEROL-S               VALUE 'S'.
                 88 LKMO-FL-CDEROL-N               VALUE 'N'.
             11 LKMO-PRET-LOG-ACC.
               14 LKMO-RLOGEM                    PIC S9(3) COMP-3.
               14 LKMO-CGPR01.
               17 LKMO-CDPREZZZ.
               20 LKMO-CNAREF                    PIC X(1).
                 88 LKMO-FL-PERS-PHYS-REF          VALUE 'P'.
                 88 LKMO-FL-PERS-MRAL-REF          VALUE 'M'.
               20 LKMO-NREFER                    PIC S9(7) COMP-3.
               20 LKMO-NPRETX                    PIC X(20).
               20 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               20 LKMO-MGLPRE                    PIC S9(7)V9(2) COMP-3.
               20 LKMO-TPCPRE                    PIC S9(3)V9(2) COMP-3.
               20 LKMO-CTIPRE                    PIC X(3).
                 88 LKMO-FL-MR-PRE                 VALUE 'MON'.
                 88 LKMO-FL-MME-PRE                VALUE 'MME'.
                 88 LKMO-FL-MR-ET-MME-PRE          VALUE 'MEM'.
               20 LKMO-QDUPRM                    PIC S9(3) COMP-3.
               20 LKMO-CTPREE                    PIC X(1).
                 88 LKMO-FL-TERM-A-ECHO            VALUE 'A'.
                 88 LKMO-FL-TERM-ECHU              VALUE 'E'.
               20 LKMO-DRATPR                    PIC S9(9) COMP-3.
               20 LKMO-DRAPPR                    PIC S9(9) COMP-3.
               20 LKMO-DSICON                    PIC S9(9) COMP-3.
               20 LKMO-CPEPRE                    PIC X(1).
                 88 LKMO-FL-MENS-PRE               VALUE 'M'.
                 88 LKMO-FL-TRIM-PRE               VALUE 'T'.
                 88 LKMO-FL-SMTR-PRE               VALUE 'S'.
                 88 LKMO-FL-ANN-PRE                VALUE 'A'.
               20 LKMO-CNAPRE                    PIC X(1).
                 88 LKMO-FL-PRET-AIDE-PAR-ETA      VALUE 'A'.
                 88 LKMO-FL-PRET-CONV-PRN          VALUE 'C'.
                 88 LKMO-FL-AUTR-PRN-PRN           VALUE 'Z'.
                 88 LKMO-FL-PRN-PAP-CST            VALUE 'P'.
                 88 LKMO-FL-PRN-PC-CST             VALUE 'V'.
                 88 LKMO-FL-PRN-TX-ZERO            VALUE 'T'.
                 88 LKMO-FL-CNAPRE-PAP             VALUE 'A' 'P'.
                 88 LKMO-FL-CNAPRE-CNV             VALUE 'C' 'V'.
                 88 LKMO-FL-CNAPRE-COM             VALUE 'Z' 'T'.
             11 LKMO-ALLOCATAIRE.
               14 LKMO-ALLOC-FAMILLE-PRESTA
                            OCCURS 010 TIMES
                            INDEXED BY IX-AL0.
               17 LKMO-ALLO-CFAPRS               PIC X(3).
                 88 LKMO-ALLO-FL-PFA-ALF           VALUE 'PFA'.
                 88 LKMO-ALLO-FL-APL-ALF           VALUE 'APL'.
                 88 LKMO-ALLO-FL-RMI-ALF           VALUE 'RMI'.
                 88 LKMO-ALLO-FL-ALS-ALF           VALUE 'ALS'.
                 88 LKMO-ALLO-FL-AH1-ALF           VALUE 'AH1'.
                 88 LKMO-ALLO-FL-AH2-ALF           VALUE 'AH2'.
                 88 LKMO-ALLO-FL-PEL-ALF           VALUE 'PEL'.
                 88 LKMO-ALLO-FL-CFAPRS-RSO        VALUE 'RSO'.
                 88 LKMO-ALLO-FL-CFAPRS-RSA        VALUE 'RSA'.
                 88 LKMO-ALLO-FL-CFAPRS-AMI        VALUE 'AMI'.
                 88 LKMO-ALLO-FL-CFAPRS-PAC        VALUE 'PAC'.
               17 LKMO-ALLO-CGAL0ALC.
               20 LKMO-INDALC                    PIC 9(1).
               20 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               20 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               20 LKMO-CDALLALC.
               23 LKMO-NFICPN                    PIC S9(7) COMP-3.
             11 LKMO-ASS-MATER-DOS.
               14 LKMO-ASS-MATER-PER
                            OCCURS 005 TIMES
                            INDEXED BY IX-PEA.
               17 LKMO-ASS-MATER-GDD.
               20 LKMO-NFICPN                    PIC S9(7) COMP-3.
               20 LKMO-D4A2MJ1                   PIC S9(9) COMP-3.
               20 LKMO-EAGRAM                    PIC S9(9) COMP-3.
               20 LKMO-FAGRAM                    PIC S9(9) COMP-3.
               20 LKMO-CAGAMT                    PIC X(1).
                 88 LKMO-FL-AGRE                   VALUE 'A'.
                 88 LKMO-FL-CAGAMT-G               VALUE 'G'.
                 88 LKMO-FL-CAGAMT-T               VALUE 'T'.
                 88 LKMO-FL-NO-AGRE                VALUE 'P'.
                 88 LKMO-FL-CAGAMT-M               VALUE 'M'.
               20 LKMO-ASS-MATER-EMP-GDD
                            OCCURS 002 TIMES
                            INDEXED BY IX-PEE.
               23 LKMO-NFICPN1                   PIC S9(7) COMP-3.
               23 LKMO-ASS-MATER-OCC-GDD.
               26 LKMO-CGAM0AEF.
               29 LKMO-INDAEF                    PIC 9(1).
               29 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               29 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               29 LKMO-CDAM0AEF.
               32 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               32 LKMO-MSTFAM                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-QJTFAM                    PIC S9(3) COMP-3.
               32 LKMO-MSSFAM                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-MIRFAM                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-MAIFAM                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-MCSFAM                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-MRCFAM                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-MTCASS                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-DRIDNT                    PIC S9(9) COMP-3.
               32 LKMO-MCTAFA                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-CCOTIV                    PIC X(1).
                 88 LKMO-FL-COTE                   VALUE 'O'.
                 88 LKMO-FL-NO-COTE                VALUE 'N'.
               32 LKMO-MRDFAM                    PIC S9(5)V9(2) COMP-3.
               32 LKMO-CETDNT                    PIC X(1).
                 88 LKMO-FL-1ER-CALCUL             VALUE '1'.
                 88 LKMO-FL-AUT-CALCUL             VALUE '2'.
                 88 LKMO-FL-1ER-PMT                VALUE '3'.
                 88 LKMO-FL-AUT-PMT                VALUE '4'.
             11 LKMO-JUGEMENTS.
               14 LKMO-JUGEMT-PERSONNES
                            OCCURS 015 TIMES
                            INDEXED BY IX-PJU.
               17 LKMO-JUGEMT-TIERS
                            OCCURS 002 TIMES
                            INDEXED BY IX-TJU.
               20 LKMO-CGJUGZZZ.
               23 LKMO-CTNE01                    PIC 9(1).
               23 LKMO-NFICPN                    PIC S9(7) COMP-3.
               23 LKMO-NJUGEM                    PIC S9(13) COMP-3.
               23 LKMO-DJUGEM                    PIC S9(9) COMP-3.
               23 LKMO-DASJUG                    PIC S9(9) COMP-3.
               23 LKMO-D1MDPA                    PIC S9(9) COMP-3.
               23 LKMO-CVPA18                    PIC X(1).
                 88 LKMO-FL-OUI-VSMT               VALUE 'O'.
                 88 LKMO-FL-NO-VSMT                VALUE 'N'.
               23 LKMO-CNAJUG                    PIC X(1).
                 88 LKMO-FL-NJU-ARR-CRE            VALUE 'A'.
                 88 LKMO-FL-ORDO-DE-NO-COCL        VALUE 'C'.
                 88 LKMO-FL-DIVO-NJU               VALUE 'D'.
                 88 LKMO-FL-NJU-ORD-MOD            VALUE 'F'.
                 88 LKMO-FL-NJU-PLA-PRO            VALUE 'J'.
                 88 LKMO-FL-NJU-CHA-MAR            VALUE 'M'.
                 88 LKMO-FL-NJU-ORD-PLA            VALUE 'P'.
                 88 LKMO-FL-NJU-ORD-REF            VALUE 'R'.
                 88 LKMO-FL-NJU-ORD-SEP            VALUE 'S'.
                 88 LKMO-FL-NJU-JUG-TUT            VALUE 'T'.
                 88 LKMO-FL-NJU-PVE-CON            VALUE 'V'.
                 88 LKMO-FL-CNAJUG-G               VALUE 'G'.
                 88 LKMO-FL-CNAJUG-O               VALUE 'O'.
                 88 LKMO-FL-CNAJUG-U               VALUE 'U'.
                 88 LKMO-FL-CNAJUG-I               VALUE 'I'.
                 88 LKMO-FL-CNAJUG-H               VALUE 'H'.
                 88 LKMO-FL-CNAJUG-K               VALUE 'K'.
                 88 LKMO-FL-CNAJUG-E               VALUE 'E'.
                 88 LKMO-FL-CNAJUG-B               VALUE 'B'.
                 88 LKMO-FL-CNAJUG-L               VALUE 'L'.
                 88 LKMO-FL-CNAJUG-W               VALUE 'W'.
                 88 LKMO-FL-CNAJUG-X               VALUE 'X'.
                 88 LKMO-FL-CNAJUG-NON-HOM         VALUE 'W' 'X'.
               23 LKMO-LIMITE-VALIDITE.
               26 LKMO-JUG-D4A2MJ                PIC S9(9) COMP-3.
               20 LKMO-CGJUGPAT.
               23 LKMO-INDPAT                    PIC 9(1).
               23 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               23 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               23 LKMO-CDJUGPAT.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MPPADU                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-PAVERSEE.
               23 LKMO-PAVERSEE-MOIS
                            OCCURS 026 TIMES
                            INDEXED BY IX-MPA.
               26 LKMO-INDPEN                    PIC 9(1).
               26 LKMO-MTBA9P                    PIC S9(5)V9(2) COMP-3.
               20 LKMO-CGJUGPAC.
               23 LKMO-INDPAC                    PIC 9(1).
               23 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               23 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               23 LKMO-CDJUGPAC.
               26 LKMO-CMOREF                    PIC X(1).
                 88 LKMO-FL-CMOREF-E               VALUE 'E'.
               26 LKMO-MINDEB                    PIC S9(5) COMP-3.
               17 LKMO-JUGEMT-ASF.
               20 LKMO-JUGT-IBAN03               PIC S9(3) COMP-3.
               20 LKMO-JUGT-DDMASF               PIC S9(9) COMP-3.
             11 LKMO-CGSUSPRE.
               14 LKMO-CGSUPSPR
                            OCCURS 005 TIMES
                            INDEXED BY IX-SUSP.
               17 LKMO-CNAPRS                    PIC X(3).
                
                 88 LKMO-FL-CNAPRS-PAF             VALUE 'PAF'.
                 88 LKMO-FL-CNAPRS-RSA-FICTIF      VALUE 'SAF' 'SIF'.
                 88 LKMO-FL-CNAPRS-RSF             VALUE 'RSF'.
               17 LKMO-CDHIS001                  PIC S9(9) COMP-3.
               17 LKMO-CDHIS002                  PIC S9(9) COMP-3.
               17 LKMO-INDSPR                    PIC 9(1).
               17 LKMO-CDSUPSPR.
               20 LKMO-CSUSPO                    PIC X(2).
                 88 LKMO-FL-AUTR-MTF-PSU           VALUE '00'.
                 88 LKMO-FL-BNEF-APL-NAJ-LOYR      VALUE '01'.
                 88 LKMO-FL-FIN-ACOD-DECI-SDA      VALUE '02'.
                 88 LKMO-FL-ATTE-DE-NO-PRP         VALUE '03'.
                 88 LKMO-FL-CSUSPO-04              VALUE '04'.
                 88 LKMO-FL-AUTR-PERS-PAFR         VALUE '06'.
                 88 LKMO-FL-CSUSPO-07              VALUE '07'.
                 88 LKMO-FL-DETE-IMPY              VALUE '08'.
                 88 LKMO-FL-PLAN-APUR-NO-RECU      VALUE '09'.
                 88 LKMO-FL-DECI-FSL-NO-RECU       VALUE '10'.
                 88 LKMO-FL-CTRL-ANN-RDP-DEC       VALUE '11'.
                 88 LKMO-FL-FIN-PROC-ABS-RPSE      VALUE '12'.
                 88 LKMO-FL-PLAN-APUR-NO-RESP      VALUE '13'.
                 88 LKMO-FL-CSUSPO-14              VALUE '14'.
                 88 LKMO-FL-REFU-DPOS-DMDE         VALUE '15'.
                 88 LKMO-FL-LIQU-CONT-RESS         VALUE '16'.
                 88 LKMO-FL-SUP-APL-DOS            VALUE '17'.
                 88 LKMO-FL-SUP-ACT-AGED           VALUE '18'.
                 88 LKMO-FL-SUP-AVEC-PAI           VALUE '19'.
                 88 LKMO-FL-SUP-RMI-PRE            VALUE '20'.
                 88 LKMO-FL-SUP-MUT-DIF            VALUE '21'.
                 88 LKMO-FL-SUP-PRE-DEQ            VALUE '22'.
                 88 LKMO-FL-SUP-AL-FIN-PAL         VALUE '24'.
                 88 LKMO-FL-SUP-ACT-APE            VALUE '25'.
                 88 LKMO-FL-SUP-ECH-BAI            VALUE '26'.
                 88 LKMO-FL-SUP-RMI-INS            VALUE '27'.
                 88 LKMO-FL-SUP-CTL-RES            VALUE '28'.
                 88 LKMO-FL-SUP-DIV-AVEC-SUS       VALUE '29'.
                 88 LKMO-FL-SUP-DIV-SANS-SUS       VALUE '30'.
                 88 LKMO-FL-SUP-RMI-CNA            VALUE '31'.
                 88 LKMO-FL-SUP-ASS-APE            VALUE '32'.
                 88 LKMO-FL-SUP-CTR-ETU            VALUE '33'.
                 88 LKMO-FL-SUP-ASF-HET            VALUE '35'.
                 88 LKMO-FL-SUP-SUR-DOM            VALUE '36'.
                 88 LKMO-FL-SUP-RMI-ACT            VALUE '37'.
                 88 LKMO-FL-CSUSPO-38              VALUE '38'.
                 88 LKMO-FL-CSUSPO-39              VALUE '39'.
                 88 LKMO-FL-CSUSPO-40              VALUE '40'.
                 88 LKMO-FL-CSUSPO-41              VALUE '41'.
                 88 LKMO-FL-CSUSPO-42              VALUE '42'.
                 88 LKMO-FL-CSUSPO-43              VALUE '43'.
                 88 LKMO-FL-CSUSPO-44              VALUE '44'.
                 88 LKMO-FL-CSUSPO-45              VALUE '45'.
                 88 LKMO-FL-CSUSPO-46              VALUE '46'.
                 88 LKMO-FL-CSUSPO-47              VALUE '47'.
                 88 LKMO-FL-CSUSPO-48              VALUE '48'.
                 88 LKMO-FL-CSUSPO-49              VALUE '49'.
                 88 LKMO-FL-CSUSPO-50              VALUE '50'.
                 88 LKMO-FL-CSUSPO-51              VALUE '51'.
                 88 LKMO-FL-CSUSPO-52              VALUE '52'.
                 88 LKMO-FL-CSUSPO-53              VALUE '53'.
                 88 LKMO-FL-CSUSPO-54              VALUE '54'.
                 88 LKMO-FL-CSUSPO-55              VALUE '55'.
                 88 LKMO-FL-CSUSPO-56              VALUE '56'.
                 88 LKMO-FL-CSUSPO-57              VALUE '57'.
                 88 LKMO-FL-CSUSPO-58              VALUE '58'.
                 88 LKMO-FL-CSUSPO-59              VALUE '59'.
                 88 LKMO-FL-CSUSPO-60              VALUE '60'.
                 88 LKMO-FL-CSUSPO-61              VALUE '61'.
                 88 LKMO-FL-CSUSPO-62              VALUE '62'.
                 88 LKMO-FL-CSUSPO-63              VALUE '63'.
                 88 LKMO-FL-CSUSPO-64              VALUE '64'.
                 88 LKMO-FL-CSUSPO-65              VALUE '65'.
                 88 LKMO-FL-SUP-METRO              VALUE '01' '02' '17'
           '22'.
                 88 LKMO-FL-SUSP-AL-CONS           VALUE '61' '62'.
                 88 LKMO-FL-CSUSPO-IMP             VALUE '07' '08' '09'
           '10' '11' '12' '13' '14'.
                 88 LKMO-FL-CSUSPO-BOR             VALUE '45' '46' '47'
           '48' '49'.
                 88 LKMO-FL-CSUSPO-SUR             VALUE '50' '51' '52'
           '53'.
           08 LKMO-CGLK100.
             11 LKMO-CANEVAS.
               14 LKMO-CANVAS-INTERNE-PELEM.
               17 LKMO-CRIT1                     PIC S9(5) COMP-3.
               17 LKMO-CRIT2                     PIC S9(5) COMP-3.
               17 LKMO-CNAPRG                    PIC X(5).
                 88 LKMO-FL-CNAPRG-PAF-N-MAJO      VALUE 'PAFF1' 'PAFF2'
            'PAFF4' 'PAFFA' 'PAFFB' 'PAFFD'.
                 88 LKMO-FL-CNAPRG-PAF-N-MAJ2      VALUE 'PAFF5' 'PAFF6'
            'PAFF7' 'PAFFE' 'PAFFF' 'PAFFG'.
                 88 LKMO-FL-CNAPRG-PAF-N-MAJ3      VALUE 'PAFF8' 'PAFF9'
            'PAFFH' 'PAFFI'.
                 88 LKMO-FL-CNAPRG-PAF-MAJO        VALUE 'PAFF3' 'PAFFC'
           .
                 88 LKMO-FL-CNAPRG-PPA-N-MAJO      VALUE 'PPAN1' 'PPAN2'
            'PPAN4'.
                 88 LKMO-FL-CNAPRG-PPA-MAJO        VALUE 'PPIN1'.
               17 LKMO-LIGNE-CNVA-PAR-PELEM
                            OCCURS 275 TIMES
                            INDEXED BY IX-CAN005.
               20 LKMO-PCODFN                    PIC X(1).
               20 LKMO-PCODOP                    PIC X(2).
               20 LKMO-PCORGL                    PIC X(6).
               20 LKMO-CITEUN                    PIC X(1).
               20 LKMO-CCRTRC                    PIC X(1).
               20 LKMO-BCTXB0                    PIC X(1).
               20 LKMO-ZFONCT                    PIC X(3).
             11 LKMO-SERVICE.
               14 LKMO-ESRV.
               17 LKMO-ESRV-CRTSRV               PIC X(2).
               14 LKMO-CRTSRV                    PIC X(2).
               14 LKMO-CABEND                    PIC X(4).
               14 LKMO-TABEND                    PIC X(1).
               14 LKMO-PCDRET                    PIC X(4).
               14 LKMO-IDORGA                    PIC X(4).
               14 LKMO-ZTYPAP                    PIC X(1).
                 88 LKMO-FL-ZTYPAP-BATCH           VALUE 'B'.
                 88 LKMO-FL-ZTYPAP-TP              VALUE 'T'.
                 88 LKMO-FL-ZTYPAP-BATCH-TP        VALUE 'A'.
               14 LKMO-ZDSVCM                    PIC X(1).
                 88 LKMO-FL-ZDSVCM-DSV             VALUE 'V'.
                 88 LKMO-FL-ZDSVCM-DSC             VALUE 'C'.
                 88 LKMO-FL-ZDSVCM-DSM             VALUE 'M'.
               14 LKMO-ZAPPLT                    PIC X(8).
               14 LKMO-NDOMAT                    PIC S9(7) COMP-3.
               14 LKMO-CORGTR                    PIC X(2).
                 88 LKMO-FL-DRT-POTI-TRR           VALUE 'DP'.
                 88 LKMO-FL-ECHE-TRR               VALUE 'EC'.
                 88 LKMO-FL-DRT-REEL-TRR           VALUE 'DR'.
                 88 LKMO-FL-PRLD-TRR               VALUE 'PR'.
                 88 LKMO-FL-SIMU-TRR               VALUE 'SI'.
                 88 LKMO-FL-REN-APL-TRR            VALUE 'RA'.
                 88 LKMO-FL-EF-TRR                 VALUE 'EF'.
                 88 LKMO-FL-DRT-EF-TRR             VALUE 'RE'.
               14 LKMO-ESESSI                    PIC S9(9) COMP-3.
               14 LKMO-HSESSI                    PIC S9(7) COMP-3.
               14 LKMO-ELIQUI                    PIC S9(9) COMP-3.
               14 LKMO-HLIQUI                    PIC S9(7) COMP-3.
               14 LKMO-EPTAEX                    PIC S9(9) COMP-3.
               14 LKMO-FPTAEX                    PIC S9(9) COMP-3.
               14 LKMO-DB4A2M                    PIC S9(9) COMP-3.
               14 LKMO-DB4A2M1                   PIC S9(9) COMP-3.
               14 LKMO-ZFONCT                    PIC X(3).
           08 LKMO-CGLKN070.
             11 LKMO-GPAR08B                     PIC S9(9) COMP-3.
             11 LKMO-CGMN70TA
                            OCCURS 275 TIMES
                            INDEXED BY IX-LK70.
               14 LKMO-N70-CNAPRG                PIC X(5).
                 88 LKMO-N70-FL-CNAPRG-PAF-N-MAJO  VALUE 'PAFF1' 'PAFF2'
            'PAFF4' 'PAFFA' 'PAFFB' 'PAFFD'.
                 88 LKMO-N70-FL-CNAPRG-PAF-N-MAJ2  VALUE 'PAFF5' 'PAFF6'
            'PAFF7' 'PAFFE' 'PAFFF' 'PAFFG'.
                 88 LKMO-N70-FL-CNAPRG-PAF-N-MAJ3  VALUE 'PAFF8' 'PAFF9'
            'PAFFH' 'PAFFI'.
                 88 LKMO-N70-FL-CNAPRG-PPA-N-MAJO  VALUE 'PPAN1' 'PPAN2'
            'PPAN4'.
                 88 LKMO-N70-FL-CNAPRG-PPA-MAJO    VALUE 'PPIN1'.
               14 LKMO-N70-CNAPRG1 REDEFINES LKMO-N70-CNAPRG.
               17 LKMO-CNAPRS                    PIC X(3).
                 
                 88 LKMO-FL-CNAPRS-RSA-FICTIF      VALUE 'SAF' 'SIF'.
                 88 LKMO-FL-CNAPRS-RSF             VALUE 'RSF'.
               17 LKMO-RSNAPR                    PIC X(2).
           08 LKMO-CGANN070.
             11 LKMO-ANC-GPAR08A                 PIC S9(9) COMP-3.
             11 LKMO-ANC-GPAR08B                 PIC S9(9) COMP-3.
             11 LKMO-ANC-PCDRET                  PIC X(4).
             11 LKMO-ANC-CGMN70TB
                            OCCURS 275 TIMES
                            INDEXED BY IX-AN70.
               14 LKMO-N70-CNAPRG                PIC X(5).
                 88 LKMO-N70-FL-CNAPRG-PAF-N-MAJO  VALUE 'PAFF1' 'PAFF2'
            'PAFF4' 'PAFFA' 'PAFFB' 'PAFFD'.
                 88 LKMO-N70-FL-CNAPRG-PAF-N-MAJ2  VALUE 'PAFF5' 'PAFF6'
            'PAFF7' 'PAFFE' 'PAFFF' 'PAFFG'.
                 88 LKMO-N70-FL-CNAPRG-PAF-N-MAJ3  VALUE 'PAFF8' 'PAFF9'
            'PAFFH' 'PAFFI'.
                 88 LKMO-N70-FL-CNAPRG-PAF-MAJO    VALUE 'PAFF3' 'PAFFC'
           .
                 88 LKMO-N70-FL-CNAPRG-PPA-N-MAJO  VALUE 'PPAN1' 'PPAN2'
            'PPAN4'.
                 88 LKMO-N70-FL-CNAPRG-PPA-MAJO    VALUE 'PPIN1'.
               14 LKMO-N70-CNAPRG1 REDEFINES LKMO-N70-CNAPRG.
               17 LKMO-CNAPRS                    PIC X(3).
                 
                 88 LKMO-FL-CNAPRS-RSF             VALUE 'RSF'.
               17 LKMO-RSNAPR                    PIC X(2).
      *END_OF_COPY_FILE
      *    COPY  CGLKMP.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLKMP.CPY"
      *****************************************************************
      *                                                               *
      *   COPYBOOK NAME  : CGLKMP                                     *
      *                                                               *
      *   COPYBOOK DESC  : LK OPERATION ACCES PARTIC                  *
      *                                                               *
      *   GENERATION DATE: 03/03/17                                   *
      *              TIME: 11:47:44                                   *
      *****************************************************************
         05 LKMP-RECORD-LKMP.
           08 LKMP-PERSONNE
                            OCCURS 027 TIMES
                            INDEXED BY IX-PEP.
             11 LKMP-CGPE4PNS
                            OCCURS 003 TIMES
                            INDEXED BY IX-PPNS.
               14 LKMP-CNAPEN                    PIC X(1).
                 88 LKMP-FL-PENS-SAUF-REOR         VALUE '1'.
                 88 LKMP-FL-REOR-CRAM-CDC          VALUE '2'.
                 88 LKMP-FL-AUTR-PERE-OU-REVS      VALUE '3'.
                
                 88 LKMP-FL-PNS-RAT                VALUE '7'.
                 88 LKMP-FL-PNS-AUT                VALUE '8'.
                 88 LKMP-FL-PNS-CJT-CHA            VALUE '9'.
                 88 LKMP-FL-PNS-ABS                VALUE 'N'.
                 88 LKMP-FL-PNS                    VALUE '1' '2' '3' '4'
            '5' '6' '7' '8' '9'.
               14 LKMP-CNAREF                    PIC X(1).
                 88 LKMP-FL-PERS-PHYS-REF          VALUE 'P'.
                 88 LKMP-FL-PERS-MRAL-REF          VALUE 'M'.
               14 LKMP-NREFER                    PIC S9(7) COMP-3.
               14 LKMP-INDPNS                    PIC 9(1).
               14 LKMP-CDHIS001                  PIC S9(9) COMP-3.
               14 LKMP-CDHIS002                  PIC S9(9) COMP-3.
               14 LKMP-CDPE4PNS.
               17 LKMP-CPENAR                    PIC X(1).
                 88 LKMP-FL-DEMA-ACT               VALUE 'A'.
                 88 LKMP-FL-DEMA-REFU              VALUE 'R'.
               17 LKMP-ECPSAH                    PIC S9(9) COMP-3.
               17 LKMP-FCPSAH                    PIC S9(9) COMP-3.
               17 LKMP-CMOREF                    PIC X(1).
                 88 LKMP-FL-CMOREF-E               VALUE 'E'.
               17 LKMP-MCPSAH                    PIC S9(7)V9(2) COMP-3.
           08 LKMP-DEMANDE
                            OCCURS 003 TIMES
                            INDEXED BY IX-PDD.
             11 LKMP-DDE
                            OCCURS 002 TIMES
                            INDEXED BY IX-DDE.
               14 LKMP-NFICPN                    PIC S9(7) COMP-3.
               14 LKMP-CDHIS001                  PIC S9(9) COMP-3.
               14 LKMP-CDHIS002                  PIC S9(9) COMP-3.
           08 LKMP-CGASM
                            OCCURS 005 TIMES
                            INDEXED BY IX-PPA.
             11 LKMP-CGAM0AGR.
               14 LKMP-INDAGR                    PIC 9(1).
               14 LKMP-CDAM0AGR.
               17 LKMP-EAGAMD                    PIC S9(9) COMP-3.
               17 LKMP-FAGAMD                    PIC S9(9) COMP-3.
           08 LKMP-RUPTURES.
             11 LKMP-RUPTUR-PGEDA2.
               14 LKMP-RUPT-CDHIS001             PIC S9(9) COMP-3.
               14 LKMP-RUPT-CGPGNDAD.
               17 LKMP-RUPT-CMOREF               PIC X(1).
                 88 LKMP-RUPT-FL-CMOREF-E          VALUE 'E'.
               17 LKMP-RUPT-CGPGEDA1.
               20 LKMP-CDPGEDA2
                            OCCURS 025 TIMES
                            INDEXED BY IX-PGEADI.
               23 LKMP-CNAPRS                    PIC X(3).
                
                 88 LKMP-FL-CNAPRS-RSF             VALUE 'RSF'.
               23 LKMP-RSNAPR                    PIC X(2).
               23 LKMP-CDDRO022                  PIC S9(5)V9(2) COMP-3.
             11 LKMP-RUPTUR-DO1APC.
               14 LKMP-RUPT-CDHIS001             PIC S9(9) COMP-3.
               14 LKMP-RUPT-DO1APCD              PIC X(175).
               14 LKMP-RUPT-CGDO11R2 REDEFINES LKMP-RUPT-DO1APCD.
               17 LKMP-RUPT-DO1APC
                            OCCURS 025 TIMES
                            INDEXED BY IX-CHARG.
               20 LKMP-CNAPRS                    PIC X(3).
                 
                 88 LKMP-FL-CNAPRS-PAF             VALUE 'PAF'.
                 88 LKMP-FL-CNAPRS-RSA-FICTIF      VALUE 'SAF' 'SIF'.
                 88 LKMP-FL-CNAPRS-RSF             VALUE 'RSF'.
               20 LKMP-RSNAPR                    PIC X(2).
               20 LKMP-QAPCMO                    PIC S9(3) COMP-3.
             11 LKMP-RUPTUR-DO0DAR.
               14 LKMP-RUPT-CDHIS001             PIC S9(9) COMP-3.
               14 LKMP-RUPT-CDDO0DAR.
               17 LKMP-CMOREF                    PIC X(1).
                 88 LKMP-FL-CMOREF-E               VALUE 'E'.
               17 LKMP-MABRES                    PIC S9(7)V9(2) COMP-3.
               17 LKMP-MABDAC                    PIC S9(7)V9(2) COMP-3.
               17 LKMP-MARPAP                    PIC S9(7)V9(2) COMP-3.
               17 LKMP-MAEPAP                    PIC S9(7)V9(2) COMP-3.
               17 LKMP-MRFRGA                    PIC S9(7)V9(2) COMP-3.
               17 LKMP-MEFRGA                    PIC S9(7)V9(2) COMP-3.
           08 LKMP-STOCK-CGM130.
             11 LKMP-STOCK-DO1APC.
               14 LKMP-S130-CDHIS001             PIC S9(9) COMP-3.
               14 LKMP-S130-CDHIS002             PIC S9(9) COMP-3.
               14 LKMP-S130-DO1APCD              PIC X(175).
               14 LKMP-S130-CGDO11R3 REDEFINES LKMP-S130-DO1APCD.
               17 LKMP-S130-DO1APC
                            OCCURS 025 TIMES
                            INDEXED BY IX-AUTPC.
               20 LKMP-CNAPRS                    PIC X(3).
                
                 88 LKMP-FL-CNAPRS-RSF             VALUE 'RSF'.
               20 LKMP-RSNAPR                    PIC X(2).
               20 LKMP-QAPCMO                    PIC S9(3) COMP-3.
      *END_OF_COPY_FILE
      *    COPY  CGLKNVAS.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLKNVAS.CPY"
      *****************************************************************
      * CGLKNVAS
      *                                                               *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  LINKAGE CGM100                                               *
      *  ==============                                               *
      *                                                               *
      *     ZCOM1 : zones en entrée                                   *
      *     ZCOM2 : zones en entrée et sortie                         *
      * *                                                             *
      *****************************************************************
         05 LK100-ZONCOM.
      *   données en entrée
           10 LK100-ZCOM1.
      *                          - code fonction demandée             *
              15 LK100-CFNCAN     PIC X(02).
      *   données en entrée et en sortie
           10 LK100-ZCOM2.
      *                          - index en-cours liste pelem         *
              15 LK100-ICANB      PIC S9(04).
      *                          - code retour                        *
              15 LK100-CRTCAN     PIC X(02).
      *                          - code retour                        *
              15 LK100-PELEMS-PAYABLES.
                 20 LK100-CNAPRG OCCURS 275
                                 ASCENDING KEY IS LK100-PELEM
                                 INDEXED BY IX-CNAPRG.
                    25 LK100-PELEM.
                       30 LK100-CNAPRS PIC X(3).
                       30 LK100-RSNAPR PIC X(2).
              15 LK100-DPTREF    PIC 9(8).
              15 LK100-DPERRF    PIC 9(8).
      ****************************************** FIN COPY CGLKNVAS ****
      *****************************************************************
      /
          05 LS-INDICE-PELEMX.
              15 LS-IN-PELEM-AFAD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFAN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFAN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFAN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFAN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFAN5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFAM1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFRN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFRN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFRN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AFRN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESNA  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESM1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESNB  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESM2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESNC  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESND  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESNE  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AESN5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-MPIN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-MPIN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ASFN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ASFN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ASFN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ASFN6  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ASFN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ASFN5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ASFN7  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ASFN8  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AH1N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AH1N6  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AH1N7  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AH2N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AH2N6  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AH2N7  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ3N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ3N2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ3N3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ3N4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ3N5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ3N6  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ3N7  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ6N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ6NA  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ6N2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ6N3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ6N4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ6N5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ6N6  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ6N7  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ2N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ2N2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ4N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ4N3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ4N4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ5N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ5N2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ5N3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CFAD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CFAN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CFAD2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CFAN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-APLN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-APLN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-APLN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-APLN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-APLN5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ALFD2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ALFD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ALFN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ALFN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ALFN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ALSD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ALSN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ARSN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ARSN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ARSN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ARSN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ARSN5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ARSM1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSIN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSID1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSIN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCIN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCID1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSDN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSDN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSDD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSDD2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSDN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSDN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCDN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCDN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCDD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCDD2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSJN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSJD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSJN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCJN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCJD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSUN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSUN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSUN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSUN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSUD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSUD2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSUD3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSUD4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCUN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCUN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCUN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCUN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCUD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCUD2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCUD3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCUD4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSBN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSBN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSBN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSBD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSBD2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSBD3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCBN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCBN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCBN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCBD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCBD2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RCBD3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFA  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFB  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFC  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFD  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFE  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF6  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFF  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF7  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFG  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF8  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFH  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFF9  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PAFFI  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PPAN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PPAN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PPAN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PPIN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SAFF1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SAFF2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SAFF3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SAFFA  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SAFFB  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SAFFC  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SIFF1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SIFF2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SIFF3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SIFFA  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SIFFB  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-SIFFC  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ADIN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-ADIN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-DGTN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-DGTN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-FH1N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-FH1N2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-FH2N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-FH2N2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-MV1N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-MV1N3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-MV2N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-MV2N3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CH1N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CH1N3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CH2N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CH2N3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-CDIN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AJ1N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AJ2N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AJ3N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN4  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN5  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN3  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN6  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN7  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN8  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AVPN9  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-RSOD1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ1N1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-PJ1N2  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-AMIN1  PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0200   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0201   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0202   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0203   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0204   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0205   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0206   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0207   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0208   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0209   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0210   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0211   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0212   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0213   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0214   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0215   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0216   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0217   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0218   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0219   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0220   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0221   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0222   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0223   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0224   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0225   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0226   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0227   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0228   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0229   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0230   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0231   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0232   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0233   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0234   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0235   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0236   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0237   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0238   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0239   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0240   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0241   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0242   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0243   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0244   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0245   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0246   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0247   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0248   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0249   PIC S9(5) COMP-3 VALUE 00000.
              15 LS-IN-PELEM-0250   PIC S9(5) COMP-3 VALUE 00000.
      *
      * Texte  : A998.CCR1678 : Création nvlle prestation : Allocation d
      *          installation etudiante (ALINE)
      *          (code prestation = AIE)
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V02100
      *
      * Chantier : 1455H     Début : 14/02/2007     Fin : 14/02/2007
      *
      * Texte  : PAJE : CMG structure
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V02200
      *
      * Chantier : 1728B     Début : 24/07/2007     Fin : 24/07/2007
      *
      * Texte  : Prise en compte RSA : A998.CCR1728B.
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V02400
      *
      * Chantier : 1689D     Début : 01/02/2008     Fin : 01/02/2008
      *
      * Texte  : AVP congé soutient familial.
      *          Création AVPN8
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03100
      *
      * Chantier : 1943D     Début : 08/02/2010     Fin : 08/02/2010
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03200
      *
      * Chantier : 1961F     Début : 19/03/2010     Fin : 12/04/2010
      *
      * Texte  : A998.CCR1961 : RSA jeune.
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03310
      *
      * Chantier : 2015A     Début : 22/10/2010     Fin : 22/10/2010
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03400
      *
      * Chantier : 2050C     Début : 08/02/2011     Fin : 08/02/2011
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03800
      *
      * Chantier : 2100B     Début : 23/07/2012     Fin : 23/07/2012
      *
      * Texte  : A998.CCR2100B : CEE - Calcul des droits
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V03900
      *
      * Chantier : 2221A     Début : 25/02/2013     Fin : 25/02/2013
      *
      * Texte  : AMI - Allocation Migrants
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04000
      *
      * Chantier : 1R400     Début : 09/04/2013     Fin : 09/04/2013
      *
      * Texte  : hors la loi dmt/dmf
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04100
      *
      * Chantier : 2300A     Début : 09/10/2013     Fin : 09/10/2013
      *
      * Texte  :
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04500
      *
      * Chantier : 2414A     Début : 19/01/2015     Fin : 19/01/2015
      *
      * Texte  : a998.cce2414a:suppression des canevas suivants
      *          CAV,CAVN1,CAP,CAPN1,RMA,RMAN1,RMP,RMPN1,PFI,PFIN1,PFR,P
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04600
      *
      * Chantier : 2409A     Début : 10/03/2015     Fin : 10/03/2015
      *
      * Texte  : A998.CCR2409A : Mise sous condition ressources AFA.
      *          Création des canevas des pelem AFR et màj hiérarchisati
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04700
      *
      * Chantier : 2445C     Début : 23/06/2015     Fin : 23/06/2015
      *
      * Texte  : A998.CCR2445C : PAC simple fictive.
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *---------------------------------------------------------------
      *                Version : V04800
      *
      * Chantier : 2470F     Début : 11/01/2016     Fin : 14/01/2016
      *
      * Texte  : A998.CCR2470F : PPA: Conditions élégibilité
      *
      *
      *
      * DMFS  :
      *       :
      *---------------------------------------------------------------
      *END_OF_COPY_FILE
      *    COPY  CGLKPIMO.
      *COPY"/distrib/appli/cristal/05200/ref/cobol/copy/CGLKPIMO.CPY"
      *****************************************************************
      *  D615M.CGLKPIMO          CGLKPIMO
      *****************************************************************
      *                                                               *
      *          ============================================         *
      *                    DONNEES PILOTE-MODULES
      *         =============================================         *
      *                                                               *
      *****************************************************************
         05 LS-MANUELLE.
      *****************************************************************
      *OUISYSPUNCH
           10 LS-MANUELLE-ALPHA.
      *--     code fonction (pour trace)
              15 LS-PCODFN                       PIC X.
      *---    code opération
              15 LS-PCODOP                       PIC XX.
      *---              u242p.cgrGPERS  fonction Générale autres PERS
                 88 LS-PCODOP-FL-GPERS           VALUE '03'.
      *---              u242p.cgrGMRME  fonction Générale MR mME.
                 88 LS-PCODOP-FL-GMRME           VALUE '06'.
      *---              u242p.cgrGENFT  fonction Générale ENFanTs.
                 88 LS-PCODOP-FL-GENFT           VALUE '07'.
      *---              u242p.cgrALLOC  fonction ED condit° ALLOCataire
                 88 LS-PCODOP-FL-ALLOC           VALUE '11'.
      *---              u242p.cgrCOCJT  fonction ED condit° COnJoint
                 88 LS-PCODOP-FL-COCJT           VALUE '12'.
      *---              u242p.cgrENFAN  fonction ED condit° ENFANt
                 88 LS-PCODOP-FL-ENFAN           VALUE '14'.
      *---              u242p.cgrHIERA  fonction HIERArchisation cgmX01
                 88 LS-PCODOP-FL-HIERA-X01       VALUE '22'.
      *---              u242p.cgrHIERA  fonction HIERArchisation cgmX02
                 88 LS-PCODOP-FL-HIERA-X02       VALUE '25'.
      *
      *---    code PELEM (décomposé) nature prestation étudiée + rang
              15 LS-CNAPRG.
                 20 LS-CNAPRS                    PIC XXX.
                 88 LS-FL-CNAPRS-AMI          VALUE 'AMI'.
                 88 LS-FL-CNAPRS-PAC          VALUE 'PAF' 'PPA' 'PPI'.
                 88 LS-FL-CNAPRS-PAF          VALUE 'PAF'.
                 88 LS-FL-CNAPRS-RSA-FIGE     VALUE 'SAF' 'SIF' 'RSD'
                                                    'RSI' 'RSJ'.
                 20 LS-RSNAPR.
                    25 LS-RSNAPR-1                         PIC X.
                    25 LS-RSNAPR-2                         PIC X.
                    25 LS-RSNAPR-2-N REDEFINES LS-RSNAPR-2 PIC 9.
              15 LS-CNAPRG-PELEM REDEFINES LS-CNAPRG PIC X(5).
                 88 LS-FL-CNAPRG-RSA-FIGE     VALUE  'SAFF1' 'SAFF2'
                                             'SAFF3'
                                             'SAFFA' 'SAFFB' 'SAFFC'
                                             'SIFF1' 'SIFF2' 'SIFF3'
                                             'SIFFA' 'SIFFB' 'SIFFC'
                                             'RSDN3' 'RSDN4'
                                             'RSIN2' 'RSJN2'.
      *utile?    88 LS-FL-CNAPRG-PELEM-RSA-FIC-SAFFx
      *utile?                                 VALUE 'SAFF1' 'SAFF2'
      *utile?                                       'SAFF3' 'SAFFA'
      *utile?                                       'SAFFB' 'SAFFC'.
      *
      *---    Famille de la prestation
              15 LS-CFAPRS                       PIC XXX.
      *---    Top maj table DR1 examen DP
              15 LS-FL-MAJ-CDDRP                 PIC  X.
      *---    Indicateur edition notif DP
              15 LS-FL-EDIT-NOTIF                PIC  X.
      *---    Indicateur AT (X28,X29 et X78)*
              15 LS-IND-AT                       PIC  XX.
      *---    accès CDDRV droits
              15 LS-CNAPRS1                      PIC X(03).
              15 LS-RSNAPR1                      PIC X(02).
              15 LS-CNADES                       PIC X.
      *---    accès CDPER ressources
              15 LS-CPTRSA                       PIC X.
                 88 LS-FL-CPTRSA-PER-GARANTIE-RESS   VALUE 'H'.
                 88 LS-FL-CPTRSA-PER-CUM-PEN         VALUE 'P'.
                 88 LS-FL-CPTRSA-ANNUEL-AAH          VALUE 'V'.
                 88 LS-FL-CPTRSA-ESAT-TRIM           VALUE 'W'.
                 88 LS-FL-CPTRSA-MENSUEL-CDI         VALUE 'L'.
                 88 LS-FL-CPTRSA-ANNUEL-PATRIMOINE   VALUE '1'.
              15 LS-CNARES                       PIC X(03).
                 88 LS-FL-CNARES-400-PROP-PENS   VALUE '400'.
                 88 LS-FL-CNARES-406-MAIN-OHEIX  VALUE '406'.
                 88 LS-FL-CNARES-500             VALUE '500'.
      *---
      *---    Cd motif forcage qf AAV
              15 LS-FORCAGE-QF-AAV               PIC X.
      *
      *---    Gesdro transmet plusieurs codes informatio aux notif.
      *---      4443  dans la règle U244P.CGRCDASM (Z01)
      *---      4445                U244P.CGRNATAV (M59)
      *---      8860 8870 8880      U244P.CGRQFPPR (Y03)
      *---    La màj de la table notification s'effectue dans CGM130A
              15 LS-CD-INFOS.
                 20 LS-TAB-CD-INFOS OCCURS 10
                            INDEXED BY IX-CINFOR-1 IX-CINFOR-2
                                       IX-CINFOR-3.
                    25 LS-CINFOR                 PIC 9(5).
                    25 LS-PERSONNE               PIC 9(2).
                 20 LS-IX-CINFOR-MAX     PIC S9(3)  COMP-3.
      *
      *     CODE MONNAIE FRANC EURO
              15 LS-CMOREF                       PIC X.
                 88 LS-FL-CMOREF-F    VALUE 'F'.
                 88 LS-FL-CMOREF-E    VALUE 'E'.
                 88 LS-FL-CMOREF-B    VALUE 'B'.
                 88 LS-FL-CMOREF-P    VALUE 'P'.
      *                                                               *
      *---    Stockage des codes CINAPE de PE7AAH pour l'APEND cgrM43p
              15 LS-APE-CINAPE-TAB.
                 20 LS-APE-CINAPE-PER
                    OCCURS 27 INDEXED BY IX-APE-PER-1.
                    25 LS-APE-CINAPE             PIC X.
                    25 LS-APE-EACTPN3            PIC S9(9) COMP-3.
      *                                                               *
      *---    1572D indicateurs à 'O' si "positionnés".
              15 LS-LOGIND-INDIC-LOGT-INDEPENDT  PIC X.
              15 LS-LOGOLI-INDIC-LOGT-INCONNU    PIC X.
              15 LS-INAC12-INACTIVITE-12MOIS     PIC X.
              15 LS-INACMT-INACTIVITE-MT         PIC X.
      *
      *---    Donnée en E/S de cgrKSTRI
      *---    (sortie pr module Alloc et entrée pr module conjoint)
              15 LS-IND-ALLOC-TRAITE-OU-PAS      PIC X.
                 88 LS-IND-ALLOC-TRAITE            VALUE 'P'.
                 88 LS-IND-ALLOC-TRAITE-NON-SIGNIF VALUE SPACES.
      *
      *-La Zone qui suit a pour objectif de remplacer - dans un but de
      * simplification- tous les blocs de données initialisés chaque
      * mois, par un seul bloc.
           10 LS-INITIALISATION-MENSUELLE.
      *---    D710P.CDDRCEE : Indicateur type droit CEE.
              15 LS-CDDRCEE-TYP-DRT-CEE          PIC X(3).
                 88 LS-FL-CDDRCEE-TYP-DRT-CEE-INIT VALUE SPACES.
                 88 LS-FL-CDDRCEE-TYP-DRT-CEE-CDI  VALUE 'CDI'.
                 88 LS-FL-CDDRCEE-TYP-DRT-CEE-PFE  VALUE 'PFE'.
      *
      *---       Positionne dans Canevas CGRGENER ou CGRGENCE
              15 LS-DOSSIER-CEE-OU-RI            PIC X.
                 88 LS-FL-DOSSIER-CEE              VALUE 'C'.
                 88 LS-FL-DOSSIER-RI               VALUE SPACE.
              15 LS-FL-VERIF-DOSRI               PIC X.
                 88 LS-DOSRI-OK          VALUE 'O'.
                 88 LS-DOSRI-KO          VALUE 'N'.
      *---    Date de demande AGED
              15 LS-DDMGED                       PIC  S9(09) COMP-3.
      *
      *---    Montant forfait logement mois de référence API
              15 LS-MFALRF-DOHCPI                 PIC S9(5)V9(2) COMP-3.
              15 LS-TOP-MAJ-DOHCPI                PIC 9.
      ****--- ATTENTION RSA effet fige CAVAPI stocke ici, aussi
              15 LS-CAVAPI                        PIC  X.
                 88 LS-FL-DMD-EFFE-CAVAPI              VALUE 'O'.
                 88 LS-FL-DMD-NO-EFFE-CAVAPI           VALUE 'N'.
      *---    Demande d'API déterminée ds cgrdeman et utilisée en hiéra
              15 LS-DDMAPI                        PIC  S9(9) COMP-3.
      *---    Type pers. du demandeur d'API
              15 LS-CTYPER-API                    PIC  XXX.
      *---    Date de naissance enfant + 3 mois à destination de règles
      *---    pour prise en compte PJ2 ou non.
      *---    D710p.DT3MOIS mois de date de naissance + 3 mois.
              15 LS-DT3MOIS                       PIC  9(8).
      *--Zones utiles jusqu'à ce que le RSA forcé devienne RSA non forcé
      *-- c'est à dire au jour d'aujourd'hui jusqu'à l'été 2009.
      *---    Stockage du cwmond RSM car effacé par préhiéra qd forçage
              15 LS-CWMOND-RSM-SAUV               PIC XX.
      *---    Stockage du cwmond RSP car effacé par préhiéra qd forçage
              15 LS-CWMOND-RSP-SAUV               PIC XX.
      *---    Indicateur positionné dans un but de performance pour M98
      *---    Indicateur Enfant gardé moins de 16h (U244P.CGRENFGA)
              15 LS-INDICATEUR-MOINS-16H   PIC X.
                88 LS-FL-IND-MOINS-16H-N-SIGNIF VALUE SPACE.
                88 FL-IND-MOINS-16H-OUI        VALUE 'O'.
                88 FL-IND-MOINS-16H-NON        VALUE 'N'.
      *---    Cumul dépense pour la PELEM D710P.MTDEPCMG pour
      *---    PJ5N1 ou PJ5N2 ou PJ5N3
              15 LS-MTDEPCMG-PJ5N1                PIC S9(7)V99 COMP-3.
              15 LS-MTDEPCMG-PJ5N2                PIC S9(7)V99 COMP-3.
              15 LS-MTDEPCMG-PJ5N3                PIC S9(7)V99 COMP-3.
      *
              15 LS-PJ5-STRUCT-INDIC           PIC X OCCURS 3
                    INDEXED BY IX-PJ5-STRUCT-1 IX-PJ5-STRUCT-2.
                 88 FL-PJ5-STRUCT-INDIC-INIT    VALUE SPACE.
      *---          Valeur(s) significative(s) de "positionné" :
                 88 FL-PJ5-STRUCT-INDIC-POSIT   VALUE 'P'.
      *---          Valeur pour "positionner" l'indicateur "structure OK
                 88 FL-PJ5-STRUCT-INDIC-POSIT-P VALUE 'P'.
              15 LS-PJ5-STRUCT-CNAPRG-TABLE.
                 20 LS-PJ5-STRUCT-CNAPRG-TABLE-OCC    OCCURS 3
                    INDEXED BY IX-PJ5-STRUCT-CNAPRG-1
                               IX-PJ5-STRUCT-CNAPRG-2.
                    25 LS-PJ5-STRUCT-CNAPRG        PIC X(5).
      *---       L'alimentation de LS-PJ5-STRUCT-CNAPRG-TOUS est faite
      *---       par LT-PJ5-STRUCT-CNAPRG-TOUS dans la copie applicative
      *---       des services, tout comme le IN-PJ5-STRUCT-MAX
      *---       Ces zones LT-PJ5... sont définies dans la copie working
      *---       des modules SERVICE.
              15 LS-PJ5-STRUCT-CNAPRG-TOUS REDEFINES
                    LS-PJ5-STRUCT-CNAPRG-TABLE    PIC X(15).
      *---       Nombre max d'occ. des tableaux LS-PJ5-...-STRUCT
              15 LS-IN-PJ5-STRUCT-MAX             PIC S9(3)  COMP-3.
      *
              15 LS-AFR-CNAPRG-TAB.
                 20 LS-AFR-CNAPRG-TAB-OCC    OCCURS 4
                    INDEXED BY IX-AFR-CNAPRG-1
                               IX-AFR-CNAPRG-2.
                    25 LS-AFR-CNAPRG.
                       30 LS-AFR-CNAPRS           PIC X(3).
                       30 LS-AFR-RSNAPR           PIC X(2).
      *
      *---       L'alimentation de LS-AFR-CNAPRG-TOUTES est faite
      *---       par LT-AFR-CNAPRG-TOUTES dans la copie applicative
      *---       des services, tout comme le LS-IN-AFR-CNAPRG-MAX
      *---       Ces zones LT-AFR... sont définies dans la copie working
      *---       des modules SERVICE.
              15 LS-AFR-CNAPRG-TOUTES REDEFINES
                    LS-AFR-CNAPRG-TAB             PIC X(20).
      *---       Nombre max d'occ. des tableaux LS-AFR-
              15 LS-IN-AFR-CNAPRG-MAX             PIC S9(3)  COMP-3.
      *
              15 LS-AFR-INDIC-TAB.
                 20 LS-AFR-INDIC-TAB-OCC    OCCURS 4
                    INDEXED BY IX-AFR-IND-1
                               IX-AFR-IND-2.
      *--- D710P.QTENFTOD Nombre d'enfants ouvrant droit
                    25 LS-AFR-QTENFTOD     PIC S9(3) COMP-3.
      *--- D710P.MTBINFT2 Plafond de ressources (borne inf. tranche2)
                    25 LS-AFR-MTBINFT2     PIC S9(7)V9(2) COMP-3.
      *--- D710P.MTBSUPT2 Plafond de ressources (borne sup. tranche2)
                    25 LS-AFR-MTBSUPT2     PIC S9(7)V9(2) COMP-3.
                    25 LS-AFR-MTAFTR.
      *--- D710P.MTAFTR1 MT AF de base tranche retenue
                       30 LS-AFR-MTAFTR1   PIC S9(5)V9(2) COMP-3.
      *--- D710P.MTAFTR3 MT AF tranche 3
                       30 LS-AFR-MTAFTR3   PIC S9(5)V9(2) COMP-3.
                    25 LS-AFR-MTMAFTR REDEFINES LS-AFR-MTAFTR.
                       30 LS-AFR-MTMAFTR1  PIC S9(5)V9(2) COMP-3.
                       30 LS-AFR-MTMAFTR3  PIC S9(5)V9(2) COMP-3.
      *--- D710M.CDCTRAFR CD tranche retenue AFR
                    25 LS-AFR-CTRAFR       PIC X(1).
                       88 FL-CTRAFR-1 VALUE '1'.
                       88 FL-CTRAFR-2 VALUE '2'.
                       88 FL-CTRAFR-3 VALUE '3'.
      *--- D710M.CDMBIAFR MT borne inférieure retenue AFR
                    25 LS-AFR-MBIAFR       PIC S9(7)V9(2) COMP-3.
      *--- D710M.CDMBSAFR MT borne supérieure retenue AFR
                    25 LS-AFR-MBSAFR       PIC S9(7)V9(2) COMP-3.
      *--- D710M.CDMBCAFR MT borne complément dégressif
                    25 LS-AFR-MBCAFR       PIC S9(7)V9(2) COMP-3.
      *--- D710M.CDMCPAFR MT complément d'gressif AFR
                    25 LS-AFR-MCPAFR       PIC S9(5)V9(2) COMP-3.
      *--- Indicateur de présence d'assiette ressource. Mise à jour dans
      * U244P.CGRSAJE2(W92)
                    25 LS-AFR-ASSIETTE     PIC X.
                       88 FL-AFR-ASS-PRST VALUE 'O'.
                       88 FL-AFR-ASS-ABST VALUE 'N'.
      *
      *---    PAC = PAF + PPA
      *---    Indicateur application mesures 06/2016 pour conjoint
      *
              15 LS-PAC-CNAPRG-TAB.
                 20 LS-PAC-CNAPRG-TAB-OCC    OCCURS 22
                    INDEXED BY IX-PAC-CNAPRG-1
                               IX-PAC-CNAPRG-2.
                    25 LS-PAC-CNAPRG.
                       30 LS-PAC-CNAPRS           PIC X(3).
                       30 LS-PAC-RSNAPR           PIC X(2).
      *
      *---       L'alimentation de LS-PAC-CNAPRG-TOUTES est faite
      *---       par LT-PAC-CNAPRG-TOUTES dans la copie applicative
      *---       des services, tout comme le LS-PAC-IN-CNAPRG-MAX
      *---       Ces zones LT-PAC... sont définies dans la copie working
      *---       des modules SERVICE.
              15 LS-PAC-CNAPRG-TOUTES REDEFINES
      *-            LS-PAC-CNAPRG-TAB             PIC X(90).
                    LS-PAC-CNAPRG-TAB             PIC X(110).
      *
      *---       Stockage de la position dans LS-T11- (and co), des
      *---       pelem PAF et PPA dues.
              15 LS-PAC-POS-CNAPRG-DS-T11-TAB.
                 20 LS-PAC-POS-CNAPRG-DS-T11-OCC OCCURS 22
                    INDEXED BY IX-PAC-POS-T11.
                    25 LS-PAC-IX-CNAPRG-DS-T11    PIC S9(3)  COMP-3.
      *
      *---       Nombre max d'occ. des tableaux LS-PAC-
      *---       je prefere mettre LS-PAC- PLUTOT QUE LS-IN-PAC-
              15 LS-PAC-IN-CNAPRG-MAX             PIC S9(3)  COMP-3.
      *
      *---    La zone qui suit contient la position,
      *---    dans le tableau LS-PAC, de la pelem traitee (PAF OU PPA).
      *---    (Comme ls-in-pelem est la position de la pelem traitee
      *---    dans les tableaux de stockage de toutes les pelem).
      *
      *---    LS-PAC-IN-PELEM-PAC est alimentee dans A7510-FN-EXAMDROIT
      *---    du module CGS101.
      **** LS-PAC-IN-PELEM-Pxxxx a pour valeur max LS-PAC-IN-CNAPRG-MAX
              15 LS-PAC-IN-PELEM-PAC              PIC S9(3)  COMP-3.
      ********   LES ZONES QUI SUIVENT CONTIENNENT LA position de la
      ********   prestation dans le tableau ls-pac. LA VALEUR DE LA
      ********   POSITION (DE 1 A 18) est maj dans cgs101a
              15 LS-PAC-IN-PELEM-PAFF1            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFF2            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFF3            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFF4            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFF5            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFF6            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFF7            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFF8            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFF9            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFA            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFB            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFC            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFD            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFE            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFF            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFG            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFH            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PAFFI            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PPAN1            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PPAN2            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PPIN1            PIC S9(3)  COMP-3.
              15 LS-PAC-IN-PELEM-PPAN4            PIC S9(3)  COMP-3.
      *--- PAC = PAF + PPA et PPI, soit 18 pelem
              15 LS-PAC-DONNEES-TAB.
                 20 LS-PAC-DONNEES-TAB-OCC  OCCURS 22
                    INDEXED BY IX-PAC-PELEM-1
                               IX-PAC-PELEM-2.
      *---          {D710P.DTDDPPA } DT demande PPA
                    25 LS-PAC-DTDDPPA                PIC S9(9) COMP-3.
      *---          {     .CDCORPPA} CD Origine demande PPA
      *---                           Va avec LS-PAC-DTDDPPA
                    25 LS-PAC-CDCORPPA               PIC X(3).
                       88 LS-FL-PAC-CORPPA-BAS         VALUE 'BAS'.
                       88 LS-FL-PAC-CORPPA-CTR         VALUE 'CTR'.
                       88 LS-FL-PAC-CORPPA-DEM         VALUE 'DEM'.
                       88 LS-FL-PAC-CORPPA-RSA         VALUE 'RSA'.
                       88 LS-FL-PAC-CORPPA-AAH         VALUE 'AAH'.
      *---          {D710P.DTPPAINI} DT demande PPA initiale
                    25 LS-PAC-DTPPAINI               PIC S9(9) COMP-3.
      *---          {D710M.CDDTRIRF} DT 1er mois trimestre de référence
                    25 LS-PAC-CDDTRIRF               PIC S9(9) COMP-3.
      *---          {D710M.CDDTRIDO} DT 1er mois trimestre de droit
                    25 LS-PAC-CDDTRIDO               PIC S9(9) COMP-3.
      *---          {D710P.DDTRIREF} Mois début du trimestre référence
                    25 LS-PAC-DDTRIREF               PIC S9(9) COMP-3.
      *---          {D710P.DDTRIDRT} Mois début trimestre de droit
                    25 LS-PAC-DDTRIDRT               PIC S9(9) COMP-3.
      *---          {D710P.DTISOPA}  Date isolement PPA
                    25 LS-PAC-DTISOPA                PIC S9(9) COMP-3.
      *---          {D710P.DTSEPIPA} Date séparation initiale PPA
                    25 LS-PAC-DTSEPIPA               PIC S9(9) COMP-3.
      *---          {D710P.DTFPRCJT} Dt fin présence conjoint PPA
                    25 LS-PAC-DTFPRCJT               PIC S9(9) COMP-3.
      *---          {D710P.EVEMAPP}  Evenement MAJI PAF
                    25 LS-PAC-EVEMAPP                PIC X(3).
                       88 LS-FL-PAC-EVEMAPP-ENF        VALUE 'ENF'.
                       88 LS-FL-PAC-EVEMAPP-GRO        VALUE 'GRO'.
                       88 LS-FL-PAC-EVEMAPP-PEC        VALUE 'PEC'.
                       88 LS-FL-PAC-EVEMAPP-ISO        VALUE 'ISO'.
                       88 LS-FL-PAC-EVEMAPP-VIDE       VALUE '   '.
      *
      *---          {D710P.DTEVMAPP} Date evenement MAJI PAF
                    25 LS-PAC-DTEVMAPP               PIC S9(9) COMP-3.
                                                                        
      *---          {D710P.ENFMAPP} Identifiant de l'enft donnant droit
      *---          a la MAJI PAF - c'est le N° fictif pers. = nficpn
                    25 LS-PAC-ENFMAPP                PIC S9(7) COMP-3.
      *--           *-- {D710P.CDMAPP} Indicateur MAJI PAF     --*
                    25 LS-PAC-CDMAPP                 PIC X(1).
                       88 LS-FL-PAC-CDMAPP-VRAI      VALUE 'V'.
                       88 LS-FL-PAC-CDMAPP-FAUX      VALUE 'F' ' '.
                       88 LS-FL-PAC-CDMAPP-F         VALUE 'F'.
      *--           *-- {D710P.CDREDHOS} Indic.réduction pour  --*
      *--           *--                  hospitalisation       --*
                    25 LS-PAC-CDRESHOS               PIC X(1).
                       88 LS-FL-PAC-CDRESHOS-OUI     VALUE 'O'.
                       88 LS-FL-PAC-CDRESHOS-NON     VALUE 'N'.
      *---          {D710P.MTRESFOY} MT total revenus (100% act+ autres)
                    25 LS-PAC-MTRESFOY              PIC S9(7)V99 COMP-3.
      *---          {D710P.MTMFRESS} MT MF-ress PAF remis à zéro
                    25 LS-PAC-MTMFRESS              PIC S9(7)V99 COMP-3.
      *---          {D710P.MTAUTFOY} MT total autres revenus foyer
                    25 LS-PAC-MTAUTFOY              PIC S9(7)V99 COMP-3.
      *---          {D710P.MT100ACF} MT 100% revenus d'activ foyer
                    25 LS-PAC-MT100ACF              PIC S9(7)V99 COMP-3.
      *
      *---          {D710P.CDELICJT}  indic. cond° eligibilite conjoint
      ****  les 88 devraient etre LS-FL-PAC et pas LS-PAC <<<<<<<<<
                    25 LS-PAC-CDELICJT          PIC X.
                       88 LS-PAC-CDELICJT-POSIT-O     VALUE 'O'.
                       88 LS-PAC-CDELICJT-POSIT-N     VALUE 'N'.
                       88 LS-PAC-CDELICJT-NON-POSIT   VALUE SPACE.
      *
      *---          {D710P.CDDETCKO} Indicateur detachement cjt ko
                    25 LS-PAC-CDDETCKO              PIC X.
                       88 LS-FL-PAC-CDDETCKO-POSIT       VALUE 'P'.
                       88 LS-FL-PAC-CDDETCKO-NON-POSIT   VALUE SPACE.
      *
      *---          {D710P.CDELIPPA} Indic. application mesures 06/2016
      *---                 pour  conjoint (alimenté à partir de N286)
                    25 LS-PAC-CDELIPPA          PIC X.
                       88 LS-FL-PAC-CDELIPPA-POSIT       VALUE 'P'.
                       88 LS-FL-PAC-CDELIPPA-NON-POSIT   VALUE SPACE.
      *
      *---          {D710P.CDNACJKO} Indicateur nationalité conjoint KO
                    25 LS-PAC-CDNACJKO              PIC X.
                       88 LS-FL-PAC-CDNACJKO-POSIT       VALUE 'P'.
                       88 LS-FL-PAC-CDNACJKO-NON-POSIT   VALUE SPACE.
      *
      *---          {D710P.CDRECJKO}
                    25 LS-PAC-CDRECJKO              PIC X.
                       88 LS-FL-PAC-CDRECJKO-POSIT       VALUE 'P'.
                       88 LS-FL-PAC-CDRECJKO-NON-POSIT   VALUE SPACE.
      *
      *---           {D710P.MT100AHx} Montant 100% AHx (x = 1 ou 2 selon
      *  nature PGENE)
                    25 LS-PAC-MT100AH1        PIC S9(5)V9(2) COMP-3.
                    25 LS-PAC-MT100AH2        PIC S9(5)V9(2) COMP-3.
      *------------ {D710P.CDGROSS indicateur de presence de grossesse
                    25 LS-PAC-CDGROSS         PIC  X.
                       88 LS-FL-PAC-CDGROSS   VALUE ' '.
                       88 LS-FL-PAC-CDGROSS-O VALUE 'O'.
                       88 LS-FL-PAC-CDGROSS-N VALUE 'N'.
      *
      *---          {D710P.CDISOPPA} Indicateur Isolement PPA
                    25 LS-PAC-CDISOPPA              PIC X.
                       88 LS-FL-PAC-CDISOPPA-POSIT       VALUE 'P'.
                       88 LS-FL-PAC-CDISOPPA-NON-POSIT   VALUE SPACE.
      *-----------------------
      *---          Ce sous niveau pour alimenter table CDACD
      *---                                        ent. ACD gdd ACD
                    25 LS-PAC-CDACDACD.
      *---          {D710M.CDMFOPAF} MT forfaitaire PAF
                     30 LS-PAC-CDMFOPAF           PIC S9(5)V9(2) COMP-3.
      *---          {D710P.MTACTFOY} MT total rev. d'activité foyer
      *---           alimentera {D710M.CDMRAPAF} MT rev.act.38% PAF
                     30 LS-PAC-MTACTFOY           PIC S9(5)V9(2) COMP-3.
      *---          {D710P.MTACTRET} MT tot rev. d'act foyer à cpt L1606
      *---           alimentera {D710M.CDMRVPAF} MT rev.act.62% PAF
                     30 LS-PAC-MTACTRET           PIC S9(5)V9(2) COMP-3.
      *---          {D710M.CDMFLPAF} MT forfait logement PAF
                     30 LS-PAC-CDMFLPAF           PIC S9(5)V9(2) COMP-3.
      *---          {D710M.CDMPFPAF} MT PF pec PAF
                     30 LS-PAC-CDMPFPAF           PIC S9(5)V9(2) COMP-3.
      *---          {D710M.CDMMRPAF} MT MF-ress PAF
                     30 LS-PAC-CDMMRPAF           PIC S9(5)V9(2) COMP-3.
      *---          {D710M.CDMRHPAF} MT Reduction hospitaliere
                     30 LS-PAC-CDMRHPAF           PIC S9(5)V9(2) COMP-3.
      *---          {D710M.CDCSIPAF} CD Sitfam PAF
                     30 LS-PAC-CSIPAF                 PIC X(1).
                        88 LS-FL-PAC-CSIPAF-COUPLE      VALUE 'C'.
                        88 LS-FL-PAC-CSIPAF-ISOLE       VALUE 'I'.
                        88 LS-FL-PAC-CSIPAF-ISOMAJ      VALUE 'M'.
      *---          {D710M.CDQSPPAF} QT surf  plafond expl DOM PAF
                     30 LS-PAC-CDQSPPAF           PIC S9(3)V9(2) COMP-3.
      *-----------------------------------------------------------------
      *--- SOUS-NIVEAU PERSONNES
                    25 LS-PAC-PERS   OCCURS 27
                       INDEXED BY IX-PAC-PER-1
                                  IX-PAC-PER-2.
                                                                        
      *---           {D710P.MTREVACT} MT revenus d'activité avant L1606
                     30 LS-PAC-MTREVACT        PIC S9(5)V9(2) COMP-3.
      *---           {D710P.MTRARACT} MT revenus d'activité à cpt L1606
                     30 LS-PAC-MTRARACT        PIC S9(5)V9(2) COMP-3.
      *---           {D710P.MT038ACT} MT 38% des revenus d'activité
                     30 LS-PAC-MT038ACT        PIC S9(5)V9(2) COMP-3.
      *---           {D710P.MT062ACT} MT 38% des revenus d'activité
                     30 LS-PAC-MT062ACT        PIC S9(5)V9(2) COMP-3.
      *---           {D710P.MTIJSAL } MT des IJ à PEC (pour PAF seules)
                     30 LS-PAC-MTIJSAL         PIC S9(5)V9(2) COMP-3.
      *---           {D710P.MTBASPER} Base ressources de l'occurrence
                     30 LS-PAC-MTBASPER        PIC S9(7)V9(2) COMP-3.
      *---           {D710P.MT700PEC} Montant nature 700 pris en compte
                     30 LS-PAC-MT700PEC        PIC S9(7)V9(2) COMP-3.
      *---              {D710P.CDCEAEXA} Ind cond° de chge deja examinee
                     30 LS-PAC-CDCEAEXA              PIC X.
                       88 LS-FL-PAC-CDCEAEXA-POSIT-P   VALUE 'P'.
                       88 LS-FL-PAC-CDCEAEXA-NON-POSIT VALUE SPACES.
      *---            {D710P.CDCHAPAF} Indicateur de charge PAF
                     30 LS-PAC-CDCHAPAF          PIC X.
                       88 LS-FL-PAC-CDCHAPAF-POSIT VALUE 'P'.
                       88 LS-FL-PAC-CDCHAPAF-POSIT-P VALUE 'P'.
                       88 LS-FL-PAC-CDCHAPAF-NON-POSIT VALUE SPACES.
      *---            {D710P.CD06EG01} Indicateur 006 = 001
                     30 LS-PAC-CD06EG01          PIC X.
                        88 LS-FL-PAC-CD06EG01-OUI    VALUE 'O'.
                        88 LS-FL-PAC-CD06EG01-NON    VALUE 'N'.
                                                                        
      *---           Ce sous niveau pour alimenter table CDACP
      *---                                         ent. ACP gdd ACP
                     30 LS-PAC-CDACPACP.
      *---             {D710P.MTBONIPP} Montant bonification pour l'occ.
      *---             alimentera {D710M.CDMBOPAF} MT bonification
                       35 LS-PAC-MTBONIPP        PIC S9(3)V9(2) COMP-3.
      *---             {D710P.CDNIVBON} Niveau de bonification occ.
      *---             alimentera {D710M.CDCNIVBO} CD niveau bonificat.
                       35 LS-PAC-CDNIVBON        PIC X.
                          88 LS-FL-PAC-CDNIVBON-0        VALUE '0'.
                          88 LS-FL-PAC-CDNIVBON-1        VALUE '1'.
                          88 LS-FL-PAC-CDNIVBON-2        VALUE '2'.
      *---             {D710P.MT100ACT} MT 100% des revenus d'activité
      *---             alimentera {D710M.CDMRAPAP} MT revenus d'activité
                       35 LS-PAC-MT100ACT        PIC S9(5)V9(2) COMP-3.
      *---             {D710P.MTAUTRES} MT autres ressources
      *---             alimentera {D710M.CDMARPAF} MT aut.revenus PAF/pe
                       35 LS-PAC-MTAUTRES        PIC S9(5)V9(2) COMP-3.
      *
                    25 LS-PAC-CDACLACL OCCURS 03
                       INDEXED BY IX-PAC-ACL-1
                                  IX-PAC-ACL-2.
                     30 LS-PAC-DMODFI          PIC S9(9) COMP-3.
                     30 LS-PAC-CDPAF.
                       35 LS-PAC-CDPAF-CNAPRS1 PIC X(3).
                       35 LS-PAC-CDPAF-RSNAPR1 PIC X(2).
      *
      *---    RSA = prestations RSA actives à/c de 01/2017 : RSD RSI RSJ
      *---        + prestations RSA fictives                 SAF SIF
      *--*    ATTENTION, CE TABLEAU NE STOCKE PAS LES DONNéES DES
      *--*    PRESTATIONS RSA dont la DATE DE DEBUT DE VALIDITE
      *--*    EST ANTERIEURE AU 01/01/2017
      *
              15 LS-RSA-CNAPRG-TAB.
                 20 LS-RSA-CNAPRG-TAB-OCC    OCCURS 16
                    INDEXED BY IX-RSA-CNAPRG-1
                               IX-RSA-CNAPRG-2.
                    25 LS-RSA-CNAPRG.
                       30 LS-RSA-CNAPRS        PIC X(3).
                          88 LS-FL-RSA-CNAPRS-FICT VALUE 'SAF' 'SIF'.
                       30 LS-RSA-RSNAPR        PIC X(2).
      *
      *---       LS-RSA-CNAPRG-JANV17 contient le libelle des
      *---       seize pelem RSA de la dmf 2539x
      *---       L'alimentation de LS-RSA-CNAPRG-JANV17 est faite
      *---       par LT-RSA-CNAPRG-JANV17 dans la copie applicative
      *---       des services, tout comme le LS-RSA-IN-CNAPRG-MAX
      *---       Ces zones LT-RSA... sont définies dans la copie working
      *---       des modules SERVICE.
              15 LS-RSA-CNAPRG-JANV17 REDEFINES
                    LS-RSA-CNAPRG-TAB          PIC X(80).
      *
      *---       Stockage de la position dans LS-T11- (and co), des
      *---       pelem RSA fictives et RSA dues. (a/c de la dmf2439A)
              15 LS-RSA-POS-CNAPRG-DS-T11-TAB.
                 20 LS-RSA-POS-CNAPRG-DS-T11-OCC OCCURS 16
                    INDEXED BY IX-RSA-POS-T11.
                    25 LS-RSA-IX-CNAPRG-DS-T11 PIC S9(3)  COMP-3.
      *
      *---       Nombre max d'occ. des tableaux LS-RSA-
              15 LS-RSA-IN-CNAPRG-MAX          PIC S9(3)  COMP-3.
      *
      *---    LS-RSA-IN-PELEM-RSA est alimentee dans A7510-FN-EXAMDROIT
      *---    du module CGS101.
              15 LS-RSA-IN-PELEM-RSA           PIC S9(3)  COMP-3.
      *
      *--- LS-RSA-IN-PELEM-Rxxxx a pour valeur max LS-RSA-IN-CNAPRG-MAX
      *--- LES ZONES QUI SUIVENT CONTIENNENT LA position de la
      *--- prestation dans les tableaux ls-rsa. LA VALEUR DE LA
      *--- POSITION (DE 1 A 16) est maj dans cgs101a
              15 LS-RSA-IN-PELEM-SAFF1         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SAFF2         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SAFF3         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SAFFA         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SAFFB         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SAFFC         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SIFF1         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SIFF2         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SIFF3         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SIFFA         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SIFFB         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-SIFFC         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-RSIN2         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-RSJN2         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-RSDN3         PIC S9(3)  COMP-3.
              15 LS-RSA-IN-PELEM-RSDN4         PIC S9(3)  COMP-3.
      *
      *--- RSA = SAF + SIF + RSD + RSI + RSJ 01/2017 = soit 16 pelem
              15 LS-RSA-DONNEES-TAB.
                 20 LS-RSA-DONNEES-TAB-OCC  OCCURS 16
                    INDEXED BY IX-RSA-PELEM-1
                               IX-RSA-PELEM-2.
      *---          {D710P.DTDDRSA } DT demande RSA
                    25 LS-RSA-DTDDRSA          PIC S9(9) COMP-3.
      *---          {D710M.CDDCLRSA} DT cloture/DF demande RSA
                    25 LS-RSA-DCLRSA           PIC S9(9) COMP-3.
      *---          {D710M.CDCORRSA} CD origine demande RSA
                    25 LS-RSA-CORRSA           PIC X(3).
                       88 LS-FL-RSA-CORRSA-DEM            VALUE 'DEM'.
      *---          {D710M.CDDTRIDO} DT 1er mois trimestre de droit
                    25 LS-RSA-DTRIDO           PIC S9(9) COMP-3.
      *---          {D710M.CDAPIR23} CD allocation de veuvage API/RSA
      ****          25 LS-RSA-CAVAPI           PIC  X.
      ****        est LS-CAVAPI
      ****          donnee utilisee par le RSA du - donnee unitaure.
      *---          {D710P.DDTRIRES} Mois debut du trimestre RSA
                    25 LS-RSA-DDTRIRES         PIC S9(9) COMP-3.
      *---          {D710P.DFTRIRES} Mois fin   du trimestre RSA
                    25 LS-RSA-DFTRIRES         PIC S9(9) COMP-3.
      *---          {D710P.DDDRTRSA} Mois de debut du trim. de droit
                    25 LS-RSA-DDDRTRSA         PIC S9(9) COMP-3.
      *---          {D710P.MOISTD  } Rang du mois du TD (1, 2 ou 3)
                    25 LS-RSA-MOISTD           PIC S9(1) COMP-3.
      *---          Date du Rang du mois du TD (1er jour du mois)
                    25 LS-RSA-MOISTD-DATE01    PIC S9(9) COMP-3.
      *---          Date du Rang du mois du TD (dernier jour du mois)
                    25 LS-RSA-MOISTD-DATE31    PIC S9(9) COMP-3.
      *---          {D710P.CDSITSAF} CD Sitfam RSA Fictif
      *---          et utilisee pour la maj de {D710M.CDCSISAF}
      *---          CD Sitfam - entite ??? pour le moment
      *
                    25 LS-RSA-CDSITSAF         PIC X(3).
                        88 LS-FL-RSA-CDSITSAF-COUPLE      VALUE 'C'.
                        88 LS-FL-RSA-CDSITSAF-ISOLE       VALUE 'I'.
                        88 LS-FL-RSA-CDSITSAF-ISOMAJ      VALUE 'M'.
      *---          {D710P.DTISOLT } DT isolement
                    25 LS-RSA-DTISOLT          PIC S9(09) COMP-3.
      *---          {D710P.CDAVIRSA} Indicateur condition AVI-RSA
                    25 LS-RSA-CDAVIRSA         PIC X(1).
      *---             Valeur significative de positionné à N
                       88 LS-FL-RSA-CDAVIRSA-POSIT-N       VALUE 'N'.
      *---             {D710P.CDISOLT } Indicateur d'isolement
                    25 LS-RSA-CDISOLT          PIC X(1).
      *---             Valeur signifiant non positionné.
                       88 LS-FL-RSA-CDISOLT-NON-POSIT      VALUE SPACE.
                       88 LS-FL-RSA-CDISOLT-POSIT          VALUE 'P'.
      *---          {D710P.DTSEPINI} Date séparation initiale couple
                    25 LS-RSA-DTSEPINI         PIC S9(09) COMP-3.
      *---          {D710P.CDSANRSA} Indicateur sanction RSA
                    25 LS-RSA-CDSANRSA         PIC 9.
                       88 LS-FL-RSA-CDSANRSA-NON-POSIT     VALUE 0.
                       88 LS-FL-RSA-CDSANRSA-POSIT         VALUE 1.
      *---          {D710P.MTSANPCG} Montant de la sanction CG
                    25 LS-RSA-MTSANPCG         PIC S9(7)V99 COMP-3.
      *---          {D710P.MTSANRSA} Montant de la sanction à appliquer
                    25 LS-RSA-MTSANRSA         PIC S9(7)V99 COMP-3.
      *---          {D710P.CDALL25 } Indic. alloc. de moins de 25 ans
                    25 LS-RSA-CDALL25          PIC X(1).
                       88 LS-FL-RSA-CDALL25-NON-POSIT  VALUE SPACE.
                       88 LS-FL-RSA-CDALL25-POSIT      VALUE 'P'.
      *---          {D710P.CDMAJI  }
                    25 LS-RSA-CDMAJI           PIC X(1).
                       88 LS-FL-RSA-CDMAJI-NON-POSIT   VALUE SPACE.
                       88 LS-FL-RSA-CDMAJI-POSIT       VALUE 'P'.
      *---          {D710P.MTRGRSM}  Montant Revenu Garanti RSM
                    25 LS-RSA-MTRGRSM         PIC S9(7)V99 COMP-3.
      *---          {D710P.MTPFRSA}  Mtt des prestations a deduire RSA
                    25 LS-RSA-MTPFRSA         PIC S9(7)V99 COMP-3.
      *---          {D710P.CDREDHOS} Indic. de réduction pour hospital.
                    25 LS-RSA-CDREDHOS         PIC X(1).
                       88 LS-FL-RSA-CDREDHOS-NON-POSIT  VALUE SPACE.
                       88 LS-FL-RSA-CDREDHOS-POSIT      VALUE 'P'.
      *---          {D710P.EVEMAJI } Evènement MAJI
                    25 LS-RSA-EVEMAJI          PIC X(3).
                       88 LS-FL-RSA-EVEMAJI-ENF        VALUE 'ENF'.
                       88 LS-FL-RSA-EVEMAJI-GRO        VALUE 'GRO'.
                       88 LS-FL-RSA-EVEMAJI-PEC        VALUE 'PEC'.
                       88 LS-FL-RSA-EVEMAJI-ISO        VALUE 'ISO'.
                       88 LS-FL-RSA-EVEMAJI-VIDE       VALUE '   '.
      *---          {D710P.DTEVMAJ } DT évènement MAJI
                    25 LS-RSA-DTEVMAJ          PIC S9(09) COMP-3.
      *---          {D710P.ENFMAJI } Id enfant MAJI
                    25 LS-RSA-ENFMAJI          PIC S9(7) COMP-3.
      *
                    25 LS-RSA-CDSADSAD.
      *---             {D710M.CDMRSRVM} MT revenu minimum garanti RSA
                       30 LS-RSA-CDMRSRVM      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDMRSPFA} MT prestations familiales RSA
                       30 LS-RSA-CDMRSPFA      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDMRSFLG} MT forfait aide logt
                       30 LS-RSA-CDMRSFLG      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDMRSRMN} MT ressources mensuelles RSA
                       30 LS-RSA-CDMRSRMN      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDMRSSOA} MT sanction alim obligat RSA
                       30 LS-RSA-CDMRSSOA      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDMRSRHS} MT réduction hospital.   RSA
                       30 LS-RSA-CDMRSRHS      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDMRSABN} MT abattement neutral.   RSA
                       30 LS-RSA-CDMRSABN      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDMRSCMI} MT cumul intégral        RSA
                       30 LS-RSA-CDMRSCMI      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDCRMR11} MT assiette RSA PF
                       30 LS-RSA-CDCRMR11      PIC S9(5)V9(2) COMP-3.
      *---             {D710M.CDCSISAF} CD situation familiale RSA fict
                       30 LS-RSA-CDCSISAF      PIC X.
      *
      *                 ** groupe créé ici alors que l'on n'est  **
      *                 ** pas par prestations...                **
                    25 LS-RSA-CDSARSAR.
      *---             {D710M.CDMRSRCG} MT réduction CG RSA
                       30 LS-RSA-CDMRSRCG      PIC S9(5)V9(2) COMP-3.
      *
      *--- SOUS-NIVEAU PERSONNES LS-RSA-
                    25 LS-RSA-PERS   OCCURS 27
                       INDEXED BY IX-RSA-PER-1
                                  IX-RSA-PER-2.
      *---             {D710P.DTSANRSA} Mois de fin délai sanction RSA
                       30 LS-RSA-DTSANRSA      PIC  S9(9) COMP-3.
      *---             {D710P.CDSANPER} Indic. personne à sanctionner
                       30 LS-RSA-CDSANPER      PIC X(1).
                          88 LS-FL-RSA-CDSANPER-NON-POSIT  VALUE SPACE.
                          88 LS-FL-RSA-CDSANPER-POSIT      VALUE 'P'.
      *---             {D710P.CDORISAN} origine creance alimentaire
                       30 LS-RSA-CDORISAN      PIC X(3).
      *---             {D710P.MTCUMRSA} Montant cumul intégral
                       30 LS-RSA-MTCUMRSA      PIC S9(7)V99 COMP-3.
      *---             {D710P.MTSANPER} Montant de la sanction
                       30 LS-RSA-MTSANPER      PIC S9(7)V99 COMP-3.
      *---             {D710P.MTREVNEU} Mtt des ressources neutralisees
                       30 LS-RSA-MTREVNEU      PIC S9(7)V99 COMP-3.
      *---             {D710P.CDREVACT} Indicateur "Revenus d'activité"
                       30 LS-RSA-CDREVACT      PIC X.
                          88 LS-FL-RSA-CDREVACT-NON-POSIT VALUE SPACE.
                          88 LS-FL-RSA-CDREVACT-POSIT     VALUE 'P'.
      *---             {D710P.MTABACG } Mtt accordé de l'abattement CG
                       30 LS-RSA-MTABACG       PIC S9(7)V99 COMP-3.
      *---             {D710M.CDMRPABN} MT abtt/neutral. RSA par pers.
                       30 LS-RSA-MRPABN        PIC S9(5)V99 COMP-3.
      *---             {D710P.MTRESENF} Mtt mensuel net pour notion de
                       30 LS-RSA-MTRESENF      PIC S9(7)V99 COMP-3.
                       30 LS-RSA-MTRESENF-INDIC    PIC X.
                          88 LS-FL-RSA-MTRESENF-NON-SIGNIF VALUE 'N'.
                          88 LS-FL-RSA-MTRESENF-SIGNIF     VALUE 'O'.
      *---             {D710P.MTRESMEN} Montant mensuel net
                       30 LS-RSA-MTRESMEN      PIC S9(7)V99 COMP-3.
      *---             {D710P.MTMOYRA } Mtt moyen des revenus d'activ.
                       30 LS-RSA-MTMOYRA       PIC S9(7)V99 COMP-3.
      *---             {D710P.MTREXPEC } Montant 006/008 pris en compte
                       30 LS-RSA-MTREXPEC      PIC S9(7)V99 COMP-3.
      *--- {D710P.MTIJSAL  } Mtt des IJ a considerer comme des salaires
                       30 LS-RSA-MTIJSAL       PIC S9(7)V99 COMP-3.
      *---             non alimenté pour RSA effet fige mais regle
      *---             commune à RSA.
                                                                        
                       30 LS-RSA-CDSAPSAP.
      *---                {D710M.CDMRPRMN}  Montant ress mensuelle RSA
                          35 LS-RSA-CDMRPRMN      PIC S9(5)V99 COMP-3.
      *---                {D710M.CDMRPABN}  Montant abattement rsa
                          35 LS-RSA-CDMRPABN      PIC S9(5)V99 COMP-3.
      *---                {D710M.CDMRPEXC}  Montant revenu exceptionnel
                          35 LS-RSA-CDMRPEXC      PIC S9(5)V99 COMP-3.
      *---                Top pour màj SAPSAP (différenciation montants
      *---                 nuls calculés et  pas d'occurrence)
                          35 LS-RSA-TOP-MAJ-SAPSAP PIC S9(1) COMP-3.
                             88 FL-RSA-TOP-MAJ-SAPSAP-N VALUE 0.
                             88 FL-RSA-TOP-MAJ-SAPSAP-O VALUE 1.
      *
      *
                    25 LS-RSA-CDACLACL OCCURS 03
                       INDEXED BY IX-RSA-ACL-1
                                  IX-RSA-ACL-2.
                       30 LS-RSA-DMODFI          PIC S9(9) COMP-3.
                       30 LS-RSA-CDSAF.
                          35 LS-RSA-CDSAF-CNAPRS1 PIC X(3).
                          35 LS-RSA-CDSAF-RSNAPR1 PIC X(2).
      *
      *---    Indicateurs Agrément OK (D710P.CDAGROK) 1 occur. par enft.
              15 LS-ZONE-AGR.
                 20 LS-ZONE-CDAGROK
                    OCCURS 27 INDEXED BY IX-AGROK.
                    25 LS-CDAGROK                PIC X.
                       88 FL-CDAGROK-OUI         VALUE 'O'.
                       88 FL-CDAGROK-NON         VALUE 'N'.
      *
      *---    Demande de RMI déterminée ds cgrddrmi et utilisée en hiéra
              15 LS-DTDDRMI                       PIC  S9(9) COMP-3.
      *---    Demande de RSA déterminée ds cgrddRSA
              15 LS-DTDDRSA                       PIC  S9(9) COMP-3.
              15 LS-DEM-CORRSA                    PIC X(3).
                 88 LS-FL-DEM-CORRSA-API             VALUE 'API'.
                 88 LS-FL-DEM-CORRSA-RMI             VALUE 'RMI'.
                 88 LS-FL-DEM-CORRSA-DEM             VALUE 'DEM'.
              15 F                                PIC X(3).
              15 LS-DEM-DTRIDO                    PIC S9(9) COMP-3.
      *--- Demande prestation retenue pour le traitement en cours. DMH
              15 LS-DEM-TRAITEE-SAMJX.
                 20 LS-DEM-TRAITEE-SAMX.
                    25 LS-DEM-TRAITEE-SA9         PIC 9(4).
                    25 LS-DEM-TRAITEE-M9          PIC 99.
                 20 LS-DEM-TRAITEE-SAM9 REDEFINES
                       LS-DEM-TRAITEE-SAMX        PIC 9(6).
                 20 LS-DEM-TRAITEE-J9             PIC 99.
              15 LS-DEM-TRAITEE-SAMJ9   REDEFINES
                    LS-DEM-TRAITEE-SAMJX          PIC 9(8).
      *
      *---    Stockage des informations concernant la demande RSO
              15 LS-INFO-DDE-RSO.
                 20 LS-NFICPN-DDE-RSO             PIC S9(7) COMP-3.
                 20 LS-DEMRSO-DDE-RSO             PIC S9(9) COMP-3.
                 20 LS-CDHIS001-DDE-RSO           PIC S9(9) COMP-3.
                 20 LS-CDHIS002-DDE-RSO           PIC S9(9) COMP-3.
                 20 LS-C24RMI-DDE-RSO             PIC X.
                 20 LS-D24RMI-DDE-RSO             PIC S9(9) COMP-3.
                                                                        
      *---    Stockage des informations concernant la demande AMI
              15 LS-INFO-DDE-AMI.
                 20 LS-MID-DDDRAM                 PIC S9(9) COMP-3.
                 20 LS-MID-DCLDAM                 PIC S9(9) COMP-3.
                 20 LS-MID-CCLDAM                 PIC  X(3).
                 20 LS-MID-NREFER                 PIC S9(7) COMP-3.
                 20 LS-MID-CNAREF                 PIC  X(1).
                 20 LS-MID-CLPBAM                 PIC  X(2).
                    88 LS-MID-CLPBAM-BS           VALUE 'BS'.
      *
              15 LS-MDROPI-PJ4N3-REDUIT           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ4N3-RED-EF           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ4N3-ENT-EF           PIC S9(5)V9(2) COMP-3.
      *
              15 LS-MDROPI-PJ4N4-REDUIT           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ4N4-RED-EF           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ4N4-ENT-EF           PIC S9(5)V9(2) COMP-3.
      *
              15 LS-MDROPI-PJ5N1-REDUIT           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ5N1-RED-EF           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ5N1-ENT-EF           PIC S9(5)V9(2) COMP-3.
      *
              15 LS-MDROPI-PJ5N2-REDUIT           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ5N2-RED-EF           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ5N2-ENT-EF           PIC S9(5)V9(2) COMP-3.
      *
              15 LS-MDROPI-PJ5N3-REDUIT           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ5N3-RED-EF           PIC S9(5)V9(2) COMP-3.
              15 LS-MDROPI-PJ5N3-ENT-EF           PIC S9(5)V9(2) COMP-3.
      *---    Montants AAH-MIN pour AHxN1/N6
              15 LS-MT-AAH-MIN-AH1N1              PIC S9(7)V99 COMP-3.
              15 LS-MT-AAH-MIN-AH1N6              PIC S9(7)V99 COMP-3.
              15 LS-MT-AAH-MIN-AH2N1              PIC S9(7)V99 COMP-3.
              15 LS-MT-AAH-MIN-AH2N6              PIC S9(7)V99 COMP-3.
      *---    Initialisation mensuelle LS-CP-DIVERS
              15 LS-CP-DIVERS.
      *---       Cpteur d'enfts de - de 03 ans D710M-QTENF3A
      *---       { D710P.QTENF3A }
      *-         20 LS-QTENF3A                    PIC  99.
      *---       Compteur d'enfants decedes - D710P.NBENCQ01
                 20 LS-NBENCQ01-ENFDCD            PIC 99.
      *---       Compteur de perso. pour surface
                 20 LS-CP-NBPERS-SURF             PIC 99.
      *---       QT occur entité mr/mme
                 20 LS-CP-MRMME                   PIC S9 COMP-3.
      *---       QT occur mr/mme présent ressource*
                 20 LS-CP-MRMME-RESS              PIC S9 COMP-3.
      *---       QT occur mr/mme présent ressource RMI
                 20 LS-CP-MRMME-RESS-RMI          PIC S9 COMP-3.
      *---       QT occur mr/mme présent ressource PAF
                 20 LS-CP-MRMME-RESS-PAF          PIC S9 COMP-3.
      *---       Charges Déduct./Foyer Ress. Réelles
                 20 LS-MT-CHA1-FOYER              PIC S9(7)V9(2) COMP-3.
      *---       Charges Déduct./Foyer Ress. Evaluées
                 20 LS-MT-CHA2-FOYER              PIC S9(7)V9(2) COMP-3.
      *---       QT enfants à charge CGOD
                 20 LS-CP-ENF-CHAR-CGOD           PIC S9(03) COMP-3.
      *---       QT enfants AEC 4 mois-3 ans
                 20 LS-CP-ENF-AEC-4M-3ANS         PIC S9(03) COMP-3.
      *---       QT enfants AEC 3-20 ans
                 20 LS-CP-ENF-AEC-3-20ANS         PIC S9(03) COMP-3.
      *---       QT enfants AEC 10-15 ans
                 20 LS-CP-ENF-AEC-10-15ANS        PIC S9(03) COMP-3.
      *---       QT enfants AEC 15-20 ans
                 20 LS-CP-ENF-AEC-15-20ANS        PIC S9(03) COMP-3.
      *---       QT mensualités calculées
                 20 LS-CP-MENSUALITES             PIC S9(03) COMP-3.
      *---       QT d'abattements fiscaux spéciaux.   (ressources)
                 20 LS-CP-ABATT-FISC-SPECIAUX     PIC S9(03) COMP-3.
      *---       QT enfants moins de 7 ans au 31/12 AR (ressources)
                 20 LS-CP-ENF-MOINS-7ANS          PIC S9(03) COMP-3.
      *---   QT enfants moins de 7 ans AR - 1
                 20 LS-CP-ENF-MOINS-7ANS-AR-1     PIC S9(03) COMP-3.
      *---
                 20 LS-CP-ENF-MOINS-XANS          PIC S9(03) COMP-3.
      *---       QT Parts du quotient familial
                 20 LS-CP-PART-QF                 PIC S99V9 COMP-3.
      *---       QT Parts du quotient familial AAV
                 20 LS-CP-PART-QF-AAV             PIC S99V9 COMP-3.
      *---       QT Enfants handicapés
                 20 LS-CP-ENF-HAND                PIC S9(03) COMP-3.
      *---       QT Enfants à charge Pinna pour ARS
                 20 LS-CP-ENF-ARS-PINNA           PIC S9(03) COMP-3.
      *---       QT Enfants à charge au sens logement
                 20 LS-CP-ENF-CHAR-LOGT           PIC S9(03) COMP-3.
      *---       Compteurs de personnes handicapées
                 20 LS-CP-HANDICAP                PIC S9(03) COMP-3.
      *---------------------------------------------------------------*
      *** A998.CCR1308B : Zone devant disparaitre mais impossible     *
      *** (le 25/04/02)   à cause de la SIMULATION                    *
      *                          Compteurs d'occurrence AAS
                 20 LS-NB-OCC-AAS                 PIC S9(03) COMP-3.
      *---------------------------------------------------------------*
      *---       Nombre de droits ARS
                 20 LS-QDRTPR-ARS                 PIC S9(03) COMP-3.
      *---       Compteurs nombre de droits ars an 2000
                 20 LS-QOCCPR-ARSN1N3             PIC S9(03) COMP-3.
                 20 LS-QDRTPR-ARSN2N4             PIC S9(03) COMP-3.
                 20 LS-QOCCUE-ARSN5               PIC S9(03) COMP-3.
      *---       Compteurs nombre de droits ars an 2008
                 20 LS-NBDROITS-ARSN1N3-T1-NP     PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN2N4-T1-NP     PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN1N3-T2-NP     PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN2N4-T2-NP     PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN1N3-T3-NP     PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN2N4-T3-NP     PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN1N3-T1-P      PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN2N4-T1-P      PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN1N3-T2-P      PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN2N4-T2-P      PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN1N3-T3-P      PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN2N4-T3-P      PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN5-T1          PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN5-T2          PIC S9(03) COMP-3.
                 20 LS-NBDROITS-ARSN5-T3          PIC S9(03) COMP-3.
      *---       Compteur d'inassidus
                 20 LS-CP-CACTIV-INASSIDU         PIC S9(03) COMP-3.
      *---       Compteur de non pour AL APL
                 20 LS-CP-NON-POUR-AL-APL         PIC S9(03) COMP-3.
      *---       Compteur de mois de naissance paje.
                 20 LS-NBPJ2Q01-NB-NAIS-PAJE      PIC  99.
      *---       Compteur d'enfants adoptés simultanément.
                 20 LS-NBADPQ01-ADOPT-SIMULTA     PIC  99.
      *---       Compteur de jumeaux.
                 20 LS-NBJUMQ01-NB-JUMEAUX        PIC  99.
      *---       FILLER DISPONIBLE
                 20 FILLER                        PIC  X(97).
      *
      *---    Somme Quantité Heures Spécifiques cumulées CMG Structure
      *---       (CDMSC) = CDQHSSTR + Emploi Direct (CDMGC) = CDQHSEMD
      *---       pour tous les enfants sur le MT
              15 LS-QHS-TOT-MT                    PIC 999.
      *
      *---    Nombre total des jours AJPP à payer {D710P.QTJRSAJP}
              15 LS-QTJRSAJP                      PIC 999.
      *---    Indicateur présence jours AJPP      {D710P.CDJRSPP}
              15 LS-CDJRSPP                       PIC X.
                 88 LS-CDJRSPP-OUI                VALUE 'O'.
                 88 LS-CDJRSPP-NON                VALUE 'N'.
      *---    Indicateur absence présence parentale {D710P.CDABSPP}
              15 LS-CDABSPP                       PIC X.
                 88 LS-CDABSPP-OUI                VALUE 'O'.
                 88 LS-CDABSPP-NON                VALUE 'N'.
      *---    Indicateur activité non conforme      {D710P.CDACTAJP}
              15 LS-CDACTAJP                      PIC X.
                 88 LS-CDACTAJP-OUI               VALUE 'O'.
                 88 LS-CDACTAJP-NON               VALUE 'N'.
      *---    Indicateur présence DPT               {D710P.CDPRDPT}
              15 LS-CDPRDPT                       PIC X.
                 88 LS-CDPRDPT-OUI                VALUE 'O'.
                 88 LS-CDPRDPT-NON                VALUE 'N'.
      *---    Indicateur par PELEM AJPP- AJ1N1 - AJ2N1
      *-------------------------------------------------
              15 LS-AJP-CNAPRG-TAB.
                 20 LS-AJP-CNAPRG-TAB-OCC    OCCURS 2
                    INDEXED BY IX-AJP-CNAPRG-1
                               IX-AJP-CNAPRG-2.
                    25 LS-AJP-CNAPRG.
                       30 LS-AJP-CNAPRS           PIC X(3).
                       30 LS-AJP-RSNAPR           PIC X(2).
      *
      *---       L'alimentation de LS-AJP-CNAPRG-TOUTES est faite
      *---       par LT-AJP-CNAPRG-TOUTES dans la copie applicative
      *---       des services, tout comme le LS-IN-AJP-CNAPRG-MAX
      *---       Ces zones LT-AJP... sont définies dans la copie working
      *---       des modules SERVICE.
              15 LS-AJP-CNAPRG-TOUTES REDEFINES
                    LS-AJP-CNAPRG-TAB             PIC X(10).
      *---       Nombre max d'occ. des tableaux LS-AFR-
              15 LS-IN-AJP-CNAPRG-MAX             PIC S9(3)  COMP-3.
      *---    Indicateurs AJPP  par pelems
              15 LS-AJP-INDIC-TAB.
                 20 LS-AJP-INDIC-TAB-OCC    OCCURS 2
                    INDEXED BY IX-AJP-IND-1
                               IX-AJP-IND-2.
      *---    Indicateur non cumul complément frais {D710P.CDCUMCF}
                    25 LS-CDCUMCF                       PIC X.
                       88 LS-CDCUMCF-OUI                VALUE 'O'.
                       88 LS-CDCUMCF-NON                VALUE 'N'.
      *---    Indicateur absence bénéfice PCH       {D710P.CDABSPCH)
              15 LS-CDABSPCH                      PIC X.
                 88 FL-CDABSPCH-OUI               VALUE 'O'.
                 88 FL-CDABSPCH-NON               VALUE 'N'.
      *---    Indicateur de non affiliation         {D710P.CDCNAFF}
              15 LS-CDCNAFF                      PIC X.
                 88 FL-CDCNAFF-OUI               VALUE 'O'.
                 88 FL-CDCNAFF-NON               VALUE 'N'.
      *---    Indicateur 1 enfant DOM               {D710P.CD1ENDO}
              15 LS-CD1ENDO                      PIC 9.
                 88 FL-CD1ENDO-NON               VALUE 0.
                 88 FL-CD1ENDO-OUI               VALUE 1.
      *---    Indicateur présence enfant handicapé  {D710P.CDHANDI}
              15 LS-CDHANDI                       PIC X.
                 88 FL-CDHANDI-PRESENCE           VALUE 'O'.
                 88 FL-CDHANDI-ABSENCE            VALUE 'N'.
      *---    Bénéficiaires AJPP                    {D710P.NMENFAJP}
              15 LS-NMENFAJP                     PIC S9(7) COMP-3
                                                    OCCURS 27
                                                    INDEXED BY IX-AJPP.
      *---    Indicateur V                          {D710P.CDVRMS}
              15 LS-CDVRMS                       PIC X.
                 88 FL-CDVRMS-OUI                VALUE 'O'.
                 88 FL-CDVRMS-NON                VALUE 'N'.
      *---    Indicateur CO                         {D710P.CDRESULT}
              15 LS-CDRESULT                     PIC XX.
                 88 FL-CDRESULT-CO               VALUE 'CO'.
      *---    Montant Revenu minimum garanti RSA    {D710P.MTRMGRSA}
              15 LS-MTRMGRSA                     PIC S9(7)V99 COMP-3.
      *---    Montant Revenu Garanti RSM            {D710P.MTRGRSM}
              15 LS-MTRGRSM                      PIC S9(7)V99 COMP-3.
      *---    Montant PF RSM                        {D710P.MTPFRSM}
              15 LS-MTPFRSM                      PIC S9(7)V99 COMP-3.
      *
              15 LS-DOSZZZ.
      *---    Top de maj doszzz
                 20 LS-TOP-MAJ-DOS-ZZZ           PIC 9.
      *---    Top de maj doszzz -
      *---        {D710M.CDDINCRA} DT initiale cplt rev act
                 20 LS-TOP-MAJ-DOS-CDDINCRA      PIC X.
                 88 LS-TOP-MAJ-DOS-CDDINCRA-VRAI VALUE 'V'.
                 88 LS-TOP-MAJ-DOS-CDDINCRA-FAUX VALUE 'F' ' '.
      *
              15 LS-MRSMRS.
      *---    Top de maj MRSMRS
                 20 LS-TOP-MAJ-MRSMRS            PIC 9.
      *---    Mtt revenu minimum rsa
                 20 LS-MRS-MRSRVM                PIC S9(7)V99 COMP-3.
      *---    Mtt pente rsa
                 20 LS-MRS-MRSPNT                PIC S9(7)V99 COMP-3.
      *---    Mtt bonus  rsa
                 20 LS-MRS-MRSBNS                PIC S9(7)V99 COMP-3.
      *---    Mtt revenu garanti rsa
                 20 LS-MRS-MRSRVG                PIC S9(7)V99 COMP-3.
      *---    Mtt prest. familiales rsa
                 20 LS-MRS-MRSPFA                PIC S9(7)V99 COMP-3.
      *---    Mtt forfait logement rsa
                 20 LS-MRS-MRSFLG                PIC S9(7)V99 COMP-3.
      *---    Mtt ressources mensuelles rsa
                 20 LS-MRS-MRSRMN                PIC S9(7)V99 COMP-3.
      *---    Mtt sanction oblig. alim. rsa
                 20 LS-MRS-MRSSOA                PIC S9(7)V99 COMP-3.
      *---    Mtt réduction hospitalière rsa
                 20 LS-MRS-MRSRHS                PIC S9(7)V99 COMP-3.
      *---    Mtt réduction CG RSA
                 20 LS-MRS-MRSRCG                PIC S9(7)V99 COMP-3.
      *---    Mtt socle rsa
                 20 LS-MRS-MRSSCL                PIC S9(7)V99 COMP-3.
      *---    Mtt chapeau rsa
                 20 LS-MRS-MRSCHP                PIC S9(7)V99 COMP-3.
      *---    Mtt abattement / neutral. rsa
                 20 LS-MRS-MRSABN              PIC S9(7)V99 COMP-3.
      *---    Mtt cumul intégral rsa
                 20 LS-MRS-MRSCMI              PIC S9(7)V99 COMP-3.
      *
              15 LS-DOHDAR.
      *---    Mtt abattement double résidence/charge de famille  -CDDOH-
                 20 LS-DOH-MABRES                PIC S9(7)V99 COMP-3.
      *---    Montant abattement double activité/personne isolée -CDDOH-
                 20 LS-DOH-MABDAC                PIC S9(7)V99 COMP-3.
      *---    Mtt abattement PA/PI ressources réelles            -CDDOH-
                 20 LS-DOH-MARPAP                PIC S9(7)V99 COMP-3.
      *---    Mtt abattement PA/PI ressources évaluées           -CDDOH-
                 20 LS-DOH-MAEPAP                PIC S9(7)V99 COMP-3.
      *---    Mtt réel frais de garde retenus                    -CDDOH-
                 20 LS-DOH-MRFRGA                PIC S9(7)V99 COMP-3.
      *---    Mtt évalué frais de garde retenus                  -CDDOH-
                 20 LS-DOH-MEFRGA                PIC S9(7)V99 COMP-3.
      *
              15 LS-DOHAMI.
      *---    Quantité enfants retenus AMI  - CDDOH - gdd AMI
                 20 LS-DOH-QENFAM                PIC S9(3)    COMP-3.
      *---    Infos table CDDOH - gdd EEO  --*
              15 LS-DOHEEO.
      *---    CD partage obligatoire PPE    - CDDOH - gdd EEO
                 20 LS-DOH-EEO-CPOBPE            PIC X(1).
                    88 LS-DOH-EEO-CPOBPE-O       VALUE 'O'.
                    88 LS-DOH-EEO-CPOBPE-N       VALUE 'N'.
                    88 LS-DOH-EEO-CPOBPE-SPACES  VALUE SPACES.
      *---    DD partage obligatoire PPE    - CDDOH - gdd EEO
                 20 LS-DOH-EEO-EPOBPE            PIC S9(9) COMP-3.
      *---    DF partage obligatoire PPE    - CDDOH - gdd EEO
                 20 LS-DOH-EEO-FPOBPE            PIC S9(9) COMP-3.
      *---                                                        --*
      *---    Zone pour prestations familiales françaises (PFE)   --*
      *---    Mis en place en V03800-A998.CCR2100B CEE/Gesdro     --*
      *---    Table CDPFF - Ent. PFF - Gdd PFF - Part PF Française--*
              15 LS-PFFPFF.
                 20 LS-PFFPFF-OCC OCCURS 50
                                  INDEXED BY IX-PFFPFF.
      *--           *-- N° Fictif Enfant                          --*
                    25 LS-PFF-NFICPN             PIC S9(7) COMP-3.
      *--           *-- Cd Nature Prestation PF                   --*
                    25 LS-PFF-CNAPRS             PIC X(3).
      *--           *-- Montant  Part PF Françaises               --*
                    25 LS-PFF-MPARPF             PIC S9(5)V9(2) COMP-3.
      *--           *-- Nombre d'occurences maximum               --*
                 20 LS-IX-PFFPFF-MAX             PIC S9(3)  COMP-3.
      *-------------------------------------------------------------*
              15 LS-PRVPRV.
                 20 LS-PRVPRV-OCC OCCURS 2
                                  INDEXED BY IX-PRVPRV-OCC.
      *             *-- Cd  Prestation virtuelle
                    25 LS-PRV-CPREVI                PIC X(3).
      *             *-- Montant  ALF  Virtuelle
                    25 LS-PRV-MPREVI           PIC S9(5)V9(2) COMP-3.
      *             *-- Code Nature Prestation Virtuelle
                    25 LS-PRV-CNAPRV                PIC X(3).
      *             *-- Type Prestation Virtuelle
                    25 LS-PRV-CTYPRV                PIC X(3).
                 20 LS-IX-PRVPRV-OCC-MAX PIC S9(3)  COMP-3.
      *-------------------------------------------------------------*
              15 LS-PRIPRI.
                 20 LS-PRIPRI-OCC OCCURS 05 INDEXED BY IX-PRI-1.
      *             *-- Cd prestation
                    25 LS-PRI-CNAPRS         PIC X(3).
      *             *-- Rg prestation
                    25 LS-PRI-RSNAPR         PIC X(2).
      *             *-- montant prestation < seuil
                    25 LS-PRI-MPINFS         PIC S9(3)V9(2) COMP-3.
      *        *-- montant assiette ALF Virtuelle
               15 LS-MTASALFV                PIC S9(7)V9(2) COMP-3.
      *        *-- code soumission droits/devoirs
               15 LS-CSODEV                  PIC X
                                  OCCURS 2 INDEXED BY IX-CSODEV.
                  88 LS-FL-CSODEV-S                 VALUE 'S'.
                  88 LS-FL-CSODEV-N                 VALUE 'N'.
      *-----------------------------------------------------------------
      *--- Majoration CFA - CFAD2/CFAN2 - Nouveau à compter de 2014/04
               15 LS-DOHMCF-MAJCFA           PIC S9(5)V9(2) COMP-3.
      *
      *------- L'indicateur CDMAJOCF, utilisé dans la règle X45 (hiera),
      * est mis à jour dans les règles W24 et W41 appelées
      * respectivement dans les canevas CFAN1(N2) et CFAD1(D2).
      * Ces canevas sont exclusifs : METRO ou DOM.
      * => la gestion actuelle peut-être conservée, il n'y a pas lieu
      * de mettre en place une gestion par PELEM.
               15 LS-CDMAJOCF                PIC X.
      *---        Valeur significative de positionné à Oui
                  88 FL-CDMAJOCF-POSIT-OUI       VALUE 'O'.
      *-----------------------------------------------------------------
      *--- Mt ASF revalorisation exceptionnelle - à compter de 2014/04
               15 LS-DOHASX-MASREX           PIC S9(5)V9(2) COMP-3.
      *-----------------------------------------------------------------
      *---------------------------------------------------------------*
      *--- INFORMATIONS CONCERNANT REFORME AAH - 1911B
      *--- Trimestrialisation des Revenus
      *---------------------------------------------------------------*
           10 LS-REFORME-AAH.
      *--      *-- Cd nature PELEM
               15 LS-CNAPRG-AAH.
      *--         *-- Cd nature Prestation --*
                  20 LS-CNAPRS-AAH           PIC X(3).
      *--         *-- Cd sous nature Prestation --*
                  20 LS-RSNAPR-AAH           PIC X(2).
      *---        Indice pelem AAH étudiée (AH1N6 ou AH2N6)
               15 LS-IN-PELEM-AAH            PIC S9(3)  COMP-3.
      *--      *-- D710P.IDDEMAH1 Zone stockage demandeur AH1
               15 LS-IDDEMAH1                PIC S9(7)      COMP-3.
      *--      *-- D710P.IDDEMAH2 Zone stockage demandeur AH2
               15 LS-IDDEMAH2                PIC S9(7)      COMP-3.
      *--      *-- D710P.DDTRIRES Mois début du trimestre AAH
               15 LS-DDTRIRES-AAH            PIC S9(9)      COMP-3.
      *--      *-- D710P.DFTRIRES Mois fin du trimestre AAH
               15 LS-DFTRIRES-AAH            PIC S9(9)      COMP-3.
      *--      *-- Booléen Ressources Trimestrielles AAH non fournies
               15 LS-RESSTRIAAH              PIC X.
                  88 LS-FL-RESSTRIAAH-N-FOURNI-VRAI VALUE 'V'.
                  88 LS-FL-RESSTRIAAH-N-FOURNI-FAUX VALUE 'F' ' '.
      *--      *-- D710P.NBPAPIAH Cpt d'abatt. fiscaux PA/PI AAH
               15 LS-NBPAPIAH                PIC S9(9)      COMP-3.
      *--      *-- D710P.MTRNPFO  Mt des revenus nets perçus
               15 LS-MTRNPFO                 PIC S9(7)V9(2) COMP-3.
      *--      *-- D710P.MTCHAAH  Mt des charges déductibles
               15 LS-MTCHAAH                 PIC S9(7)V9(2) COMP-3.
      *--      *-- D710P.MTRNGAAH Mt revenu net global du ménage AAH
               15 LS-MTRNGAAH                PIC S9(7)V9(2) COMP-3.
      *--      *-- D710P.MTAPAPIH Mt abattement PA/PI AAH
               15 LS-MTAPAPIH                PIC S9(7)V9(2) COMP-3.
      *--      *-- D710P.CDAAHANN  Indicateur AAH annuelle
               15 LS-CDAAHANN                PIC X.
                  88 LS-FL-CDAAHANN-OUI      VALUE 'O'.
                  88 LS-FL-CDAAHANN-NON      VALUE 'N' ' '.
                  88 LS-FL-CDAAHANN-POSIT    VALUE 'O'.
                                                                        
      *--      Positionnement par PELEM AAH
               15 LS-IN-MAX-PELEM-AAH   PIC S9(3)  COMP-3.
               15 LS-TABLEAU-PELEM-AAH.
                  20 LS-PELEM-AAH      PIC X(5)
                                       OCCURS 4 INDEXED BY IX-PELEM-AAH.
               15 LS-PELEM-AAH-TOUS REDEFINES LS-TABLEAU-PELEM-AAH
                                    PIC X(20).
                                                                        
                                                                        
               15 LS-MR-MME  OCCURS 2 INDEXED BY IX-MR-MME.
      *--         *-- D710P.MTNAT001 Montant 001 à retenir
                  20 LS-MTNAT001             PIC S9(7)V9(2) COMP-3.
      *ù-         *-- D710P.MTNAT450 Montant 450 à retenir
      *ù          20 LS-MTNAT450             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT452 Montant 452 à retenir
                  20 LS-MTNAT452             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT010 Montant 010 à retenir
                  20 LS-MTNAT010             PIC S9(7)V9(2) COMP-3.
      *ù-         *-- D710P.MTNAT011 Montant 011 à retenir
      *ù          20 LS-MTNAT011             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT012 Montant 012 à retenir
                  20 LS-MTNAT012             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT022 Montant 022 à retenir
                  20 LS-MTNAT022             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT023 Montant 023 à retenir
                  20 LS-MTNAT023             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT025 Montant 025 à retenir
                  20 LS-MTNAT025             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT026 Montant 026 à retenir
                  20 LS-MTNAT026             PIC S9(7)V9(2) COMP-3.
      *ù-         *-- D710P.MTNAT029 Montant 029 à retenir
      *ù          20 LS-MTNAT029             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT030 Montant 030 à retenir
                  20 LS-MTNAT030             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT451 Montant 451 à retenir
                  20 LS-MTNAT451             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT040 Montant 040 à retenir
                  20 LS-MTNAT040             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNAT041 Montant 041 à retenir
                  20 LS-MTNAT041             PIC S9(7)V9(2) COMP-3.
      *ù-         *-- D710P.MTNAT043 Montant 043 à retenir
      *ù          20 LS-MTNAT043             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTSALASS  Mt des salaires et assimilés
                  20 LS-MTSALASS             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTHEUSUP  Mt heures complémentaires/supp.
                  20 LS-MTHEUSUP             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTPENS    Mt des pensions
                  20 LS-MTPENS               PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTMAJO    Mt majo pension/retraite non impo
                  20 LS-MTMAJO               PIC S9(7)V9(2) COMP-3.
      *ù-         *-- D710P.MTVEUVA   Mt allocation veuvage
      *ù          20 LS-MTVEUVA              PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTEXCLU   Mt . comparer pour exclusion peti
                  20 LS-MTEXCLU              PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTPENSEX  Mt petites pensions . exclure
                  20 LS-MTPENSEX             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTREVNET  Mt revenu net per u . comparer av
                  20 LS-MTREVNET             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTRENVIA  Mt rentes viagères
                  20 LS-MTRENVIA             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTREVETI  Mt des revenus ETI
                  20 LS-MTREVETI             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTAUTREV  Mt des autres revenus
                  20 LS-MTAUTREV             PIC S9(7)V9(2) COMP-3.
      *ù-         *-- D710P.MTTOTAUT  Mt autres revenus + prélvements
      *ù          20 LS-MTTOTAUT             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTEFCAT   Mt EF ESAT
                  20 LS-MTEFCAT              PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTSALABA  Mt des salaires et assimilés
      **          20 LS-MTSALABA             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTSALABC  Mt des salaires IJSS avec abatt.
      **          20 LS-MTSALABC             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNEUAAH  Mt revenus d'activité neutralisés
                  20 LS-MTNEUAAH             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNEUTRA  Mt rev. neut. restitués en consult
                  20 LS-MTNEUTRA             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTIJATMP  Mt IJSS accident trav/maladie prof
                  20 LS-MTIJATMP             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTIJATMA  Mt IJSS AT/MP avec abattement
                  20 LS-MTIJATMA             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTABATIJ  Mt abatt. 10% sur IJSS AT/MP
                  20 LS-MTABATIJ             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTABATIH  Mt abatt. 10% sur IJSS AT/MP ap30%
                  20 LS-MTABATIH             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.CNC4AB30  Mt abatt. 30% sur ETI
                  20 LS-CNC4AB30             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTABA10   Mt abatt. 10% pensions
                  20 LS-MTABA10              PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTNEUAHA  Mt revenus act neutralisé
                  20 LS-MTNEUAHA             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.CDPAPIAH  Indic. de droit è abbatt.
      *--         *--                 fiscal PA/PI AAH        .
                  20 LS-CDPAPIAH             PIC X.
                     88 LS-FL-CDPAPIAH-OUI   VALUE 'O'.
                     88 LS-FL-CDPAPIAH-NON   VALUE 'N' ' '.
      *--         *-- D710P.CDNCANN   Indicateur NC annuelle
                  20 LS-CDNCANN              PIC X.
                     88 LS-FL-CDNCANN-OUI    VALUE 'O'.
                     88 LS-FL-CDNCANN-NON    VALUE 'N' ' '.
      *--         *-- D710P.CDNAANN   Indicateur NA annuelle
                  20 LS-CDNAANN              PIC X.
                     88 LS-FL-CDNAANN-OUI    VALUE 'O'.
                     88 LS-FL-CDNAANN-NON    VALUE 'N' ' '.
      *--         *-- D710P.CDNCTRI   Indicateur NC trimestrielle
                  20 LS-CDNCTRI              PIC X.
                     88 LS-FL-CDNCTRI-OUI    VALUE 'O'.
                     88 LS-FL-CDNCTRI-NON    VALUE 'N' ' '.
      *--         *-- D710P.CDNATRI   Indicateur NA trimestrielle
                  20 LS-CDNATRI              PIC X.
                     88 LS-FL-CDNATRI-OUI    VALUE 'O'.
                     88 LS-FL-CDNATRI-NON    VALUE 'N' ' '.
      *--         *-- D710P.CDABATR   Indicateur abatt proport. trimes.
                  20 LS-CDABATR              PIC X.
                     88 LS-FL-CDABATR-OUI    VALUE 'O'.
                     88 LS-FL-CDABATR-NON    VALUE 'N' ' '.
      *--         *-- D710P.CDABAAN   Indicateur abatt proport. annuel
                  20 LS-CDABAAN              PIC X.
                     88 LS-FL-CDABAAN-OUI    VALUE 'O'.
                     88 LS-FL-CDABAAN-NON    VALUE 'N' ' '.
                     88 LS-FL-CDABAAN-POSIT  VALUE 'O'.
      *--         *-- D710P.TXABAAH   Tx abattement proportionnel
                  20 LS-TXABAAH              PIC S9(3)V9(4) COMP-3.
                                                                        
                  20 LS-PELEM-AAH-1
                     OCCURS 4 INDEXED BY IX-PELEM-AAH-1.
      *--            *-- D710P.MTSALH
      *--            *-- Mt des salaires et assimil.avec pec cumul aah
                     25 LS-MTSALH            PIC S9(7)V9(2) COMP-3.
      *--            *-- D710P.MTSALHB
      *--            *-- Mt de 70% salaires + chômage avec cumul AAH
                     25 LS-MTSALHB           PIC S9(7)V9(2) COMP-3.
      *--            *-- D710P.MTSALHC
      *--            *-- Mt de 70% salaires + 70% chômage avec cumul AAH
                     25 LS-MTSALHC           PIC S9(7)V9(2) COMP-3.
      *--            *-- D710P.MTETIH
      *--            *-- Mt des revenus ETI avec pec cumul
                     25 LS-MTETIH            PIC S9(7)V9(2) COMP-3.
      *--            *-- D710P.MTETIHB
      *--            *-- Mt 70% revenus ETI avec cumul AAH
                     25 LS-MTETIHB           PIC S9(7)V9(2) COMP-3.
      *--            *-- D710P.MTRAAHTR
      *--            *-- Montant des ressources AAH
                     25 LS-MTRAAHTR          PIC S9(7)V9(2) COMP-3.
      *--            *-- D710P.MTCHO - ajout suite CC.A998.BUGSC5343
      *--            *-- Montant Ind.chômage avec abattement 10 %
                     25 LS-MTCHO             PIC S9(7)V9(2) COMP-3.
      *--            *-- D710P.MTCHOC- ajout suite CC.A998.BUGSC5343
      *--            *-- Montant Ind.chômage avec abattement 30% et 10%
                     25 LS-MTCHOC            PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant salaires + assimilés
                     25 LS-SAL               PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant IJ Chômage
                     25 LS-CHOM              PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant IJ ATMP
                     25 LS-ATMP              PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant revenus ETI
                     25 LS-ETI               PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant salaires + ass. avec abatt 30%
                     25 LS-SAL-30            PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant salaires + ass. avec abatt 30% /001
                     25 LS-SAL-30CP          PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant IJ chômage avec abatt 30%
                     25 LS-CHOM-30           PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant IJ ATMP avec abatt 30%
                     25 LS-ATMP-30           PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant revenus ETI avec abatt 30%
                     25 LS-ETI-30            PIC S9(7)V9(2) COMP-3.
      *--            *-- Montant ressources AAH annuelle/occ/pelem
                     25 LS-MTRAAHAN          PIC S9(7)V9(2) COMP-3.
                                                                        
               15 LS-PELEM-AAH-2 OCCURS 4 INDEXED BY IX-PELEM-AAH-2.
      *--         *-- D710P.MTCUMAH  Montant cumul total
                  20 LS-MTCUMAH              PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTCUMSAL Montant cumul total SAL
                  20 LS-MTCUMSAL             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTCUMETI Montant cumul total ETI
                  20 LS-MTCUMETI             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.CDCUMAH  Indicateur cumul total
                  20 LS-CDCUMAH              PIC X.
                     88 LS-FL-CDCUMAH-OUI    VALUE 'O'.
                     88 LS-FL-CDCUMAH-NON    VALUE 'N' ' '.
      *--         *-- D710P.CD8040AH Indicateur abattement 80/40
                  20 LS-CD8040AH             PIC X.
                     88 LS-FL-CD8040AH-OUI   VALUE 'O'.
                     88 LS-FL-CD8040AH-NON   VALUE 'N' ' '.
      *--         *-- D710P.MTAH8040 Montant des revenus 80/40
                  20 LS-MTAH8040             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTBASAAH Base ressources AAH trim
                  20 LS-MTBASAAH             PIC S9(7)V9(2) COMP-3.
      *--         *-- D710P.MTPAPIF Abatt. PA/PI appliqué à la PELEM
                  20 LS-MTPAPIF              PIC S9(7)V9(2) COMP-3.
      *
      *---------------------------------------------------------------*
      *--- INDICATEURS DIVERS ALPHA NUMéRIQUES, RAZ MENSUELLE.
      *---------------------------------------------------------------*
           10 LS-FL-DIV-RAZ-MENS-ALPHA.
      *** A998.CCR1308B : Zone devant disparaitre mais impossible     *
      *** (le 25/04/02)   à cause de la SIMULATION                    *
      *---    Indicateur d'occurrence présente/AAS
              15 LS-INDIC-OCC-AAS                PIC  X.
      *
      *---    Indicateur de grossesse en cours
              15 LS-FL-GROSS-ENCOURS             PIC  X.
      *---    Indicateur de grossesse en cours
              15 LS-DPCPJI01-GROSS-EC            PIC X.
      *
      *** Remise en l'état initial
      *---    Indicateur de grossesse
      *---    D710P.CDGROSS indicateur de presence de grossesse
      ****Remise en l'état initial 1854PVDR
              15 LS-CDGROSS                      PIC  X.
                 88 LS-FL-CDGROSS-OUI            VALUE 'O'.
      ****Remise en l'état initial C2412PLT
              15 LS-CDGROSS-RSI                  PIC  X.
                 88 LS-FL-CDGROSS-RSI-OUI        VALUE 'O'.
                 88 LS-FL-CDGROSS-RSI-NON        VALUE 'N'.
      *---    D710P.CDINTGRO indicateur d'interruption de grossesse
              15 LS-CDINTGRO                     PIC  X.
                 88 LS-FL-CDINTGRO-OUI            VALUE 'O'.
                 88 LS-FL-CDINTGRO-NON            VALUE 'N'.
      *
      *---    D710P.CDIGRPPA Indicateur mois grossesse interrompue PPA
              15 LS-CDIGRPPA                     PIC  X.
                 88 LS-FL-CDIGRPPA-OUI            VALUE 'O'.
      *
      *---    D710P.CDFGRO18 Indicateur fin grossesse - 18 ans PPA
              15 LS-CDFGRO18                     PIC  X.
                 88 LS-FL-CDFGRO18-OUI            VALUE 'O'.
      *---    Indicateur forfait
              15 LS-FL-FORFAIT                   PIC  X.
      *---    Indicateur d'isolement
              15 LS-FL-ISOLE-AVP                 PIC  X.
      *
      *       Indicateur de présence des ressources
              15 LS-FL-PRE-RESS                  PIC  X.
      *---    Indicateurs de présence des ressources 888 ou 999
              15 LS-FL-PRE-RESS-888              PIC  X.
              15 LS-FL-PRE-RESS-999              PIC  X.
      *--     *-- Booléen Ressources  non fournies ( CGRKRNC1-F03)
              15 LS-RESS                        PIC X.
                 88 LS-FL-RESS-N-FOURNI-VRAI    VALUE 'V'.
                 88 LS-FL-RESS-N-FOURNI-FAUX    VALUE 'F'.
      *
      *---    Indicateur de présence des ressources RSO
              15 LS-FL-PRE-RESS-RSO              PIC  X.
      *---    Indicateurs de présence des ressources 888 ou 999 -RSO-
              15 LS-FL-PRE-RESS-888-RSO          PIC  X.
              15 LS-FL-PRE-RESS-999-RSO          PIC  X.
              15 LS-PRE-RESS-RMI                 PIC  X.
                 88 LS-FL-PRES-RESS-RMI          VALUE 'O'.
                 88 LS-FL-ABS-RESS-RMI           VALUE 'N'.
      *---    Indicateur ressources absentes (pour RSA).
      *       15 LS-IND-RESS-ABS-RSA                 PIC  X.
      *          88 FL-IND-RESS-ABS-RSA-OUI          VALUE 'O'.
      *          88 FL-IND-RESS-ABS-RSA-NON          VALUE 'N'.
      *---    Indicateur ressources absentes (pour PAF).
              15 LS-IND-RESS-ABS-PAF                 PIC  X.
                 88 FL-IND-RESS-ABS-PAF-OUI          VALUE 'O'.
                 88 FL-IND-RESS-ABS-PAF-NON          VALUE 'N'.
      *---    Indicateur de prés des ress évaluées
              15 LS-IND-PRESEN-RESEVAL   PIC X.
                 88 LS-FL-IND-PRESEN-RESEVAL-NON-P VALUE ' '  'N'.
                 88 LS-FL-IND-PRESEN-RESEVAL-POS   VALUE 'O'.
                 88 LS-FL-IND-PRESEN-RESEVAL-POS-N VALUE 'N'.
              15 LS-FL-PRE-RESS-EVAL     REDEFINES
                    LS-IND-PRESEN-RESEVAL   PIC X.
      *
      *---    Indicateur BNEVA
              15 LS-BNEVAI01                     PIC  X(2).
                 88 FL-BNEVAI01-R1  VALUE 'R1'.
                 88 FL-BNEVAI01-OD  VALUE 'OD'.
                 88 FL-BNEVAI01-RN  VALUE 'RN'.
                 88 FL-BNEVAI01-OS  VALUE 'OS'.
              15 LS-BNEVA REDEFINES LS-BNEVAI01  PIC  XX.
                 88 FL-BNEVA-R1  VALUE 'R1'.
                 88 FL-BNEVA-OD  VALUE 'OD'.
                 88 FL-BNEVA-RN  VALUE 'RN'.
                 88 FL-BNEVA-OS  VALUE 'OS'.
              15 LS-BNEVAI09                     PIC  X(2).
      *---    Indicateur EFJEUNE
              15 LS-EFJEUNE      PIC 9.
                 88 FL-EFJEUNE-KO  VALUE 0.
                 88 FL-EFJEUNE-OK  VALUE 1.
      *---    Indicateur CDEFAB
      *       15 LS-CDEFAB       PIC 9.
      *          88 FL-CDEFAB     VALUE 0.
      *          88 FL-CDEFAB-OK  VALUE 1.
      *          88 FL-CDEFAB-KO  VALUE 2.
      *---    Indicateur d'abatt. fiscal special
              15 LS-FL-ABATT-FIS-SPE             PIC  X.
      *---    Indicateur de non pour AL APL
              15 LS-FL-NON-POUR-AL-APL           PIC  9.
      *---    Indicateur màj avis préfet
              15 LS-TOP-MAJ-AVIS-PCOGEN          PIC  X.
      *---    Indic. d'accès au bareme AF = D710P.CDBARAF
              15 LS-CDBARAF                      PIC X.
                 88 LS-CDBARAF-OUI               VALUE 'O'.
                 88 LS-CDBARAF-NON               VALUE 'N' ' '.
      *---    Taux de prise en charge AGED màj de PEH par LKMO ou BANA
              15 LS-FL-TYPMAJ-PEH                PIC X.
      *
              15 LS-IND-RESSOURCES-ABSENTES      PIC X.
              15 LS-APE-INDIC-1ER-MOIS-INTER     PIC X.
              15 LS-TOP-CALCUL-ARS-DIFF          PIC X.
              15 LS-TOP-CALCUL-ARS-ENTIER        PIC X.
      *---    Indicateur conjoint ADI (CGRACTAD/CGRDRADI)
              15 LS-IND-CONJOINT-ADI             PIC X.
      *---    Indicateur d'exclusion de conjoint
      *       15 LS-IND-CONJ-EXC                 PIC X.
      *---    Indicateur DSF
              15 LS-FL-SIT-ENF-IDSF              PIC X.
                 88 LS-FL-ENF-IDSF-OUI       VALUE 'O'.
      *---    Indicateurs CMG
              15 LS-CMG.
                 20 LS-CMG-INFOS-PERS
                    OCCURS 27 INDEXED BY IX-CMG.
      *--           Indicateur 0-3A {D710P.CDAGE3A1} pour l'enfant
                    25 LS-CDAGE3A1               PIC X.
                 20 LS-FL-ASSIETTE-PJ4           PIC  X.
      *---       Indicateur 0-3A {D710P.CDAGE3A2} pour le dossier
                 20 LS-CDAGE3A2                  PIC X.
      *---    Indicateur enfant paje
              15 LS-FL-IND-ENFANT-PAJE           PIC X.
                 88 FL-ENFANT-PAJE           VALUE 'O'.
                                                                        
      *---    D710p.NPECPI Indic. de non prise en compte PJ2 dans API
              15 LS-NPECPI-PJ2-API               PIC X.
                 88 LS-FL-NPECPI-PJ2-API-VRAI    VALUE 'V'.
                 88 LS-FL-NPECPI-PJ2-API-FAUX    VALUE 'F' ' '.
                 88 LS-FL-NPECPI-PJ2-API-F       VALUE 'F'.
      *
      *---    D710p.NPECMI Indic. de non prise en compte PJ2 dans RMI
      *---                                                     OU RSD
              15 LS-NPECMI-PJ2-RMI               PIC X.
                 88 LS-FL-NPECMI-PJ2-RMI-VRAI    VALUE 'O'.
                 88 LS-FL-NPECMI-PJ2-RMI-FAUX    VALUE 'F' ' '.
                 88 LS-FL-NPECMI-PJ2-RMI-F       VALUE 'F'.
                                                                        
      *---    D710P.NPECDI INDIC. DE NON PRISE EN COMPTE PJ2 DANS ADI
      *---                                                     OU RSI
              15 LS-NPECDI-PJ2-ADI               PIC X.
                 88 LS-FL-NPECDI-PJ2-ADI-VRAI    VALUE 'O'.
                 88 LS-FL-NPECDI-PJ2-ADI-FAUX    VALUE 'F' ' '.
                 88 LS-FL-NPECDI-PJ2-ADI-F       VALUE 'F'.
      *---    D710p.CDNECPI Indic. de non prise en compte PJ2 dans PPA
              15 LS-CDNPECPI-PJ2-PPA               PIC X.
                 88 LS-FL-CDNPECPI-PJ2-PPA-VRAI    VALUE 'V'.
                 88 LS-FL-CDNPECPI-PJ2-PPA-FAUX    VALUE 'F' ' '.
                 88 LS-FL-CDNPECPI-PJ2-PPA-F       VALUE 'F'.
      *
      *---    D710P.CDSUPJ2 Indic. suppression PJ2 mois naissance
              15 LS-CDSUPJ2                        PIC X.
                 88 LS-FL-CDSUPJ2-POSIT-O          VALUE 'O'.
                 88 LS-FL-CDSUPJ2-POSIT-N          VALUE 'N'.
      *
      *--     *-- Evenement MAJI                     --*
              15 LS-EVEMAJI                      PIC X(3).
                 88 LS-EVEMAJI-ENF               VALUE 'ENF'.
                 88 LS-EVEMAJI-GRO               VALUE 'GRO'.
                 88 LS-EVEMAJI-PEC               VALUE 'PEC'.
                 88 LS-EVEMAJI-ISO               VALUE 'ISO'.
      *--     *-- Date évènement MAJI                --*
              15 LS-DTEVEMAJ                     PIC 9(8).
      *--     *-- Identifiant de l'enfant donnant droit à la MAJI --*
      *--     *-- c'est le N° fictif personne = nficpn            --*
              15 LS-ENFMAJI                      PIC 9(7).
      *--     *-- Indicateur MAJI                     --*
              15 LS-CDMAJI                       PIC X(1).
                 88 LS-FL-CDMAJI-VRAI            VALUE 'V'.
                 88 LS-FL-CDMAJI-FAUX            VALUE 'F' ' '.
                 88 LS-FL-CDMAJI-F               VALUE 'F'.
      *
      *
      *---    D710P.CDNATALL  code nationalité allocataire
      *---    F=Français/CV=CEE valide/CNV= CEE non valide/A=Autre
              15 LS-CDNATALL                     PIC X(1).
                 88 FL-CDNATALL-F                VALUE 'F'.
                 88 FL-CDNATALL-CV               VALUE 'V'.
                 88 FL-CDNATALL-CNV              VALUE 'C'.
                 88 FL-CDNATALL-A                VALUE 'A'.
      *
      *---    Indicateur RMA radié
              15 LS-CDRMARAD                     PIC X.
                 88 LS-CDRMARAD-VIERGE           VALUE ' '.
                 88 LS-CDRMARAD-COUVERT          VALUE 'C'.
                 88 LS-CDRMARAD-RADIE            VALUE 'R'.
                                                                        
                                                                        
      *--     Top prise en compte nbre de jours AJPP enfants
              15 LS-AJP.
                 20 LS-AJP-PRES-JOUR
                    OCCURS 27 INDEXED BY IX-AJP.
                    25 LS-AJP-JOUR-CUM           PIC X.
                       88 FL-AJP-JO-CUM-OUI      VALUE 'O'.
                       88 FL-AJP-JO-CUM-NON      VALUE 'N'.
                                                                        
      *--     Indicateur AJPP: nombre de jours < 310 (D710P.CD310JRS)
              15 LS-CD310JRS                     PIC X.
                 88 FL-NB-JOURS-310-AJPP-NON     VALUE 'N'.
                 88 FL-NB-JOURS-310-AJPP-OUI     VALUE 'O'.
      *---    indicateur montant réduit PJ
              15 LS-IND-REDUIT-PJ3               PIC X.
                 88 FL-IND-REDUIT-PJ3-OUI        VALUE 'O' '4' '5'.
                 88 FL-IND-REDUIT-PJ3-PJ4-PJ5    VALUE 'O'.
                 88 FL-IND-REDUIT-PJ3-PJ4        VALUE '4'.
                 88 FL-IND-REDUIT-PJ3-PJ5        VALUE '5'.
                 88 FL-IND-REDUIT-PJ3-NON        VALUE 'N' ' '.
      *
      *---    indicateur sanction API
              15 LS-CDSANAPI                     PIC X.
                 88 LS-CDSANAPI-OUI              VALUE 'O'.
                 88 LS-CDSANAPI-NON              VALUE 'N'.
                 88 LS-CDSANAPI-VIDE             VALUE ' '.
      *---    Indicateur absence involontaire conjoint
              15 LS-FL-ABS-INV-CONJOINT          PIC X.
      *        Indicateur abs. invo. alloc. RSA
      *        3 occurrences RSA : 1 = RSI  2 = RSD  3 = RSJ
              15 LS-FL-ABSINV-ALC-RSA            PIC X
                                                 OCCURS 3
                                                 INDEXED BY IX-AB-AL.
                88 LS-FL-ABSINV-ALC-RSA-O        VALUE 'O'.
                88 LS-FL-ABSINV-ALC-RSA-N        VALUE 'N'.
      *        Indicateur abs. invo. conjt. RSA
      *        3 occurrences RSA : 1 = RSI  2 = RSD  3 = RSJ
              15 LS-FL-ABSINV-CONJ-RSA           PIC X
                                                 OCCURS 3
                                                 INDEXED BY IX-AB-CJ.
                88 LS-FL-ABSINV-CJT-RSA-O        VALUE 'O'.
                88 LS-FL-ABSINV-CJT-RSA-N        VALUE 'N'.
      *---    D710P.CDAVIRSA Indicateur condition AVI-RSA (DMF 2196F)
              15 LS-CDAVIRSA                     PIC X.
      *-         Valeur significative de positionné à N
                 88 LS-FL-CDAVIRSA-POSIT-N       VALUE 'N'.
                                                                        
      *---    {D710P.CDVERARS} Indicateur déduction verpreaut ARS
              15 LS-CDVERARS                     PIC 9.
                 88 LS-FL-CDVERARS-NON           VALUE 0.
                 88 LS-FL-CDVERARS-OUI           VALUE 1.
      *---    {D710P.CDVERARJ} Indicateur déduction verpreaut ARJ
              15 LS-CDVERARJ                     PIC 9.
                 88 LS-FL-CDVERARJ-NON           VALUE 0.
                 88 LS-FL-CDVERARJ-OUI           VALUE 1.
      *
      *---    FILLER DISPONIBLE
              15 FILLER                          PIC X(44).
      *                                                               *
      *---------------------------------------------------------------*
      *--- NUMéRIQUES ETENDUS - RAZ zone à zone, à la demande
      *---------------------------------------------------------------*
           10 LS-MANUELLE-NUM-ETENDU.
      *---    code type entité logique
              15 LS-NTYPEN        PIC  9.
                 88 LS-NTYPEN-ALLOC         VALUE 1.
                 88 LS-NTYPEN-CONJOINT      VALUE 2.
                 88 LS-NTYPEN-ENFANT        VALUE 3.
                 88 LS-NTYPEN-AUTPERS       VALUE 4.
                 88 LS-NTYPEN-RESSOURCE     VALUE 5.
                 88 LS-NTYPEN-LOGEMENT      VALUE 6.
      *---    code saut prest. generique suivante
              15 LS-PEGEN-SAUT    PIC  9.
      *
              15  LS-DT-FIN-MOIS-PREC        PIC 9(8).
              15  LS-R-DT-FMP  REDEFINES LS-DT-FIN-MOIS-PREC.
                  20 LS-MOIS-DATE-FMP        PIC 9(6).
                  20 LS-R-M-FMP REDEFINES LS-MOIS-DATE-FMP.
                     25 LS-AN-DT-FMP          PIC 9999.
                     25 LS-MM-DT-FMP          PIC 99.
                  20 LS-JOUR-DATE-FMP         PIC  9(2).
      *
              15  LS-DT-FIN-MOIS-TRAITE      PIC 9(8).
              15  LS-R-DT-FMT  REDEFINES LS-DT-FIN-MOIS-TRAITE.
                  20 LS-MOIS-DATE-FMT        PIC 9(6).
                  20 LS-R-M-FMT REDEFINES LS-MOIS-DATE-FMT.
                     25 LS-AN-DT-FMT          PIC 9999.
                     25 LS-MM-DT-FMT          PIC 99.
                  20 LS-JOUR-DATE-FMT         PIC  9(2).
                                                                        
      *---    1er du mois en cours du dossier plus un mois
              15  LS-DEB-MOIS-EN-COURS-PLUS-UN   PIC 9(8).
                                                                        
      *---    1er du mois en cours du dossier plus deux mois
      *---    Attention date renseignée uniquement si le mois en
      *---    cours est compris dans la période d'étude des droits
      *---    OU si RENOUVELLEMENT APL
              15  LS-DEB-MOIS-EN-COURS-PLUS-DEUX PIC 9(8).
                                                                        
      *---    Dernier du mois en cours du dossier plus deux mois
      *---    Attention date renseignée uniquement si le mois en
      *---    cours est compris dans la période d'étude des droits
      *---    OU si RENOUVELLEMENT APL
              15  LS-FIN-MOIS-EN-COURS-PLUS-DEUX PIC 9(8).
      *---    Délai edition entre 2 notifications dp
              15 LS-DELAI-NOTIF            PIC  9(02).
      *---    accès CDGR1 - rang examen prénatal
              15 LS-REXPRN        PIC 9.
      *---    accès CDPRS - rang du pret
              15 LS-RPRETX        PIC 99.
      *---    accès à CDLGS et CDLGH - rang du logement
              15 LS-RLOGEM                       PIC 999.
              15  LS-DT-DEMENAGEMENT             PIC 9(8).
              15  LS-R-DT-DEM  REDEFINES LS-DT-DEMENAGEMENT.
                  20 LS-DTMOIS-DEM               PIC 9(6).
                  20 LS-R-M-DEM REDEFINES LS-DTMOIS-DEM.
                     25 LS-DTAN-DEM              PIC 9999.
                     25 LS-DTMM-DEM              PIC 99.
                  20 LS-DTJJ-DEM                 PIC  9(2).
      *---    Indicateur opération vérifiée ou non.
              15 LS-FL-VERIF-OPER                PIC 9.
                                                                        
      *---    Année de référence des ressources
              15 LS-ANNREF-RESS            PIC  9(04).
      *---    Année de référence des ressources RSO
              15 LS-ANNREF-RESS-RSO        PIC  9(04).
      *
      *---    Indicateur propositions préfet
      *---    Indicateur MAJ code information
              15 LS-FL-MAJ-CD-INFO               PIC  9.
      *
      *---    Date de déménagement
              15  LS-DDEMEN                  PIC 9(8).
              15  LS-DDEMEN-R  REDEFINES LS-DDEMEN.
                  20 LS-DDEMEN-AM            PIC 9(6).
                  20 LS-DDEMEN-AM-R   REDEFINES LS-DDEMEN-AM.
                     25 LS-DDEMEN-A           PIC 9999.
                     25 LS-DDEMEN-M           PIC 99.
                  20 LS-DDEMEN-J              PIC 99.
                                                                        
              15 LS-TAB-PMVT-2.
      *--        20 LIGNE-PMVT-2 OCCURS 25 INDEXED BY IX-PMVT-2.
                 20 LS-LIGNE-PMVT-2 OCCURS 25 INDEXED BY IX-PMVT-2.
      *---          Mois de la PMVT avec neccessitée de ré-exécution
                    25 LS-PMVT-2-MOIS             PIC S9(9) COMP-3.
      *---          Flag notant si ré-exécution necessaire
                    25 LS-PMVT-2-A-FAIRE          PIC X.
                       88 LS-FL-PMVT-2-A-FAIRE        VALUE 'O'.
                       88 LS-FL-PMVT-2-PAS-A-FAIRE    VALUE 'N'.
                                                                        
              15  LS-RG-PMVT                       PIC X.
                  88 LS-FL-RG-PMVT-1                     VALUE '1'.
                  88 LS-FL-RG-PMVT-2                     VALUE '2'.
      *---    FILLER DISPONIBLE
              15 FILLER           PIC 9(15).
                                                                        
      *
      *---------------------------------------------------------------*
      *--- INDICATEURS DIVERS RAZ MENSUELLE.
      *---------------------------------------------------------------*
           10 LS-FL-DIV-RAZ-MENS-NUM.
              15 LS-FL-CDANLOG                   PIC  9.
      *---    Indicateur activité SIN (Mon/Mme ADI)
              15 LS-IND-SIN                      PIC  9.
      *---    Indicateur de réduction dispense RSA
              15 LS-CDDISPE                      PIC  9.
                 88 FL-CDDISPE-OK                VALUE 1.
                 88 FL-CDDISPE-KO                VALUE 0.
      *---    FILLER DISPONIBLE
              15 FILLER                          PIC  9(3).
                                                                        
                                                                        
      *---    base évaluée foyer
              15 LS-MT-BASE-EVA-FOY              PIC  S9(7)V99 COMP-3.
      *---    base évaluée foyer bis
              15 LS-MT-BASE-EVA-FOYB             PIC  S9(7)V99 COMP-3.
                                                                        
      * Tableau contenant les ressources evaluées (code periodicité N)
      * 2 lignes pour Mr et Mme
      * 5 colonnes pour 5 occurences: poste 3 pour l'eva. en cours.
                                                                        
      *--     15  TAB-PEREVA.
              15  LS-TAB-PEREVA.
                20 LS-LIGNE-MRMME OCCURS 2 INDEXED BY IX-PER4.
      *--         25 LIGNE-PEREVA OCCURS 5 INDEXED BY IX-PEREVA.
                  25 LS-LIGNE-PEREVA OCCURS 5 INDEXED BY IX-PEREVA.
      *---           DD evaluation forfaitaire
                     30 LS-PEREVA-CDHIS001     PIC S9(9) COMP-3.
      *---           DF evaluation forfaitaire
                     30 LS-PEREVA-CDHIS002     PIC S9(9) COMP-3.
                     30 LS-PEREVA-CDPE0EVA.
      *---              CD nature ressources
                        35 LS-PEREVA-CMOREF       PIC X(1).
                        35 LS-PEREVA-CNARES1      PIC X(3).
                           88 LS-FL-PEREVA-CNARES1-SAL-OD VALUE '080'.
                           88 LS-FL-PEREVA-CNARES1-SAL-RN VALUE '082'.
                           88 LS-FL-PEREVA-CNARES1-SAL-R1 VALUE '083'.
                           88 LS-FL-PEREVA-CNARES1-ETI-OD VALUE '085'.
                           88 LS-FL-PEREVA-CNARES1-ETI-RN VALUE '087'.
                           88 LS-FL-PEREVA-CNARES1-ETI-R1 VALUE '088'.
                           88 FL-PEREVA-SALARIE-OD VALUE '080' '090'.
                           88 FL-PEREVA-SALARIE-R1 VALUE '083' '092'.
                           88 FL-PEREVA-SALARIE-RN VALUE '082' '091'.
                           88 FL-PEREVA-SALARIE   VALUE '080' '082'
                                                            '083' '090'
                                                           '091' '092'.
                           88 FL-PEREVA-ETI       VALUE '085' '087'
                                                            '088'.
                           88 FL-PEREVA-OD        VALUE '080' '085'
                                                            '090'.
                           88 FL-PEREVA-R1        VALUE '083' '088'
                                                            '092'.
                           88 FL-PEREVA-RN        VALUE '082' '087'
                                                            '091'.
      *
      *---              MT annuel évaluat. forfaitaire
                        35 LS-PEREVA-MAEVFO       PIC S9(7)V99 COMP-3.
      *---              MT mensuel salaire éva. for.
                        35 LS-PEREVA-MMSEVF       PIC S9(7)V99 COMP-3.
      *---              TX abatt. suppl. frais profes.
                        35 LS-PEREVA-CDEVA003     PIC S9(3)V9(2) COMP-3.
      *---              DT mois reference salaire
                        35 LS-PEREVA-DMOIEF       PIC S9(9) COMP-3.
      *
      *---    Plafond mensuel des ressources RSO
              15 LS-PLAF-MENS-RESS-RSO  PIC S9(5)V99 COMP-3.
      *---    Montant unitaire ARS
              15 LS-MVALAR-MTT-UNITAIRE-ARS       PIC S9(5)V99 COMP-3.
      *---    Montant unitaire ARS par tranche
              15 LS-MONTANT-UNIT-ARS-T1           PIC S9(5)V99 COMP-3.
              15 LS-MONTANT-UNIT-ARS-T2           PIC S9(5)V99 COMP-3.
              15 LS-MONTANT-UNIT-ARS-T3           PIC S9(5)V99 COMP-3.
      *---    Montant unitaire ARSN5 Mayotte
              15 LS-MONTANT-UNIT-ARS-976          PIC S9(5)V99 COMP-3.
      *---    Date de baissance de l'enfant le plus jeune à charge
      *---    cf. CGRDNDGT
              15 LS-DT-NAIS-ENF-PLUS-JEUNE        PIC S9(09) COMP-3.
      *---    DD grossesse DGT (cf. CGRINFGR)
              15 LS-DD-GRO-DGT                    PIC S9(09) COMP-3.
      *---    DF grossesse DGT (cf. CGRINFGR)
              15 LS-DF-GRO-DGT                    PIC S9(09) COMP-3.
      *---    LS-DTGROSS  = Dt de déclaration de grossesse
              15 LS-DTGROSS                       PIC S9(09) COMP-3.
      *---    LS-DTDPC = Date initiale de conception --*
              15 LS-DTDPC                         PIC S9(09) COMP-3.
      *---    Nombre d'enfant conçu (cf. CGRINFGR)
              15 LS-QT-ENF-DGT                    PIC  9.
      *---    Nombre d'enfant arrivés sur le mois
              15 LS-QTARRENF                      PIC  9.
      *---    D710P.CDFGRO25 : Indic. fin grossesse - 25 ans. Pelem RSI
              15 LS-CDFGRO25-RSIX1                PIC  X.
      *---       Valeurs significatives de non positionné, non OK :
                 88 LS-FL-CDFGRO25-RSIX1-NON-POSIT  VALUE SPACE 'N'.
      *---       Valeurs significatives de positionné (ajout possible
      *---       d'autres codes à VALUE)
                 88 LS-FL-CDFGRO25-RSIX1-POSIT      VALUE 'P'.
      *---       Valeurs pour "positionner" LS-CDFGRO25-RSIX1 :
                 88 LS-FL-CDFGRO25-RSI-NON-POSIT-N     VALUE 'N'.
                 88 LS-FL-CDFGRO25-RSIX1-POSIT-P       VALUE 'P'.
      *
      *---    Compteurs spécifiques PJ4N3 / PJ5N1 / PJ5N3
      *---                          PJ4N4 / PJ5N2
              15 LS-COMPTEURS-AGE-GARDE.
                 20 LS-TB-COMPTEURS-AGE-GARDE     OCCURS 5
                         INDEXED BY  IX-CPT-AGE-GARDE.
      *---          *--  Compteurs spécifiques PJ4N3 / PJ5N1 /PJ5N3 --*
                    25 LS-QT3AM      PIC 99.
                    25 LS-QT6AM      PIC 99.
      *---          *--  Compteurs spécifiques PJ4N4 / PJ5N2 --*
                    25 LS-QT3EM      PIC 99.
                    25 LS-QT6EM      PIC 99.
      *---    Plafond de ressources PJ1/PJ2
              15 LS-MPLPJ1     PIC S9(7)V99   COMP-3.
      *---    CDMPLPJ2 MT plafond inter ress PJ2
              15 LS-MPLPJ2     PIC S9(7)V99   COMP-3.
      *---    Plafond de ressources PJ4/PJ5
              15 LS-MPJ4PL     PIC S9(7)V99   COMP-3.
      *---    Compteur d'enfants à charge mois de DD compose dossier :
              15  LS-QT1ERM-CHRG-DOSS             PIC S9(3) COMP-3.
      *
      *---    DOHMGC : groupe CMG CONSULTATION/CUMUL
              15 LS-DOHMGC.
                 20 LS-DOHMGC-MPLACU              PIC S9(5)V9(2) COMP-3.
                 20 LS-DOHMGC-QE03CU              PIC S9(3) COMP-3.
                 20 LS-DOHMGC-ME03CU              PIC S9(5)V9(2) COMP-3.
                 20 LS-DOHMGC-QE36CU              PIC S9(3) COMP-3.
                 20 LS-DOHMGC-ME36CU              PIC S9(5)V9(2) COMP-3.
      *
      *---    CD plafond cmg - Table Cddoh - gdd MGP ---*
      ****    15 LS-CPLCMG     PIC X(2).
      *---    DOHMGP : groupe CMG PLAFOND
              15 LS-DOHMGP.
                 20 LS-DOHMGP-CPLCMG              PIC X(1).
                 20 LS-DOHMGP-MPLACO              PIC S9(5)V9(2) COMP-3.
      *---    stockage frais de garde (1485J)
              15 LS-STOCK-FGRR PIC S9(7)V99.
              15 LS-STOCK-FGRE PIC S9(7)V99.
      *---    Compteur de RMAstes
              15 LS-QTRMASTE   PIC S9(3) COMP-3.
      *---    Compteur de bénéficiaires CAV
              15 LS-QTBENCAV   PIC S9(3) COMP-3.
      *---    Nombre de jours Retour Foyer Mensuel (1594A)
      *---    donnée technique d610m.ctg603 devient d610m.ctg811!!!!
      *---    mais le nom dans la LS reste le même pour ne pas avoir
      *---    à faire de modif dans les règles qui l'utilisent....
              15 LS-QJRSAC     PIC S9(3) COMP-3.
      *---    date de début d'absence involontaire conjoint (D710P)
              15  LS-DTCJTAB                      PIC S9(9) COMP-3.
      *---    Compteur de JNF/DSF pour le RSA
              15 LS-QTJNFDSF                      PIC S9(3) COMP-3.
      *---    Compteur initial d'enfants JNF/DSF MAYOTTE
              15 LS-QTENFMAY                      PIC S9(3) COMP-3.
      *---    Indicateur aucun enfant pour AF
              15 LS-CDABSEAF                      PIC X.
                 88 LS-FL-CDABSEAF-POSIT            VALUE 'P'.
                 88 LS-FL-CDABSEAF-NON-POSIT        VALUE SPACE 'N'.
      *---    Compteur enfants AF pour le RSA
              15 LS-QTENFAFR                      PIC S9(3) COMP-3.
      *---    FILLER DISPONIBLE
              15 FILLER                           PIC X(04).
                                                                        
      *-----------------------------------------------------------------
      *--- ZONES DIVERSES - RAZ à LA DEMANDE
      *-----------------------------------------------------------------
           10 LS-MANUELLE-AUTRES.
                                                                        
              15 LS-MANUELLE-AUTRES-DIVERS.
      *---       Mois traité
                 20 LS-DMSTTE        PIC S9(07) COMP-3.
      *---       1er jour du mois traité
                 20 LS-DMSTTE-01     PIC S9(09) COMP-3.
      *---       date du jour
                 20 LS-DATE-JOUR     PIC  S9(09) COMP-3.
      *
      *---       Nombre d'occurences satisfaisant toutes les conditions
                 20 LS-NB-OCC        PIC S9(05) COMP-3.
      *
      *---       Compteur d'occ. PAJE
                 20 LS-DRPJ2Q01-NB-OCC-PAJE  PIC S9(05) COMP-3.
      *---       DPC date présumée de conception
                 20 LS-DTDPCI01              PIC S9(9) COMP-3.
                 20 LS-DPC REDEFINES LS-DTDPCI01     PIC S9(9) COMP-3.
      *---       accès CDDRV - montants droits
                 20 LS-NDESTI                    PIC S9(07) COMP-3.
                 20 LS-NFICPN                    PIC S9(07) COMP-3.
                 20 LS-EDROIT                    PIC S9(09) COMP-3.
      *---       accès CDGR1 - examens prénatals
                 20 LS-EPCOIN        PIC S9(9) COMP-3.
      *---       accès à CDJU0  - Jugements
                 20 LS-NMTIERS       PIC S9(07) COMP-3.
                 20 LS-NJUGEM        PIC S9(13) COMP-3.
      *---    acces a CDDR1 OUV  - date fin validité infos mémorisées:
                 20 LS-DATFIN-PER-VALID PIC S9(9) COMP-3.
      *---       Numéro d'employeur AGED
                 20 LS-NUM-EMPLOYEUR    PIC  S9(07) COMP-3.
      *
                 20 LS-INDIC-3ANS                     PIC  X.
                 20 LS-DT-MARIAGE       PIC S9(9) COMP-3.
                 20 FILLER                  PIC X(5).
      *
                 20 LS-DTNAIS               PIC S9(9) COMP-3.
                 20 LS-CTLMAT-MT            PIC X(3).
                    88 LS-FL-CTLMAT-MT-CEL  VALUE 'CEL'.
                    88 LS-FL-CTLMAT-MT-MAR  VALUE 'MAR'.
                    88 LS-FL-CTLMAT-MT-VIM  VALUE 'VIM'.
                    88 LS-FL-CTLMAT-MT-DIV  VALUE 'DIV'.
                    88 LS-FL-CTLMAT-MT-VEU  VALUE 'VEU'.
                    88 LS-FL-CTLMAT-MT-SEF  VALUE 'SEF'.
                    88 LS-FL-CTLMAT-MT-SEL  VALUE 'SEL'.
                    88 LS-FL-CTLMAT-MT-ABA  VALUE 'ABA'.
                    88 LS-FL-CTLMAT-MT-ISO  VALUE 'ISO'.
                    88 LS-FL-CTLMAT-MT-RVM  VALUE 'RVM'.
                    88 LS-FL-CTLMAT-MT-RVC  VALUE 'RVC'.
                                                                        
                    88 LS-FL-CTLMAT-MT-ISOLE VALUE 'CEL' 'DIV' 'SEF'
                                                   'SEL' 'ISO' 'VEU'
                                                   'ABA'.
                 20 LS-SITMAC01  REDEFINES LS-CTLMAT-MT PIC X(3).
                    88 LS-FL-SITMAC01-CEL   VALUE 'CEL'.
                    88 LS-FL-SITMAC01-MAR   VALUE 'MAR'.
                    88 LS-FL-SITMAC01-VIM   VALUE 'VIM'.
                    88 LS-FL-SITMAC01-DIV   VALUE 'DIV'.
                    88 LS-FL-SITMAC01-VEU   VALUE 'VEU'.
                    88 LS-FL-SITMAC01-SEF   VALUE 'SEF'.
                    88 LS-FL-SITMAC01-SEL   VALUE 'SEL'.
                    88 LS-FL-SITMAC01-ABA   VALUE 'ABA'.
                    88 LS-FL-SITMAC01-ISO   VALUE 'ISO'.
                    88 LS-FL-SITMAC01-RVM   VALUE 'RVM'.
                    88 LS-FL-SITMAC01-RVC   VALUE 'RVC'.
                    88 LS-FL-SITMAC01-ISOLE VALUE 'CEL' 'DIV' 'SEF'
                                                  'SEL' 'ISO' 'VEU'
                                                  'ABA'.
                    88 LS-FL-SITMAC01-COUP  VALUE 'MAR' 'VIM' 'RVM'
                                                  'RVC' 'PAC' 'RPA'.
      ** DMF0780E regle cgrsitma cgre04p date debut sit.matrimoniale
      ** de LS-SITMAC01.
                 20 LS-CTLMAT-DD            PIC S9(09) COMP-3.
                                                                        
                 20 LS-CTLMAT-AR            PIC X(3).
                    88 LS-FL-CTLMAT-AR-CEL  VALUE 'CEL'.
                    88 LS-FL-CTLMAT-AR-MAR  VALUE 'MAR'.
                    88 LS-FL-CTLMAT-AR-VIM  VALUE 'VIM'.
                    88 LS-FL-CTLMAT-AR-DIV  VALUE 'DIV'.
                    88 LS-FL-CTLMAT-AR-VEU  VALUE 'VEU'.
                    88 LS-FL-CTLMAT-AR-SEF  VALUE 'SEF'.
                    88 LS-FL-CTLMAT-AR-SEL  VALUE 'SEL'.
                    88 LS-FL-CTLMAT-AR-ABA  VALUE 'ABA'.
                    88 LS-FL-CTLMAT-AR-ISO  VALUE 'ISO'.
                    88 LS-FL-CTLMAT-AR-RVM  VALUE 'RVM'.
                    88 LS-FL-CTLMAT-AR-RVC  VALUE 'RVC'.
                                                                        
                    88 LS-FL-CTLMAT-AR-ISOLE VALUE 'CEL' 'DIV' 'SEF'
                                                   'SEL' 'ISO' 'VEU'
                                                   'ABA'.
                 20 LS-CTLMAT-AR-1          PIC X(3).
                    88 LS-FL-CTLMAT-AR-1-CEL  VALUE 'CEL'.
                    88 LS-FL-CTLMAT-AR-1-MAR  VALUE 'MAR'.
                    88 LS-FL-CTLMAT-AR-1-VIM  VALUE 'VIM'.
                    88 LS-FL-CTLMAT-AR-1-DIV  VALUE 'DIV'.
                    88 LS-FL-CTLMAT-AR-1-VEU  VALUE 'VEU'.
                    88 LS-FL-CTLMAT-AR-1-SEF  VALUE 'SEF'.
                    88 LS-FL-CTLMAT-AR-1-SEL  VALUE 'SEL'.
                    88 LS-FL-CTLMAT-AR-1-ABA  VALUE 'ABA'.
                    88 LS-FL-CTLMAT-AR-1-ISO  VALUE 'ISO'.
                    88 LS-FL-CTLMAT-AR-1-RVM  VALUE 'RVM'.
                    88 LS-FL-CTLMAT-AR-1-RVC  VALUE 'RVC'.
                                                                        
                    88 LS-FL-CTLMAT-AR-1-ISOLE VALUE 'CEL' 'DIV' 'SEF'
                                                   'SEL' 'ISO' 'VEU'
                                                   'ABA'.
                 20 LS-AR-SIT-MAT           PIC 9(4).
                 20 LS-AR-SIT-MAT-1         PIC 9(4).
                                                                        
      *---       tableau màj CGM110A contient toutes les personnes
      *---       du dossier (MR ou MME exclusivement)
                                                                        
      *          20 LS-TAB-NFICPN-CTYPER OCCURS 10
                 20 LS-TAB-NFICPN-CTYPER OCCURS 12
                                           INDEXED BY IX-NFICPN.
                   25 LS-NFICPN-110    PIC S9(07) COMP-3.
                   25 LS-CTYPER-110    PIC X(3).
                   25 LS-CDHIS001-110  PIC S9(09) COMP-3.
                   25 LS-CDHIS002-110  PIC S9(09) COMP-3.
                   25 LS-DDECPN-110    PIC S9(09) COMP-3.
      *
      * zones diverses autres que 03/97 (Majorat° APL / DMF780M)
                20  LS-MT-NAPL-AVT-SEUIL   PIC S9(5)V99 COMP-3.
                20  LS-IND-ISO-APL         PIC X.
      *
      *---       Table des occurences satisfaisant toutes les conditions
      *---       (pelem,entité logique)
                 20 LS-TAB-OCCURS.
                   25 LS-TAB-OCC-PELEM         OCCURS 275
                      INDEXED BY IX-T8-1 IX-T8-2 IX-T8-3.
                      30 LS-TAB-OCC-ENTL       OCCURS 6
                                          INDEXED BY IX-ENTL.
                         40 LS-TAB-NB-OCC      PIC S9(05) COMP-3.
      *
      *---       Compteur de pelem traitées dans T23
                 20 LS-NB-PELEM               PIC S9(03) COMP-3.
                                                                        
      *
      *---      Période de référence
                20 LS-PERIODE-REFER.
                   25 LS-PERDB-REFER            PIC  S9(09) COMP-3.
                   25 LS-PERFN-REFER            PIC  S9(09) COMP-3.
      *---      Trimestre civil de référence
                20 LS-TRIM-CIVIL-REFER.
                   25 LS-TRCIVDB-REFER          PIC  S9(09) COMP-3.
                   25 LS-TRCIVFN-REFER          PIC  S9(09) COMP-3.
      *---      Trimestre référence ressources API
                20 LS-TRIM-REFER-RESS.
      *---         D710P.DDTRIPI    - date debut trim. de ref. ress API
                   25 LS-DDTRIPI-DD-TRIM-REF-API  PIC  S9(09) COMP-3.
      *---         D710P.DFTRIPI    - date fin   trim. de ref. ress API
                   25 LS-DFTRIPI-DF-TRIM-REF-API  PIC  S9(09) COMP-3.
      *
      *---      Trimestre référence RSA
                20 LS-TRIM-REFER-RSA.
                   25 LS-DDTRIRES               PIC  S9(09) COMP-3.
                   25 LS-DFTRIRES               PIC  S9(09) COMP-3.
      *
      *---      Indice pelem étudiée
                20 LS-IN-PELEM        PIC S9(3) COMP-3.
      *---      Indice pegen étudiée
                20 LS-IN-PEGEN        PIC S9(3) COMP-3.
      *---      Indice poste ressources disponible
                20 LS-IN-POST-RESS       PIC S9(3) COMP-3.
      *---      Indice max personnes
                20 IN-MAX-PER         PIC S9(3) COMP-3.
      *--       A TERME LS-IX-PER-MAX REMPLACERA  IN-MAX-PER
                20 LS-IX-PER-MAX      PIC S9(3) COMP-3.
      *---      Indice max pelem
                20 IN-MAX-PELEM       PIC S9(3) COMP-3.
      *---      Indice max pegen
                20 LS-IN-PEGEN-MAX    PIC S9(3) COMP-3.
      *---      Indice mois courant
                20 IN-MOIS            PIC S9(3) COMP-3.
      *---      Indice max mois
                20 LS-IN-MOIS-MAX     PIC S9(3) COMP-3.
      *---      Indice max attributaire
                20 IN-MAX-ATT         PIC S9(3) COMP-3.
      *---      Indice max ressources
                20 IN-MAX-RESS        PIC S9(3) COMP-3.
      *---      Indice max abattement
                20 LS-IN-MAX-RAB         PIC S9(3) COMP-3.
      *---      Nb max d'employeurs RMA/CAV stockés
                20 LS-IN-MAX-EMPL        PIC S9(3) COMP-3.
      *---      Nb max d'ASF stockés
                20 LS-IN-MAX-ASF         PIC S9(3) COMP-3.
      *---      Nb max de pers RSA jeune banalisée (RSJZZZ)
                20 LS-IN-MAX-NB-RSJS     PIC S9(3) COMP-3.
                20 IN-MAX-T9-MME1        PIC S9(3) COMP-3.
                20 LS-IX-JUMEAUX-MAX     PIC S9(3) COMP-3.
      *--    CGLKMP
                20 LS-IX-CHARG-MAX       PIC S9(3) COMP-3.
      *-- INDEX DS CGLKMO AVEC MAX DANS LA CGLKPIMO
      *-- MAX DS CGS101,CGS401,CGS601,CGSSI1,CGMS62
      *--       INITIALISATION LS-P2
                20 LS-IX-MMEP-MAX        PIC S9(3) COMP-3.
                20 LS-IX-MMER-MAX        PIC S9(3) COMP-3.
                20 LS-IX-MME-MAX         PIC S9(3) COMP-3.
                20 LS-IX-OCP-MAX         PIC S9(3) COMP-3.
                20 LS-IX-AUTP-MAX        PIC S9(3) COMP-3.
                20 LS-IX-ENFP-MAX        PIC S9(3) COMP-3.
                20 LS-IX-ENF-MAX         PIC S9(3) COMP-3.
                20 LS-IX-GDD-MAX         PIC S9(3) COMP-3.
                20 LS-IX-AL0-MAX         PIC S9(3) COMP-3.
                20 LS-IX-DOS-MAX         PIC S9(3) COMP-3.
                20 LS-IX-OCL-MAX         PIC S9(3) COMP-3.
      *---      INDEX DE LA CGLKPIMO
                20 LS-IX-PER2-MAX        PIC S9(3) COMP-3.
                20 LS-IX-PER4-MAX        PIC S9(3) COMP-3.
                20 LS-IX-T5-ENF-MAX      PIC S9(3) COMP-3.
                20 LS-IX-ENF2-MAX REDEFINES LS-IX-T5-ENF-MAX
                                         PIC S9(3) COMP-3.
                20 LS-IX-RRSOTU-MAX      PIC S9(3) COMP-3.
                20 LS-IX-EMP-MAX         PIC S9(3) COMP-3.
                20 LS-IX-MR-MME-MAX      PIC S9(3) COMP-3.
                20 LS-IX-FOR-MAX         PIC S9(3) COMP-3.
                20 LS-IX-T21-MRMME-MAX   PIC S9(3) COMP-3.
                20 LS-IX-T6-PELEM-1-MAX  PIC S9(3) COMP-3.
                20 LS-IX-ASM1-MAX        PIC S9(3) COMP-3.
      *---      Concerne la paje maxi 6
                20 LS-IX-APE-MAX         PIC S9(3) COMP-3.
                20 LS-IX-PJ4-MAX         PIC S9(3) COMP-3.
                20 LS-IX-CPT-AGE-GARDE-MAX    PIC S9(3) COMP-3.
      *---      concerne APE a pelem a supprimer en 2012 maxi 3
                20 LS-IX-APE-MAX-3       PIC S9(3) COMP-3.
      *---      Indice max abattement
                20 LS-IX-T22-MAX         PIC S9(3) COMP-3.
      *---      Indice max LSHPES
                20 LS-IX-LSHPES-MAX      PIC S9(3) COMP-3.
      *---
                20 LS-IX-PRI-1-MAX       PIC S9(3) COMP-3.
      *---
                20 LS-IX-T6-ARS-1-MAX    PIC S9(3) COMP-3.
      *---      poste maxi pour pj3
                20 LS-IX-TX-PJ3-POSTE-MAX         PIC S9(3) COMP-3.
                20 LS-IX-PJ3-BEN-MAX              PIC S9(1) COMP-3.
                20 LS-IX-PJ3-PEL-MAX              PIC S9(3) COMP-3.
      *---      poste maxi pour pj6
      *-        13 postes PJ6N1 à N7 et PJ6NA + prévoir évolution --*
                20 LS-IX-TX-PJ6-POSTE-MAX         PIC S9(3) COMP-3.
                20 LS-IX-PJ6-BEN-MAX              PIC S9(1) COMP-3.
                20 LS-IX-PJ6-MAX         PIC S9(3) COMP-3.
                20 LS-IX-PJ6-PEL-MAX              PIC S9(3) COMP-3.
      *---       valeur max renseigné dans CGS101A-CGSSI1A
      *---       du D710P.NMENFT01
                 20 LS-IX-NMENFT01-MAX            PIC S9(3) COMP-3.
      *---      poste maxi IX-ATT1,IX-T4-ATT-1,IX-T4-ATT-2,IX-T4-ATT-3
                20 LS-IX-ATT1-MAX                 PIC S9(3) COMP-3.
                20 LS-IX-T4-ATT-MAX               PIC S9(3) COMP-3.
      *--
                20 LS-IX-BENEF-APE-MAX            PIC S9(3) COMP-3.
                20 LS-IX-T23-1-MAX                PIC S9(3)  COMP-3.
                20 LS-IX-PEHNAA-SIT-MAX           PIC S9(3)  COMP-3.
      *------------------------------------------------------
      *---         Nombre max d'occ. du tableau LS-RESS-REV-FRTUT
      *--       20 IN-T9-REVTUT-MAX      PIC S9(3)  COMP-3.
                20 LS-IN-T9-REVTUT-MAX   PIC S9(3)  COMP-3.
      *  compteur d'enfants pour derogation age DGT                   *
                20 LS-Q1520A-21-DGT   PIC S9(03) COMP-3.
                20 LS-QTCHRMI         PIC 9.
      *---------   D710P.CDVRSP  - up44p.cgrkrntp
                20 LS-CFORMO-CDVRSP     PIC X.
                   88 LS-FL-CFORMO-CDVRSP-V       VALUE 'V'.
      *---------   D710P.MTRESSP - up44p.cgrkrntp
                20 LS-MTRESSP-RSP       PIC S9(7)V99 COMP-3.
      *---      D710M.CDMTHRSA MONTANT THEORIQUE RSA - U244P.CGRMADTH
                20 LS-TOP-MAJ-CDRSD     PIC X.
                   88 LS-FL-TOP-MAJ-CDRSD-VRAI  VALUE 'V'.
                   88 LS-FL-TOP-MAJ-CDRSD-FAUX  VALUE ' ' 'F'.
      *---      {D710M.CDDFT1PE} DF théorique PPE conjoint 1 (MME)
      *---      {D710M.CDDFT2PE} DF théorique PPE conjoint 1 (MME)
      *---      U244P.CGRDFPJ6 - CGRXH0P et CGM130A
                20 LS-TOP-MAJ-CDEEE     PIC X.
                   88 LS-FL-TOP-MAJ-CDEEE-VRAI  VALUE 'V'.
                   88 LS-FL-TOP-MAJ-CDEEE-FAUX  VALUE ' ' 'F'.
      *
      *---         Stockage de l'index correspondant à l'alloc/conjt
      *---         dans la table LS-D710P-ALL-OU-CJT
                20 LS-IN-PER-AC-ALLOC   PIC S9(1) COMP-3.
                20 LS-IN-PER-AC-CONJT   PIC S9(1) COMP-3.
      *
                20 LS-ARS-NREFER-CDC    PIC S9(7) COMP-3.
      **        est ce que PAFF3/FC présent dans la CDACM  ?  **
      **        sur mois traité                               **
                20 LS-PRESENT-PAFFX-CDACM PIC X OCCURS 2
                   INDEXED BY IX-PRESENT-PAFFX.
                   88 FL-PRESENT-PAFFX-CDACM VALUE 'O'.
                   88 FL-ABSENT-PAFFX-CDACM  VALUE 'N'.
      **        est ce que PAFF3/FC présent dans la CDACM  ?  **
      **        sur période mouvementée                       **
                20 LS-EXISTE-PAFFX-CDACM PIC X OCCURS 2
                   INDEXED BY IX-EXISTE-PAFFX.
                   88 FL-EXISTE-PAFFX-CDACM   VALUE 'O'.
                   88 FL-NEXISTE-PAFFX-CDACM  VALUE 'N'.
      *
      *-        20 FILLER               PIC X(19).
      *          - LENGTH(LS-ARS-NREFER-CDC) (4)  ==> 15
      *--       20 FILLER               PIC X(15).
      *          - Longueur LS-PRESENT-PAFFX-CDACM 15 passe à 13 --*
      *          - Longueur LS-EXISTE-PAFFX-CDACM 13 passe à 11  --*
                20 FILLER               PIC X(11).
      *
                                                                        
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
      *    *** Table par occurrence personnes (pers)
      *            - BL présence occur ressources(personne)           *
      *            - MT salaires et assimilés                         *
      *            - MT pensions, retraites et rentes viagères grat.  *
      *            - MT rentes viagères à titre onéreux               *
      *            - MT revenus d'activité non salariée               *
      *            - MT autres revenus                                *
      *            - MT déficit                                       *
      *            - MT RNC7=déficit foncier                          *
      *            - MT RNC8=RNC5 + prélèvements libératoires         *
      *            - MT EFR=excédents frais réels                     *
      *            - MT évaluation forfaitaire annuelle CAT           *
      *            - MT somme des salaires et assimilés               *
      *            - MT somme des pensions, retraites et rentes       *
      *            - MT somme des salaires perçues                    *
      *            - MT montant des ressources                        *
      *            - INDICATEUR PRESENCE DE RESSOURCE pr l'occ
      *            - Montant de l'abattement spécial fiscal
      *            - MT mensuel ress. RMI sans abattement             *
      *            - MT mensuel ress. RMI avec abattement             *
      *            - MT trimest ress. RMI sans abattement             *
      *            - MT mensuel ress. RMI                             *
      *            - MT trimest ress. RMI                             *
      *            - MT total des avantages en nature                 *
      *            - Indicateur nationalité enfant sens CGOD          *
      *            - Indicateur situation enfant sens CGOD            *
      *            - Indicateur enfant inassidu
      *            - Indicateur résidence enfant sens CGOD            *
      *            - Code à charge au sens CGOD                       *
      *            - Nombre de jours de sortie à payer                *
      *            - Nombre de jours de reliquat                      *
      *            - Top de mise a jour du gdd RD0                    *
      *            - Date fin stock                                   *
      *            - MT des ressources netralisées                    *
      *            - Top de mise à jour du GDD PEH CAP
      *            - MT des ressources neutralisées API (MANAPI)      *
      *            - MT de l'abattement ressources  API (MANAPI-ABATT)*
      *            - MT de l'interressement API         (MINTPI)      *
      *            - MT abattement frais                              *
      *            - MT réduction hospitalisation                     *
      *            - MT abattement préfét  (RMI)                      *
      *            - MT abattement à venir (RMI)                      *
      *            - MT interessement                                 *
      *            - Indicateur d'interessement                       *
      *            - CD titre AVPF                                    *
      *            - Code assurance maladie                           *
      *            - Code enfant API moins de 3 ans                   *
      *            - Top de mise a jour du gdd EAP                    *
      *            - Indicateur de droit RMI                          *
      *            - Indicateur prise en cpte ressources RMI          *
      *            - Top de mise a jour du gdd PEHCRE                 *
      *            - Top de mise a jour du gdd PEHCRM                 *
      *            - Top de mise a jour du gdd PEHMRP                 *
      *            - FL indicateur d'abattement/neutralisation
      *            - Taux d'activite APE
      *            - Taux prise en charge AGED
           15 LS-P2.
      ****    20 LS-P2-FIL       OCCURS 27  INDEXED BY IX-PER2.
              20 LS-P2-FIL       OCCURS 27
                    INDEXED BY IX-PER2 IX-PER2B.
      *---       1ere etape   (2è etape = pic X value 'O' et space.)
      *---       (3è etape = LS-FL-PRES-OCCUR-RESS dégage)
      *
      *---          Occurrence presente O/N pour les ressources.
                 25 LS-PER2-PRES-PR-RESS  PIC 9.
                    88 LS-FL-PER2-PRES-PR-RESS-OUI VALUE 1.
                    88 LS-FL-PER2-PRES-PR-RESS-NON VALUE 0.
                 25 LS-FL-PRES-OCCUR-RESS REDEFINES
                    LS-PER2-PRES-PR-RESS PIC 9.
      *---------------------------------------------------------------*
      *** A998.CCR1308B : Zone devant disparaitre mais impossible     *
      *** (le 25/04/02)   à cause de la SIMULATION                    *
                 25 LS-FL-PRES-RESS-AAS   PIC 9.
      *---------------------------------------------------------------*
                 25 LS-MT-RNC1            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC1A           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC1B           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC2            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC2A           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC2B           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC2C           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC3            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC3A           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC3B           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC4            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC4A           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC4B           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC5            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC6            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC7            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC8            PIC S9(7)V99 COMP-3.
                 25 LS-MT-EFR             PIC S9(7)V99 COMP-3.
                 25 LS-MT-CAT1            PIC S9(7)V99 COMP-3.
                 25 LS-MT-EVA1            PIC S9(7)V99 COMP-3.
                 25 LS-MT-EVA2            PIC S9(7)V99 COMP-3.
                 25 LS-MT-REV1            PIC S9(7)V99 COMP-3.
                 25 LS-MT-REV2            PIC S9(7)V99 COMP-3.
                 25 LS-MT-REV2A           PIC S9(7)V99 COMP-3.
                 25 LS-MT-REV2B           PIC S9(7)V99 COMP-3.
                 25 LS-MT-REV3            PIC S9(7)V99 COMP-3.
                 25 LS-MT-REV4            PIC S9(7)V99 COMP-3.
                 25 LS-MT-REV5            PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNC1            PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNC1A           PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNC1B           PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNC1BIS         PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNC4            PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNC4A           PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNC4B           PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNCH            PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNCHBIS         PIC S9(7)V99 COMP-3.
                 25 LS-MT-CNCH            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RNC4H           PIC S9(7)V99 COMP-3.
                 25 LS-MT-CTIH            PIC S9(7)V99 COMP-3.
                 25 LS-MT-RESSOURCES      PIC S9(7)V99      COMP-3.
      *---       PRESENCE O/N de ressources pour l'occ (utile à ENF/AUT)
                 25 LS-FL-PRE-RESS-ENF-AUT  PIC X.
                 25 LS-BLOC-RESS-LOG-ENF-AUT        PIC X.
                    88 LS-FL-BLOC-RESS-LOG-POSITIONNE   VALUE 'O'.
                 25 LS-MT-ABATT-SPE-FIS   PIC S9(11)V9(2) COMP-3.
                 25 LS-MT-RMI-MSNET-SSAB  PIC S9(7)V9(2) COMP-3.
                 25 LS-MT-RMI-MSNET-AVAB  PIC S9(7)V9(2) COMP-3.
                 25 LS-MT-RMI-TRBRUT-SSAB PIC S9(7)V9(2) COMP-3.
                 25 LS-MT-RMI-MSNET       PIC S9(7)V9(2) COMP-3.
                 25 LS-MTRESMEN           PIC S9(7)V9(2) COMP-3.
      *---     D710P.MTRESPRP Montant mensuel pour PRP.
                 25 LS-MTRESPRP           PIC S9(7)V9(2) COMP-3.
      *---     D710P.MTMOYRA  Montant moyen des revenus d'activité
                 25 LS-MTMOYRA            PIC S9(7)V9(2) COMP-3.
      *
      *--------- Trois occurrences pour les zones suivantes
      *---       concernant le RSA :
      *---       1 ==> RSI
      *---       2 ==> RSD
      *---       3 ==> RSJ
                 25 LS-WS-MONT-RSA
                                          OCCURS 3
                                          INDEXED BY IX-MT-RS.
      *---          MT de l'abattement CG {D710P.MTABACG}
                    30 LS-MTABACG         PIC S9(7)V99 COMP-3.
      *---          MT de la neutral.  CG {D710P.MTREVNEU}
                    30 LS-MTREVNEU        PIC S9(7)V99 COMP-3.
      *---          D710P.MTREXPEC Montant ressource 006 pris en compte.
                    30 LS-MTREXPEC        PIC S9(7)V9(2) COMP-3.
       procedure division.
