IDENTIFICATION DIVISION.
    PROGRAM-ID. MemoryLayout.
ENVIRONMENT DIVISION.
*=================================================================
CONFIGURATION SECTION.
*SOURCE-COMPUTER. IBM-370 WITH DEBUGGING MODE.
      
*vvvvv attention vvvvvv ne jamais commenter :
SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
      
      
Data Division.
Working-Storage Section.
      
01 STR1.
   05 DATA101   PIC X(5).
   05 DATA102   PIC N(5).
   
01 STR2.
   05 DATA201   PIC 9(5).
   05 DATA202   PIC 9(5)V99.
   05 DATA203   PIC 9(5)V9(6).
   05 DATA204   PIC S9(5)V9(6).
   05 DATA205   PIC S9(5)V9(6) SIGN LEADING SEPARATE.
   05 DATA205   PIC S9(5)V9(6) SIGN TRAILING SEPARATE.
01 STR3.
   05 DATA301   PIC 9(5) COMP-3.
   05 DATA302   PIC 9(5)V99 COMP-3.
   05 DATA303   PIC 9(5)V9(6) COMP-3.
   05 DATA304   PIC S9(5)V9(6) COMP-3.
   05 DATA305   PIC 9(6) COMP-3.
   05 DATA306   PIC 9(6)V99 COMP-3.
   05 DATA307   PIC 9(6)V9(6) COMP-3.
   05 DATA308   PIC S9(6)V9(6) COMP-3.

01 STR4.
   05 DATA401   PIC ZZZ.ZZ9,99.
   05 DATA402   PIC ZZZ.ZZ9,99+.
   
01 STR5.
   05 DATA501   COMP-1.
   05 DATA502   COMP-2.
01 STR6.
   05 DATA601   POINTER.
   05 DATA602   PROCEDURE-POINTER.
   05 DATA603   FUNCTION-POINTER.

01 STR7.
   05 DATA701   PIC 9(4) COMP.
   05 DATA701   PIC 9(4) COMP-5.

01 STR8.
   05 DATA801   PIC X(1).
   05 DATA802   PIC 9(5) COMP SYNC.
   05 DATA803   PIC X(1).
   05 DATA804   PIC 9(5) COMP SYNC.
      
Procedure Division.
    goback
    .
      
END PROGRAM MemoryLayout.
      