       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPGM.
      *REMARKS. COPY=(                                                 *
      *).                                                              *
       END PROGRAM MyPGM.