       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       AUTHOR. Me.
      *REMARKS.  COPY=YMSG113
             .
       procedure division.
           goback
           .
       End Program DVZF0OSM.