       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPGM.
      *REMARKS. COPY=(
      *LM)            YMYCOPY 
      *                       ).
       END PROGRAM MyPGM.