       IDENTIFICATION division.
       PROGRAM-ID. MyPGM7.
       procedure division.
      * KO
                display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -           er zer "
                 .
       END PROGRAM MyPGM7.