       IDENTIFICATION division.
       PROGRAM-ID. MyPGM8.
       procedure division.
      * KO
                display 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -           er zer "
           .
       END PROGRAM MyPGM8.