       IDENTIFICATION division.
       PROGRAM-ID. MyPGM4.
       procedure division.
      * KO
            display 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -          " er zer "
           .
       END PROGRAM MyPGM4.