       IDENTIFICATION division.
       PROGRAM-ID. MyPGM3.
       procedure division.
      * OK
          display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -          " er zer "
           .
       END PROGRAM MyPGM3.