       IDENTIFICATION division.
       PROGRAM-ID. MyPGM2.
       procedure division.
      * KO
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -          ' er zer '
           .
       END PROGRAM MyPGM2.