       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       data division.
       working-storage section.
       01 syntax-ok PIC X(200) VALUE "This text is way too long to fit o
      -                        "n a single line !".
       01 var1 pic x(100) value "hi".
       PROCEDURE DIVISION.
             move 'CHAMPS 082 A 085 INTERDITS EN OUVERTURE'
Line 10[19,21] <30, Error, Semantics> - Semantic error: Symbol foo is not referenced
      -        to foo
      

      *    OK
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa1234xxxxxxx
      -            " er zer "
           display 'endxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx1234xxxxxxx
      -            ' gggg '
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -            " vvvv
      -            " er zer "
           display 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -            ' vvvv
      -            ' er zer '
           move "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -         " er zer " to var1
           move "Crazy NIST ""Syntax" to var1
           move "                                           Crazy NIST "
      -         ""Syntax" to var1      

      
      *    KO
Line 32[20,82] <27, Error, Syntax> - Syntax error : Literal is not correctly delimited.
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 33[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            ' er zer '
Line 34[20,81] <27, Error, Syntax> - Syntax error : Literal is not correctly delimited.
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 35[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            " er zer '
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 37[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            ' er zer "
      
Line 39[20,82] <27, Error, Syntax> - Syntax error : Literal is not correctly delimited.
           display 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 40[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            " er zer "
Line 41[20,81] <27, Error, Syntax> - Syntax error : Literal is not correctly delimited.
           display 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 42[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            ' er zer "
           display 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 44[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            " er zer '
      
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 47[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            ' er zer
      -            " er zer "
           display 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 50[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            " er zer 
      -            ' er zer
Line 52[19,20] <21, Error, Tokens> - The delimiter character of this continuation line is different from the initial delimiter of the alphanumeric literal
      -            " er zer '
      
      
      *    KO
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 57[21,22] <27, Error, Syntax> - Syntax error : Starting delimiter of the continuation line is missing.
      -              er zer "
Line 58[20,79] <27, Error, Syntax> - Syntax error : Literal is not correctly delimited.
           display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
Line 59[20,21] <27, Error, Syntax> - Syntax error : Closing delimiter of the continuation line is missing.
      -             " er zer

           goback
           .
       END PROGRAM DVZF0OSM.
