       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZMFT0.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STR1.
          05 data1                                              PIC    X
      -    X.
       01 STR2.
          05 data2                                                 PIC X
      -    X.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM DVZZMFT0.