       IDENTIFICATION division.
       PROGRAM-ID. MyPGM6.
       procedure division.
      * KO
                display "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -           er zer '
           .
       END PROGRAM MyPGM6.