       IDENTIFICATION division.
       PROGRAM-ID. MyPGM5.
       procedure division.
      *         KO
                display 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
      -           er zer '
           .
       END PROGRAM MyPGM5.