000010 IDENTIFICATION DIVISION.
000030 PROGRAM-ID. MYPGM.
000500 DATA DIVISION.
000880 WORKING-STORAGE SECTION.
001120 01  W-CPT-LUS                   PIC 9(06)    VALUE ZEROES.
000640 01  ENTREE-ENR                    PIC X(80).
001260*---------------------*
001270 PROCEDURE DIVISION.
002830     DISPLAY '>>> DOUBLON BIN: ' ENTREE-ENR(3:19)
002840-            ' ENREG NUM: ' W-CPT-LUS
003550     EXIT.
004000 END PROGRAM MYPGM.