       identification division.
       program-id. MAINPGM.
       data division.
       working-storage section.
       01 MyType01  typedef strict public pic X.
       01 myVar     type MyType01.
       procedure division.
      *KO myVar has wrong type !
           call DPDCY01::Proc01 input myVar
           .
       end program MAINPGM.