000000*Don't except any errors
000260 IDENTIFICATION DIVISION.
000270 PROGRAM-ID. PGM.
000490 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000510 SOURCE-COMPUTER. IBM-370.
000540 OBJECT-COMPUTER. IBM-370.
000620 DATA DIVISION.
000860 WORKING-STORAGE SECTION.
002750 01  GROUP.
002760     05 VAR1 PIC X(78) value 'f
002770-       ' accès illimité* à vos comptes                  '.
002920     05 VAR2 PIC X(46) value '
002930-        '         '.
003110 PROCEDURE DIVISION.
003240     .