       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZDEP1.
      
       DATA DIVISION.
       working-storage section.
      
       01 CopiesInsideTypeDef TYPEDEF STRICT PUBLIC.
            COPY YCONVEA.
            05 MyVar1 PIC X.
            COPY YPRTD20 REPLACING CHARACTERS 
                BY i CHARACTERS BY j CHARACTERS BY k.
      
       01 CopyInsideContainerInsideTypeDef TYPEDEF STRICT PUBLIC.
            04 CONTAINER. COPY YCONVEA REPLACING 
            ==:Foo:==
           BY
                ==Too
               ==.
            
       01 ConventionalTypeDefInDependency TYPEDEF STRICT PUBLIC.
            05 firstname PIC X(20).
            05 lastname PIC X(20).
      
       01 Type1 TYPEDEF STRICT PUBLIC.
          02  Body. COPY YCONVEA.
          02  Part1. COPY YPRTD20.
          02  Part2. COPY YCONVEA.

       01 Type2 TYPEDEF STRICT PUBLIC.
          COPY SUPCPY.

       PROCEDURE DIVISION.
      
       END PROGRAM DVZDEP1.