       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZMFT3.
Line 3[8,21] <27, Error, Syntax> - Syntax error : extraneous input 'DATADIVISION.' expecting {ExecStatementText, ExecStatementEnd, CommitStatement, SelectStatement}
       DATA DIVISION.
       WORKING-STORAGE SECTION.
             EXEC SQL 
              SELECT *
              SELECT ALL *
              SELECT DISTINCT *
              SELECT
Line 10[15,20] <27, Error, Syntax> - Syntax error : mismatched input 'SELECT' expecting {'*', ALL, DISTINCT}
Line 10[26,33] <27, Error, Syntax> - Syntax error : mismatched input 'DISTINCT' expecting '*'
              SELECT ALL DISTINCT 
             END-EXEC.
       PROCEDURE DIVISION.
         
           GOBACK
           .
       END PROGRAM DVZZMFT3.
