       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZMFT3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *KO empty group item
Line 6[11,16] <27, Error, Syntax> - Syntax error : A group item cannot be empty.
       01 group1.
           EXEC SQL DECLARE Table1 TABLE
           ( Table1_Field1 CHAR(1) NOT NULL,
Line 9[14,21] <37, Warning, General> - Warning: a End statement is not aligned with the matching opening statement
           ) END-EXEC.
      *KO same thing but with a copy
Line 11[11,16] <27, Error, Syntax> - Syntax error : A group item cannot be empty.
       01 group2.
           COPY CopyWithExecSqlOnly.
      *KO level number mismatch
Line 14[11,16] <27, Error, Syntax> - Syntax error : Cannot include copy CopyWithExecSqlAndData1 under level 1 because copy starts at level 1.
       01 group3.
           COPY CopyWithExecSqlAndData1.
      *OK
       01 group4.
           COPY CopyWithExecSqlAndData2.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM DVZZMFT3.
