       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZZMFT3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
             EXEC SQL
              LOCK TABLE DSN.EMP8df IN EXCLUSIVE MODE
              LOCK TABLE DBD.DSN.EMP PARTITION 8 IN SHARE MODE
              LOCK TABLE DBD.DSN.EMP PARTITION 100 IN SHARE  
             END-EXEC.
       PROCEDURE DIVISION.
         
           GOBACK
           .
       END PROGRAM DVZZMFT3.