       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOFM117.
       PROCEDURE DIVISION.
           COPY StartingExecSql.
           COPY EndingExecSql.
           GOBACK
           .
       END PROGRAM TCOFM117.