004740 IDENTIFICATION DIVISION.
004750 PROGRAM-ID. MYPROGA.
023040 PROCEDURE DIVISION.
023260     .
136480 IDENTIFICATION DIVISION.
136490 PROGRAM-ID MYPROGB.
136890 PROCEDURE DIVISION.
136920     EVALUATE AA
136930       WHEN 'A'
136950        continue
136960       WHEN 'B'
136980        continue
136990     END-EVALUATE
137100     EVALUATE BB
137110        WHEN 'C'
137170     END-EVALUATE                                               
137210     .
137470 END PROGRAM.
143040 END PROGRAM.