       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOMFL06.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 PIC X.
       01 other-data PIC X.
       01 var2 PIC 9.
       PROCEDURE DIVISION.
           STR
           GOBACK
           .
       END PROGRAM TCOMFL06.
---------------------------------------------------------------------------------
{"line":8,"character":14}
---------------------------------------------------------------------------------
[
  {
    "label": "STRING ",
    "kind": 14,
    "data": {
      "start": {
        "line": 8,
        "character": 11
      },
      "end": {
        "line": 8,
        "character": 14
      }
    }
  }
]