
EVALUATE TRUE
  WHEN conditionname1
    IF conditionname2
      DISPLAY "OK"
    END-IF
  WHEN conditionname3
    DISPLAY "KO"
END-EVALUATE.

*EVALUATE identifier
*  WHEN condition1
*    PERFORM funcname1
*  WHEN ('whatever')
*    PERFORM funcname2
*END-EVALUATE.