* too much elements
MOVE CORRESPONDING a TO x y
* illegal literal with CORRESPONDING
MOVE CORRESPONDING 1 TO x
* illegal intrinsic function after TO
MOVE x TO FUNCTION RANDOM
MOVE x TO FUNCTION LENGTH (x)