MOVE CORRESPONDING a TO x
* intrinsic function
MOVE FUNCTION RANDOM TO x
MOVE FUNCTION LENGTH (x) TO x
* special registers
MOVE LENGTH OF x TO x
MOVE LENGTH x TO x
MOVE x TO LENGTH OF x
MOVE x TO LENGTH x
* continuations
                 MOVE 'Lorem ipsum dolor sit amet, consectetur adi
-               'piscing elit, sed do eiusmod tempor incididunt ut
-               'labore et dolore magna aliqua                 '  
                                         TO  SOMEWHERE           