* intrinsic function
MOVE FUNCTION LENGTH (x) TO x.
* special registers
MOVE LENGTH OF x TO x.
MOVE LENGTH x TO x.
* continuations
                 MOVE 'Lorem ipsum dolor sit amet, consectetur adi
-               'piscing elit, sed do eiusmod tempor incididunt ut
-               'labore et dolore magna aliqua                 '  
                                         TO  SOMEWHERE           