IF NOT condition
  STRING
      'hello' DELIMITED BY SIZE
      var1    DELIMITED BY SIZE
      ' - '   DELIMITED BY SIZE
      var2    DELIMITED BY SIZE
    INTO x(2)
  END-STRING
END-IF.