       IDENTIFICATION DIVISION.
       PROGRAM-ID. tcSet.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 PIC X.
       01 p-var1 POINTER.
       01 tab.
          05 item OCCURS 10 INDEXED BY idx.
             10 element PIC X.
       01 var2 PIC 9.
       PROCEDURE DIVISION.
       
      *SET statement for assignment
      *OK
           SET p-var1 TO ADDRESS OF var1.
      *KO
Line 17[16,21] <30, Error, Semantics> - Semantic error: Symbol UNSAFE is not referenced
           SET UNSAFE p-var1 TO ADDRESS OF var1.

      *SET statement for indexes
      *OK
           SET idx UP BY 9.
           SET idx DOWN BY 7.
      *KO
Line 24[26,29] <48, Error, Syntax> - TypeCobol-only feature: using arithmetic expressions to manipulate indexes is not supported.
           SET idx UP BY var2 - 3.
Line 25[28,28] <48, Error, Syntax> - TypeCobol-only feature: using arithmetic expressions to manipulate indexes is not supported.
           SET idx DOWN BY 8 * var2.
       END PROGRAM tcSet.
