000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. MYPGM.
000000 ENVIRONMENT DIVISION.
000000 CONFIGURATION SECTION.
000000 SOURCE-COMPUTER. IBM-370.
000000 DATA DIVISION.
000000 FILE SECTION.
000000 FD F-ENT001                      BLOCK CONTAINS 0
000000                                  RECORDING MODE IS F
000000                                  LABEL RECORD STANDARD.
000000    COPY NOTFOUND.
000000
000000 FD F-ENT002                      BLOCK CONTAINS 0
000000                                  LABEL RECORD STANDARD.
000000
000000 01 ENT002-REC pic X.
000000    
000000
000000 PROCEDURE DIVISION.
000000     GOBACK
000000     .
000000 END PROGRAM MYPGM.