      * Parser will generate a virtual node with level 01 which should be ignored in CSV but present in TREE output
       05 Var1 pic X.
       05 Var2 pic X.
       05 Var3 pic X.