       01 TCOQLF.
           05 TCOQLF-Var1 pic X.
           05 TCOQLF-Var2 pic X.
           05 TCOQLF-Var3 pic X.
           05 TCOQLF-Var4 pic X.
           05 TCOQLF-Var5 pic X.
           05 TCOQLF-Var6 pic X.