       01 groupA.
          05 varA-1 pic X.
          05 varA-2 pic X.
          05 varA-3 pic X.
          05 varA-4 pic X.
          05 varA-5 pic 9.
          05 groupB.
             10 groupC.
                15 varC-1 pic 9.
             10 varB-1 pic X.
             10 varB-2 pic X.