      *TypeCobol_Version:[[ParserVersion]]
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM2.

       DATA DIVISION.
       Working-STORAGE SECTION.
       01 TC-Callee pic X(08) value 'CALLEE'.
       01 TC-MyIntrin pic X(08) value 'MYINTRIN'.
       01 TC-Call          PIC X VALUE 'T'.
           88 TC-FirstCall  VALUE 'T'.
           88 TC-NthCall    VALUE 'F'
                            X'00' thru 'S'
                            'U' thru X'FF'.

                               

      *01  somedate     TYPE Date.
       01 somedate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
                                  
       01  mymessage      PIC X(80).
      *01  vect2        TYPE Vect2.
       01 vect2.
           02 Coord2d.
             03 X PIC 9.
             03 Y PIC 9.
           02 Coord3d.
             03 Z PIC 9.
                                   
      *01  vect2b       TYPE Vect2.
       01 vect2b.
           02 Coord2d.
             03 X PIC 9.
             03 Y PIC 9.
           02 Coord3d.
             03 Z PIC 9.
                                   
      *01  MyVar        TYPE TechnicalContext.
       01 MyVar.
           02 Site.
             03 SiteName PIC X(8).
                                              
       LINKAGE SECTION.
      *Common to all librairies used by the program.
       01 TC-Library-PntTab.
          05 TC-Library-PntNbr          PIC S9(04) COMP.
          05 TC-Library-Item OCCURS 1000
                               DEPENDING ON TC-Library-PntNbr
                               INDEXED   BY TC-Library-Idx.
              10 TC-Library-Item-Idt      PIC X(08).
              10 TC-Library-Item-Pnt      PROCEDURE-POINTER.

      *To call program c6db8d4a in module Callee
      *Which is generated code for Callee.MyPublicProcedure
      *Declared in source file Callee.rdz.tcbl
       01 TC-Callee-c6db8d4a-Item.
          05 TC-Callee-c6db8d4a-Idt PIC X(08).
          05 TC-Callee-c6db8d4a PROCEDURE-POINTER.
      *To call program d3faf219 in module Callee
      *Which is generated code for Callee.MySecondPublicProcedure
      *Declared in source file Callee.rdz.tcbl
       01 TC-Callee-d3faf219-Item.
          05 TC-Callee-d3faf219-Idt PIC X(08).
          05 TC-Callee-d3faf219 PROCEDURE-POINTER.
      *To call program f9abcd81 in module MyIntrinsicFunctions
      *Which is generated code for MyIntrinsicFunctions.dump
      *Declared in source file MyIntrinsicFunctions.rdz.tcbl
       01 TC-MyIntrin-f9abcd81-Item.
          05 TC-MyIntrin-f9abcd81-Idt PIC X(08).
          05 TC-MyIntrin-f9abcd81 PROCEDURE-POINTER.


       PROCEDURE DIVISION.
      *
           PERFORM TC-INITIALIZATIONS

                          
      *    move vect2::Coord2d to Vect2b::Coord2d.
           move Coord2d OF vect2 to Coord2d OF Vect2b.
      *    move MyVar::Site::SiteName to mymessage.
           move SiteName OF Site OF MyVar to mymessage.
           .
      *declare procedure check private
      *   input mydate        TYPE Date.


       TRAITEMENT.
      * __________________________________________________
      * OK public procedures declared in "dependencies" file
      *       CALL Callee::MyPublicProcedure
      *             INPUT      somedate
              
           IF ADDRESS OF TC-Callee-c6db8d4a-Item = NULL
             OR TC-Callee-c6db8d4a-Idt not = 'c6db8d4a'
               PERFORM TC-LOAD-POINTERS-Callee
           END-IF
      *    Equivalent to call c6db8d4a in module Callee
           CALL TC-Callee-c6db8d4a USING
                                 somedate
           end-call
                                       

      *       CALL Callee::MySecondPublicProcedure
      *             INPUT      vect2
              
           IF ADDRESS OF TC-Callee-d3faf219-Item = NULL
             OR TC-Callee-d3faf219-Idt not = 'd3faf219'
               PERFORM TC-LOAD-POINTERS-Callee
           END-IF
      *    Equivalent to call d3faf219 in module Callee
           CALL TC-Callee-d3faf219 USING
                                 vect2
           end-call
                                       
      * __________________________________________________
      *procedure declared in this program
      *      CALL PGM2::check INPUT      somedate
             CALL 'c2c7ee3a' USING
                                 somedate
           end-call
                                                 

      *procedure declared in this program
      *      CALL check         INPUT      somedate
             CALL 'c2c7ee3a' USING
                                 somedate
           end-call
                                                   

      * __________________________________________________
      *procedure declared as intrinsic in MyIntrinsicFunctions
      *      call dump input mymessage
             
           IF ADDRESS OF TC-MyIntrin-f9abcd81-Item = NULL
             OR TC-MyIntrin-f9abcd81-Idt not = 'f9abcd81'
               PERFORM TC-LOAD-POINTERS-MyIntrin
           END-IF
      *    Equivalent to call f9abcd81 in module MyIntrinsicFunctions
           CALL TC-MyIntrin-f9abcd81 USING
                                 mymessage
           end-call
                                      
      
      *procedure declared as intrinsic in MyIntrinsicFunctions
      *      call MyIntrinsicFunctions::dump input mymessage
             
           IF ADDRESS OF TC-MyIntrin-f9abcd81-Item = NULL
             OR TC-MyIntrin-f9abcd81-Idt not = 'f9abcd81'
               PERFORM TC-LOAD-POINTERS-MyIntrin
           END-IF
      *    Equivalent to call f9abcd81 in module MyIntrinsicFunctions
           CALL TC-MyIntrin-f9abcd81 USING
                                 mymessage
           end-call
                                                            
        .
      *=================================================================
       TC-INITIALIZATIONS.
      *=================================================================
            IF TC-FirstCall
                 SET TC-NthCall TO TRUE
                 SET ADDRESS OF TC-Callee-c6db8d4a-Item  TO NULL
                 SET ADDRESS OF TC-Callee-d3faf219-Item  TO NULL
                 SET ADDRESS OF TC-MyIntrin-f9abcd81-Item  TO NULL
            END-IF
            .
      *=================================================================
        TC-LOAD-POINTERS-Callee.
      *=================================================================
            CALL 'ZCALLPGM' USING TC-Callee
            ADDRESS OF TC-Library-PntTab
            PERFORM VARYING TC-Library-Idx FROM 1 BY 1
            UNTIL TC-Library-Idx > TC-Library-PntNbr
                EVALUATE TC-Library-Item-Idt (TC-Library-Idx)
                WHEN 'c6db8d4a'
                     SET ADDRESS OF
                     TC-Callee-c6db8d4a-Item
                     TO ADDRESS OF
                     TC-Library-Item(TC-Library-Idx)
                WHEN 'd3faf219'
                     SET ADDRESS OF
                     TC-Callee-d3faf219-Item
                     TO ADDRESS OF
                     TC-Library-Item(TC-Library-Idx)
                WHEN OTHER
                     CONTINUE
                END-EVALUATE
            END-PERFORM
            .
      *=================================================================
        TC-LOAD-POINTERS-MyIntrin.
      *=================================================================
            CALL 'ZCALLPGM' USING TC-MyIntrin
            ADDRESS OF TC-Library-PntTab
            PERFORM VARYING TC-Library-Idx FROM 1 BY 1
            UNTIL TC-Library-Idx > TC-Library-PntNbr
                EVALUATE TC-Library-Item-Idt (TC-Library-Idx)
                WHEN 'f9abcd81'
                     SET ADDRESS OF
                     TC-MyIntrin-f9abcd81-Item
                     TO ADDRESS OF
                     TC-Library-Item(TC-Library-Idx)
                WHEN OTHER
                     CONTINUE
                END-EVALUATE
            END-PERFORM
            .

       END PROGRAM PGM2.


      *
      *declare procedure check private
      *   input mydate        TYPE Date.
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. c2c7ee3a.
       DATA DIVISION.
       LINKAGE SECTION.
      *PGM2.check - Params :
      *     input(mydate: DATE)
       01 mydate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
       PROCEDURE DIVISION
             USING BY REFERENCE mydate
           .
      *PGM2.check - Params :
      *     input(mydate: DATE)
           CONTINUE.
       END PROGRAM c2c7ee3a.
