       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM2.

       DATA DIVISION.
       Working-STORAGE SECTION.

      *01  somedate     TYPE Date.
       01 somedate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
                                  
       01  message      PIC X(80).
      *01  vect2        TYPE Vect2.
       01 vect2.
           02 Coord2d.
             03 X PIC 9.
             03 Y PIC 9.
           02 Coord3d.
             03 Z PIC 9.
                                   
      *01  vect2b       TYPE Vect2.
       01 vect2b.
           02 Coord2d.
             03 X PIC 9.
             03 Y PIC 9.
           02 Coord3d.
             03 Z PIC 9.
                                   
       01  TC-Callee-FctList-Loaded PIC X(02) EXTERNAL.
           88 TC-Callee-FctList-IsLoaded      VALUE 'OK'.
      *Callee::MyPublicProcedure
        01 TC-Callee-c6db8d4a PROCEDURE-POINTER EXTERNAL.
      *Callee::MySecondPublicProcedure
        01 TC-Callee-d3faf219 PROCEDURE-POINTER EXTERNAL.
       01  TC-MyIntrin-FctList-Loaded PIC X(02) EXTERNAL.
           88 TC-MyIntrin-FctList-IsLoaded      VALUE 'OK'.
      *MyIntrin::dump
        01 TC-MyIntrin-f9abcd81 PROCEDURE-POINTER EXTERNAL.


       PROCEDURE DIVISION.
      *
           PERFORM TC-Initializations

                          
      *    move vect2::Coord2d to Vect2b::Coord2d
           move Coord2d OF vect2 to Coord2d OF Vect2b
           .
      *declare procedure check private
      *   input mydate        TYPE Date.


       TRAITEMENT.
      * __________________________________________________
      * OK public procedures declared in "dependencies" file
      *    CALL Callee::MyPublicProcedure
      *             INPUT      somedate
           CALL TC-Callee-c6db8d4a USING
                                 somedate
           end-call
                                       

      *    CALL Callee::MySecondPublicProcedure
      *             INPUT      vect2
           CALL TC-Callee-d3faf219 USING
                                 vect2
           end-call
                                       
      * __________________________________________________
      *procedure declared in this program
      *    CALL PGM2::check INPUT      somedate
           CALL 'c2c7ee3a' USING
                                 somedate
           end-call
                                               

      *procedure declared in this program
      *   CALL check         INPUT      somedate
          CALL 'c2c7ee3a' USING
                                 somedate
           end-call
                                                

      * __________________________________________________
      *procedure declared as intrinsic in MyIntrinsicFunctions
      *   call dump input message
          CALL TC-MyIntrinsicFunctions-f9abcd81 USING
                                 message
           end-call
                                 
      
      *procedure declared as intrinsic in MyIntrinsicFunctions
      *   call MyIntrinsicFunctions::dump input message
          CALL TC-MyIntrinsicFunctions-f9abcd81 USING
                                 message
           end-call
                                                       
        .
      *=================================================================
        TC-Initializations.
      *=================================================================
            IF NOT TC-Callee-FctList-IsLoaded
                CALL 'ZCALLPGM' USING 'Callee'
            END-IF
            IF NOT TC-MyIntrin-FctList-IsLoaded
                CALL 'ZCALLPGM' USING 'MyIntrin'
            END-IF
            .

       END PROGRAM PGM2.

      *
      *declare procedure check private
      *   input mydate        TYPE Date.
      *_________________________________________________________________
       IDENTIFICATION DIVISION.
       PROGRAM-ID. c2c7ee3a.
       DATA DIVISION.
       LINKAGE SECTION.
       01 mydate.
           02 YYYY PIC 9(4).
           02 MM PIC 9(2).
           02 DD PIC 9(2).
       PROCEDURE DIVISION
             USING BY REFERENCE mydate
           .
           CONTINUE.
       END PROGRAM c2c7ee3a.
