      *TypeCobol_Version:[[ParserVersion]]
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZFSCTX.
       data division.
       working-storage section.                                               
       PROCEDURE DIVISION.
       declare procedure  GetTechnicalContext public
           output TechCtx    type BOOL
                  RC         type DATE.
       end-declare.
       declare procedure GetIdentification PUBLIC
           input TechCtx      type BOOL
                  RC          type DATE.
       end-declare.
       declare procedure DisplayDebug public
           output TechCtx type BOOL.
       end-declare.
       END PROGRAM DVZFSCTX.
