*Don't except any errors
 IDENTIFICATION DIVISION.
 PROGRAM-ID.  MyPGM.
*REMARKS. COPY=(YINIPGM
*
*                      ).
 PROCEDURE DIVISION.
     .