000001 01 :TAG:. 
000002   02 :TAG:-WEEK PIC S99. 
000003   02 :TAG:-GROSS-PAY PIC S9(5)V99. 
000004   02 :TAG:-HOURS PIC S999 OCCURS 1 TO 52 TIMES 
000005          DEPENDING ON :TAG:-WEEK OF :TAG:.


