       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm1.
      *KO copy alters scan state by including DATA DIVISION
       COPY DataDivision.
       01 var2 PIC X.
       PROCEDURE DIVISION.
           GOBACK
           .
       END PROGRAM Pgm1.