       IDENTIFICATION DIVISION.
      *Warning : A blank was missing before character "P" in column 19.
      *          A blank was assumed.
       PROGRAM-ID.Pgm1.
       END PROGRAM Pgm1.