       IDENTIFICATION DIVISION.
       PROGRAM-ID. VisPrgVar0.
       AUTHOR. MAYANJE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 Var1 PIC X.
       LOCAL-STORAGE SECTION.
       01 Var2 PIC 9.
      
       PROCEDURE DIVISION.
       .
      
       END PROGRAM VisPrgVar0.
      