       IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPGM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       DATA DIVISION.
       WORKING-STORAGE section.
      * CPY without suffix and declared without replacing clause
           01 CONVEA.  COPY  YCONVEA.
      * CPY without suffix and declared with    replacing clause
           01 PRTD20 COPY YPRTD20 REPLACING ==:PRTD20:== BY ==PRTD20==.
      * CPY with    suffix and declared without replacing clause
           01 CONVEAL.  COPY  YCONVEAL.
      * CPY with    suffix and declared with    replacing clause
           01 PRTD20L COPY YPRTD20L REPLACING ==:PRTD20:== BY PRTD20.
      
      * NON CPY  without suffix and declared without replacing clause
           COPY XCONVEA.
      * NON CPY without suffix and declared with    replacing clause
           COPY XPRTD20 REPLACING ==:PRTD20:== BY ==PRTD20==.
      * NON CPY with    suffix and declared without replacing clause
           COPY XCONVEAL.
      * NON CPY with    suffix and declared with    replacing clause
           COPY XPRTD20L REPLACING ==:PRTD20:== BY ==PRTD20==.
      
      * MIisc tests related to the issue
          01 CONVEAL2. COPY  YCONVEAR.
                01 TRDF0L.   COPY  YTRDF0L.
                01 TRDF0LR.  COPY  YTRDF0LR.
                01 TRDF1L.   COPY  YTRDF1L.
             COPY YTRDF2L  REPLACING ==:TRDF2L:== BY TDRF2L.
             COPY YTRDF2LR REPLACING ==:TRDF2L:== BY TDRF2LR.
             COPY YTRDF3L  REPLACING ==:TRDF3L:== BY TDRF3LT.
      
       PROCEDURE DIVISION.
      * CPY without suffix and declared with EXEC SQL INCLUDE
       EXEC SQL INCLUDE YTTMCOI END-EXEC.
      * CPY with    suffix and declared with EXEC SQL INCLUDE
       EXEC SQL INCLUDE YTTMCOIS END-EXEC.
      
      * NON CPY without suffix and declared with EXEC SQL INCLUDE
       EXEC SQL INCLUDE CPXMCOI END-EXEC.
      * NON CPY with    suffix and declared with EXEC SQL INCLUDE
       EXEC SQL INCLUDE CPXMCOIS END-EXEC.
           GOBACK
           .
       END PROGRAM MYPGM.