       IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPGM.                   
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       DATA DIVISION.
       WORKING-STORAGE section.
          01 PRTD20L.  COPY  YPRTD20L.   
          01 CONVEAL.  COPY  YCONVEAL.
          01 CONVEAL2. COPY  YCONVEAR.
		  01 TRDF0L.   COPY  YTRDF0L.
		  01 TRDF0LR.  COPY  YTRDF0LR.
		  01 TRDF1L.   COPY  YTRDF1L.
             COPY YTRDF2L  REPLACING ==:TRDF2L:== BY TDRF2L.
             COPY YTRDF2LR REPLACING ==:TRDF2L:== BY TDRF2LR.
             COPY YTRDF3L  REPLACING ==:TRDF3L:== BY TDRF3LT.
      
       PROCEDURE DIVISION.
       EXEC SQL INCLUDE YTTMCOIS END-EXEC.
           GOBACK
           .
       END PROGRAM MYPGM.