       IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPGM.                   
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       DATA DIVISION.
       WORKING-STORAGE section.
          01 PRTD20L. COPY  YPRTD20L.   
          01 CONVEAL. COPY  YCONVEAL.
          01 CONVEAL2. COPY  YCONVEAR.
		  01 MYCOPY. COPY YMYCOPY.
		  01 TRDF0L. COPY YTRDF0L.
		  01 TRDF1L. COPY YTRDF1L.
		  01 TRDF1L0. COPY YTRDF1L0.
      
       PROCEDURE DIVISION.
       EXEC SQL INCLUDE YTTMCOIS END-EXEC.
           GOBACK
           .
       END PROGRAM MYPGM.