       01 XCONVEA.
         05  XCONVEA-VEA-VEA-OUT-VEA pic X.
         05  XCONVEA-VEA-VEA-OUT-VEA-2 pic X.
         05  XCONVEA pic X.
         05  XCONVEA-VEA pic X.
         05  ANOTHER-DATA pic X.
         05  XCONVEA-VEATEST pic X.
         05  XCONVEA-TESTVEA pic X.
         05  XCONVEA-TESTVEA-TEST pic X.
         05  XCONVEA-TESTVEATEST pic X.