000070 01  YTRDF0L.                                                     
000080      05  FILLER                 PIC X(8) VALUE 'YTRDF0L '.       
000090      05  TRDF0L-RECH            PIC X(2).                        
000100         88 TRDF0L-VIDE          VALUE '  '.                      
000110*                                                                 
000120      05  TRDF0L-I.                                               
000130*                                   LONGUEUR 44                   
000140         10 LDO-NO-DOSSIER       PIC S9(11)V USAGE COMP-3.        
000150         10 LDO-CD-ETA           PIC X(1).                        
000160            88  LDO-CD-ETA-SAI          VALUE 'S'.                
000170            88  LDO-CD-ETA-VAL          VALUE 'V'. 