       IDENTIFICATION DIVISION.
       PROGRAM-ID. DependOnPgm.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       special-names. decimal-point is comma.
       DATA DIVISION.
       working-storage section.


       01 MyType TYPEDEF STRICT.
            05 TypeCounter pic 999 comp-5.

       01 MyTypedVar TYPE MyType.

       01 MyGroup.
          05 MyCounter pic 999 comp-5.
      *Ok MyCounter is unique in the source
          05 MyTab     occurs 99 depending on MyCounter.


       01 MyAmbiguousGroup.
      *OK you can declare 2 variables with the same name
          05 MyAmbiguousCounter  pic 999 comp-5.
      *OK you can declare 2 variables with the same name
          05 MyAmbiguousCounter  pic 999 comp-5.
      *KO reference to MyAmbiguousCounter is ... Ambiguous
          05 MyAmbiguousTab     occurs 99 
                                depending on MyAmbiguousCounter.

       01 MyGroup3.
          05 MyCounter3  pic 999 comp-5.
      *KO depending on clause cannot be a numeric
          05 MyTab3     occurs 99 depending on 999.


       01 MyGroup5.
          05 MyCounter5 pic 999 comp-5.
      *Ok use operator OF
          05 MyTab5     occurs 99 depending on MyCounter5 of MyGroup5. 
      *Ok use operator IN
          05 MyTab51     occurs 99 depending on MyCounter5 IN MyGroup5.
      *OK use operator ::
          05 MyTab52    occurs 99 depending on MyGroup::MyCounter.
      *OK use operator :: with typedef
          05 MyTab53    occurs 99 depending on MyTypedVar::TypeCounter.
       PROCEDURE DIVISION.
           move 1 to MyCounter
           .
       END PROGRAM MYPGM.