ID DIVISION.
PROGRAM-ID. ParagraphsSections.

DATA DIVISION.

PROCEDURE DIVISION.

P1.
    CONTINUE.

P3.
    CONTINUE.

S1 SECTION.
P2.
    CONTINUE.
P3.
    CONTINUE.
P4.
    CONTINUE.

S2 SECTION.
P4.
    CONTINUE.
P5.
    CONTINUE.

P5 SECTION.
P6.
    CONTINUE.

S1 SECTION.
P7.
    CONTINUE.

DECLARE FUNCTION fun PRIVATE.
PROCEDURE DIVISION.
    CONTINUE.
END-DECLARE.

END PROGRAM ParagraphsSections.