ID DIVISION.
PROGRAM-ID. ParagraphsSections.

DATA DIVISION.

PROCEDURE DIVISION.

P1.
    CONTINUE.

P3.
    CONTINUE.

S1 SECTION.
P2.
    CONTINUE.
P3.
    CONTINUE.
P4.
    CONTINUE.

S2 SECTION.
P4.
    CONTINUE.
P5.
    CONTINUE.

P5 SECTION.
P6.
    CONTINUE.

S1 SECTION.
P7.
    CONTINUE.

TEST-PERFORM.
    PERFORM P0
    PERFORM P1
    PERFORM P2
    PERFORM P3
    PERFORM P4
    PERFORM P5
    PERFORM P6
    PERFORM P7
    PERFORM P1 THROUGH P0
    PERFORM P1 THROUGH P1
    PERFORM P1 THROUGH P2
    PERFORM P1 THROUGH P3
    PERFORM P1 THROUGH P4
    PERFORM P1 THROUGH P5
    PERFORM P1 THROUGH P6
    PERFORM P1 THROUGH P7
    .

DECLARE FUNCTION fun PRIVATE.
PROCEDURE DIVISION.
    CONTINUE.
END-DECLARE.

END PROGRAM ParagraphsSections.