       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.

       DATA DIVISION.
       LOCAL-STORAGE SECTION.

       01  somedate     TYPE Date.
       01  someformat   PIC X(08).
       01  flag         TYPE Bool.
       01  realformat   PIC X(08).

       PROCEDURE DIVISION.
       
       DECLARE PROCEDURE Pgm1PrivateValidateDateFormat PRIVATE
           INPUT mydate        TYPE Date
                 format        PIC X(08)
          OUTPUT okay          TYPE Bool
                 actual-format PIC X(08).
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       TRAITEMENT.
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
           CALL PGM2::MyPublicProcedure
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat    
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PUBLIC_ANY_PGM)
           CALL PGM3::MyPublicProcedure
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat
      * __________________________________________________
      * OK : proper parameter list (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
           CALL Pgm1PrivateValidateDateFormat
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat

      * __________________________________________________
      * KO : (TCRFUN_CALL_PRIVATE_ONLY_SAME_PGM)
           CALL Pgm2PrivateValidateDateFormat
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat
       
        .

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM2.

       DATA DIVISION.
       LOCAL-STORAGE SECTION.

       01  somedate     TYPE Date.
       01  someformat   PIC X(08).
       01  flag         TYPE Bool.
       01  realformat   PIC X(08).

       PROCEDURE DIVISION.
       
       DECLARE PROCEDURE Pgm2PrivateValidateDateFormat PRIVATE.
       PROCEDURE DIVISION.
            CALL PGM2::MyPublicProcedure
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat  

         .
         END-DECLARE.
       DECLARE PROCEDURE MyPublicProcedure PUBLIC
           INPUT mydate        TYPE Date
                 format        PIC X(08)
          OUTPUT okay          TYPE Bool
                 actual-format PIC X(08).
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM PGM2.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM3.

       DATA DIVISION.
       LOCAL-STORAGE SECTION.

       01  somedate     TYPE Date.
       01  someformat   PIC X(08).
       01  flag         TYPE Bool.
       01  realformat   PIC X(08).

       PROCEDURE DIVISION.
       
       DECLARE PROCEDURE PrivateProc PRIVATE.
       PROCEDURE DIVISION.
            CALL MyPublicProcedure
                    INPUT      somedate someformat
                    OUTPUT     flag     realformat  

         .
         END-DECLARE.
       DECLARE PROCEDURE MyPublicProcedure PUBLIC
           INPUT mydate        TYPE Date
                 format        PIC X(08)
          OUTPUT okay          TYPE Bool
                 actual-format PIC X(08).
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM PGM3.

       END PROGRAM PGM1.

