IDENTIFICATION DIVISION.
  PROGRAM-ID. Tables.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 mysize PIC 9 VALUE 99.
01 x PIC X.
01 T-fixed-1             OCCURS 100.
   05 T-fixed-2          OCCURS 100.
     10 E                PIC X(8).
01 T-variable            OCCURS 100 DEPENDING ON mysize.
   05 E                  PIC X(8).
01 T-nobounds            OCCURS UNBOUNDED DEPENDING ON mysize.
   05 E                  PIC X(8).
01 T-minsize-1           OCCURS 50 TO UNBOUNDED DEPENDING ON mysize.
  05 T-minsize-2         OCCURS 50 TO UNBOUNDED DEPENDING ON mysize.
     10 E                PIC X(8).
01 T-interval            OCCURS 25 TO 50 DEPENDING ON mysize.
   05 E                  PIC X(8).

PROCEDURE DIVISION.

MOVE E OF T-nobounds TO E OF T-variable.
MOVE E OF T-fixed-2 OF T-fixed-1 (2 2) TO E OF T-fixed-2 OF T-fixed-1 (3 3).