       IDENTIFICATION DIVISION.
       PROGRAM-ID. TYPEPGM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  typeOfDays TYPEDEF STRICT PUBLIC pic X(01).
       PROCEDURE DIVISION.                                        
           GOBACK. 

       IDENTIFICATION DIVISION.
       PROGRAM-ID. Tester.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  var1 Type TYPEPGM::typeOfDays.
       01  var1 Type TYPEpgm::typeOFDAYS.
       01  var1 Type typepgm::typeofdays.
       END PROGRAM Tester.

       END PROGRAM TYPEPGM.