      *TypeCobol_Version:0.1(alpha)
       CBL ARITH(EXTEND)
       CBL NOLIST
      *CONTROL LIST
       CBL FLAG(I,W)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZXERRM.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 Counter PIC 9999.
      *CONTROL NOLIST
       PROCEDURE DIVISION.

           MOVE 10 TO Counter.
      *CBL NOSOURCE
       END PROGRAM DVZXERRM.
