       IDENTIFICATION DIVISION.
       PROGRAM-ID. IRLLBIRL.
       AUTHOR. REYDELPA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.      DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  Irl TYPEDEF STRICT PUBLIC.
         05 IsinCode PIC X(12).
         05 IrlQty TYPE Qty.
      
       01 Qty TYPEDEF STRICT PUBLIC.
          05 Dec TYPE TTTLBDEC::Dec.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
      
       END PROGRAM IRLLBIRL.
      