       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM.

       DATA DIVISION.
       Working-STORAGE SECTION.
       01 MyPicVar PIC X(10).
       01 IRLTest TYPE IRLLBIRL::Irl.
       01 MyGroup.
        05 IRLQty TYPE IRLLBIRL::Qty.
       01 SpanArrayVar TYPE IRLLBIRL::SpannArray.
       01 AlphaNum PIC X(01).

       PROCEDURE DIVISION.
       MOVE MyPicVar TO IRLTest::IrlQty::Dec::I.
       MOVE MyGroup::IRLQty::Dec::I TO MyPicVar.
       CALL IRLLBIRL::ToSpan INPUT AlphaNum OUTPUT SpanArrayVar::span.
       END PROGRAM PGM.