       IDENTIFICATION DIVISION.
       PROGRAM-ID. CircularRefCheck.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

      *Test 0, type is not cyclic
       01 NotCyclic TYPEDEF STRICT.
          05 X PIC 9.
          05 Y PIC 9.
          05 Z PIC 9.
       
      *Test 1 : type is directly cyclic with itself
       01 Cyclic1 TYPEDEF STRICT.
          05 X1 PIC 9.
          05 Y1 TYPE Cyclic1.
          05 Z1 PIC 9.
          
      *Test 2 : indirect cycle T2 -> T3 -> T2         
       01 Cyclic2 TYPEDEF STRICT.
          05 X2 PIC 9.
          05 Y2 TYPE Cyclic3.
          05 Z2 PIC 9.
       01 Cyclic3 TYPEDEF STRICT.
          05 X3 PIC 9.
          05 Y3 TYPE Cyclic2.
          05 Z3 PIC 9.
       
      *Test 3 : parent typedefs using cyclic types
       01 Cyclic4 TYPEDEF STRICT.
          05 X4 TYPE Cyclic5.
          05 Y4 TYPE Cyclic6.
          05 Z4 TYPE Cyclic7.
       01 Cyclic5 TYPEDEF STRICT.
          05 X5 PIC 9.
          05 Y5 TYPE Cyclic6.
          05 Z5 PIC 9.
       01 Cyclic6 TYPEDEF STRICT.
          05 X6 PIC 9.
          05 Y6 TYPE Cyclic5.
          05 Z6 PIC 9.
       01 Cyclic7 TYPEDEF STRICT.
          05 X7 PIC 9.
          05 Y7 TYPE Cyclic7.
          05 Z7 PIC 9.
       01 Cyclic8 TYPEDEF STRICT.
          05 item TYPE Cyclic4.
          
      *Typed variables using cyclic types directly, in arrays or groups
       01 var1 TYPE Cyclic1.
       01 var2 TYPE Cyclic2.
       01 var3 TYPE Cyclic3.
       01 var4 TYPE Cyclic4.
       01 var5 TYPE Cyclic5.
       01 var6 TYPE Cyclic6.
       01 var7 TYPE Cyclic7.
       01 var8 TYPE Cyclic8.
       01 array1 TYPE Cyclic1 OCCURS 9.
       01 array2 TYPE Cyclic2 OCCURS 9.
       01 array3 TYPE Cyclic3 OCCURS 9.
       01 array4 TYPE Cyclic4 OCCURS 9.
       01 array5 TYPE Cyclic5 OCCURS 9.
       01 array6 TYPE Cyclic6 OCCURS 9.
       01 array7 TYPE Cyclic7 OCCURS 9.
       01 array8 TYPE Cyclic8 OCCURS 9.
       01 group1.
          05 item1 PIC X.
          05 item2.
             10 sub-item-1 PIC X.
             10 sub-item-2 TYPE Cyclic8.
             10 sub-item-3 PIC X.
          05 item3 PIC X.
       01 group2.
           48 MyVar1 TYPE Cyclic8.
           45 MyVar2 TYPE Cyclic8.

      *Forward cycle detection
       01 A1 typedef strict.
            05 var1 type B1.

       01 B1 typedef strict.
            05 var1 type C1.

       01 C1 typedef strict.
            05 var1 type A1.

      *Now backward
       01 C2 typedef strict.
            05 var2 type A2.

       01 B2 typedef strict.
            05 var2 type C2.

       01 A2 typedef strict.
            05 var2 type B2.


       PROCEDURE DIVISION.
            move MyVar1::X5 to MyVar2::Z7.
       declare procedure CheckCircular private.
       data division.
       working-storage section.

       01 A3 typedef strict.
            05 var1 type B3.

       01 B3 typedef strict.
            05 var1 type C3.

       01 C3 typedef strict.
            05 var1 type A3.


       end-declare.

       declare procedure CheckCircular2 private.
       data division.
       working-storage section.

       01 A4 typedef strict.
            05 A4var type B4.

       01 B4 typedef strict.
            05 B4var type C4.

       01 C4 typedef strict.
            05 C4var type A4.

       01 MyVar type A4.
       procedure division.
          display MyVar::A4var::B4Var::C4Var
 
      *KO, A4Var must not be a valid child of C4Var as it's a circular reference
          display MyVar::A4var::B4Var::C4Var::A4Var
          .
       end-declare.
       END PROGRAM CircularRefCheck.