       IDENTIFICATION DIVISION.
       PROGRAM-ID. CircularRefCheck.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 ThirdType TYPEDEF STRICT.
Line 8[13,35] <30, Error, Semantics> - Semantic error: Type circular reference detected : ThirdType -> myType
            05 renjgrn TYPE myType.

       01 myType TYPEDEF STRICT.
            05 myVar PIC X(10).
            05 secondGroup pic X.
            05 yhrtger    TYPE ThirdType.
            05 ezgoerk    TYPE MySendType.

       01 MyGroup.
Line 17[15,20] <30, Error, Semantics> - Semantic error: Variable 'MyVar1' has to be limited to level 47 because of 'myType' maximum estimated children level
           48 MyVar1 TYPE myType.
           45 MyVar2 TYPE myType.


       01 MySendType TYPEDEF STRICT.
            05 MyVariable PIC X(10).
            05 MySecVariable PIC X.
Line 24[13,38] <30, Error, Semantics> - Semantic error: Type circular reference detected : MySendType -> myType
            05 SelfRef    TYPE myType.

       01 A1 typedef strict.
            05 var1 type B1.

       01 B1 typedef strict.
            05 var1 type C1.

       01 C1 typedef strict.
Line 33[13,28] <30, Error, Semantics> - Semantic error: Type circular reference detected : C1 -> B1 -> A1
            05 var1 type A1.


      *Now backward
       01 C2 typedef strict.
            05 var2 type A2.

       01 B2 typedef strict.
Line 41[13,28] <30, Error, Semantics> - Semantic error: Type circular reference detected : B2 -> A2 -> C2
            05 var2 type C2.

       01 A2 typedef strict.
            05 var2 type B2.

      *Now backward
       01 B3 typedef strict.
            05 var3 type C3.

       01 C3 typedef strict.
            05 var3 type A3.

       01 A3 typedef strict.
Line 54[13,28] <30, Error, Semantics> - Semantic error: Type circular reference detected : A3 -> C3 -> B3
            05 var3 type B3.



       PROCEDURE DIVISION.
            move MyVar1::myVar to MyVar2::secondGroup.
       declare procedure CheckCircular private.
       data division.
       working-storage section.

       01 A4 typedef strict.
            05 var1 type B4.

       01 B4 typedef strict.
            05 var1 type C4.

       01 C4 typedef strict.
Line 71[13,28] <30, Error, Semantics> - Semantic error: Type circular reference detected : C4 -> B4 -> A4
            05 var1 type A4.


       end-declare.

       declare procedure CheckCircular2 private.
       data division.
       working-storage section.

       01 A5 typedef strict.
            05 A5var type B5.

       01 B5 typedef strict.
            05 B5var type C5.

       01 C5 typedef strict.
Line 87[13,29] <30, Error, Semantics> - Semantic error: Type circular reference detected : C5 -> B5 -> A5
            05 C5var type A5.

       01 MyVar type A5.
       procedure division.
          move MyVar::A5var::B5Var::C5Var to MyVar::A5var::B5Var::C5Var
 
      *KO, A5Var must not be a valid child of C5Var as it's a circular reference
Line 94[44,48] <27, Error, Syntax> - Syntax error : Symbol MyVar.A5var.B5Var.C5Var.A5Var is not referenced
          move MyVar::A5var::B5Var::C5Var::A5Var 
Line 95[44,48] <27, Error, Syntax> - Syntax error : Symbol MyVar.A5var.B5Var.C5Var.A5Var is not referenced
            to MyVar::A5var::B5Var::C5Var::A5Var
          .
       end-declare.
       END PROGRAM CircularRefCheck.
