       IDENTIFICATION DIVISION.
       PROGRAM-ID. CircularRefCheck.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 ThirdType TYPEDEF STRICT.
            05 renjgrn TYPE myType.

       01 myType TYPEDEF STRICT.
            05 myVar PIC X(10).
            05 secondGroup pic X.
            05 yhrtger    TYPE ThirdType.
            05 ezgoerk    TYPE MySendType.

       01 MyGroup.
           48 MyVar1 TYPE myType.
           45 MyVar2 TYPE myType.


       01 MySendType TYPEDEF STRICT.
            05 MyVariable PIC X(10).
            05 MySecVariable PIC X.
            05 SelfRef    TYPE myType.


       PROCEDURE DIVISION.
            move MyVar1::myVar to MyVar2::secondGroup.
       END PROGRAM CircularRefCheck.