       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       data division.
       working-storage section.
       01 foo pic X(50).
       PROCEDURE DIVISION.
      
             move 'CHAMPS 082 A 085 INTERDITS EN OUVERTURE'
      -        to foo
      
           goback
           .
       END PROGRAM DVZF0OSM.