       IDENTIFICATION DIVISION.
       PROGRAM-ID. GlobalStorageTest.

       DATA DIVISION.

       GLOBAL-STORAGE SECTION.
Line 7[11,19] <27, Error, Syntax> - Syntax error : The variable 'etdzefezf' can only be of level 01 or 77
Line 7[11,19] <27, Error, Syntax> - Syntax error : The variable 'etdzefezf' with level 88 and 66 cannot be group item.
       88 etdzefezf         VALUE 'TRUE'.
Line 8[12,19] <27, Error, Syntax> - Syntax error : Data must be declared between level 01 to 49, or equals to 66, 77, 88
       123 zefzefze         TYPE Bool.
       01 G-Date            TYPE Date.
       01 G-TechCtx         TYPE Bool.
       01 DuplicatedVar     TYPE Bool.
      *KO, no typedef allowed in global-storage
Line 13[8,48] <27, Error, Syntax> - Syntax error : Illegal Type Definition in Global-Storage Section
       01 ForbiddenTypedef typedef strict pic X.

       01 Test48.
Line 16[14,18] <27, Error, Syntax> - Syntax error : Data declaration in global-storage section cannot be level 49
          49 NoVar PIC X.

       01 MyGroup.
      *Global clause is not authorized inside Global Storage
Line 20[15,32] <27, Error, Syntax> - Syntax error : Illegal GLOBAL clause in GLOBAL-STORAGE SECTION.
           05 ForbiddenGlobalVar     PIC x(10) GLOBAL.
           88 zedzed                VALUE 'TEST'.
      *External clause is not authorized inside Global Storage
Line 23[11,30] <27, Error, Syntax> - Syntax error : Illegal EXTERNAL clause in GLOBAL-STORAGE SECTION.
       01 ForbiddenExternalVar   PIC X(10) EXTERNAL.

       01 DefInGlobalStorageAndNested pic X.

       WORKING-STORAGE SECTION.
       01 DuplicatedVar     TYPE Bool.
       01 MyGroup PIC X(10).
           88 TestLevel VALUE "Test".
      *KO TypeDefs in Global-Storage Section are not referenced in
      *SymbolTable
Line 33[8,48] <30, Error, Semantics> - Semantic error: TYPE 'ForbiddenTypedef' is not referenced
       01 invalidTypedVar TYPE ForbiddenTypedef.

       01 DefInMainAsGlobalAndNested global pic X.

       PROCEDURE DIVISION.

       DECLARE PROCEDURE MyProc PRIVATE
           IN-OUT    myDate      TYPE DATE.
       Data division.
      *Global Storage Section cannot 
      * be defined inside procedure
Line 44[8,30] <27, Error, Syntax> - Syntax error : GLOBAL-STORAGE SECTION is only authorized in the main program of this source file.
       GLOBAL-STORAGE Section.
       WORKING-STORAGE Section.
       01 TestCtx TYPE Bool.
       PROCEDURE DIVISION.
      *G-Date and G-TechCtx are accesible from GlobalStorage
           MOVE G-Date TO myDate.
           MOVE G-TechCtx TO TestCtx.
       END-DECLARE.

           MOVE G-Date TO G-Date.
Line 54[17,29] <30, Error, Semantics> - Semantic error: Ambiguous reference to symbol DuplicatedVar 
Symbols found: GlobalStorageTest::DuplicatedVar | GlobalStorageTest::DuplicatedVar
           MOVE DuplicatedVar TO G-TechCtx.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. NestedProc.

       DATA DIVISION.
      *Global Storage Section cannot 
      * be defined inside nested program
Line 62[8,30] <27, Error, Syntax> - Syntax error : GLOBAL-STORAGE SECTION is only authorized in the main program of this source file.
       GLOBAL-STORAGE SECTION.
       WORKING-STORAGE SECTION.
       01 MyDate TYPE Date.

       PROCEDURE DIVISION.
      *G-Date is accessible in nested from Global Storage
           MOVE G-Date TO MyDate.
       DECLARE PROCEDURE MyProc PRIVATE
            IN-OUT    myDate      TYPE DATE.
       Data division.
       WORKING-STORAGE Section.
       01 TestCtx TYPE Bool.
       01 DefInGlobalStorageAndNested pic X.
       01 DefInMainAsGlobalAndNested pic X.
       PROCEDURE DIVISION.
      *G-Date and G-TechCtx are accessible 
      * in nested procedure from Global Storage
           MOVE G-Date TO myDate.
           MOVE G-TechCtx TO TestCtx.

      *KO Rule GLOBALSS_ALWAYS_RESOLVE
Line 83[6,6] <1, Error, TextFormat> - Invalid indicator character '[6,6]' : use space for source lines, * or / for comment lines, D or d for debugging lines, - for continuation lines
	  *DefInGlobalStorageAndNested is defined twice
Line 84[17,43] <30, Error, Semantics> - Semantic error: Ambiguous reference to symbol DefInGlobalStorageAndNested 
Symbols found: GlobalStorageTest::NestedProc::MyProc::DefInGlobalStorageAndNested | GlobalStorageTest::DefInGlobalStorageAndNested
           move DefInGlobalStorageAndNested
             to DefInMainAsGlobalAndNested
           .
       END-DECLARE.

       END PROGRAM NestedProc.

       END PROGRAM GlobalStorageTest.


       IDENTIFICATION DIVISION.
       PROGRAM-ID. StackedProg.

       DATA DIVISION.
      *Global Storage Section cannot 
      * be defined inside stacked program
Line 100[8,30] <27, Error, Syntax> - Syntax error : GLOBAL-STORAGE SECTION is only authorized in the main program of this source file.
       GLOBAL-STORAGE SECTION.

       WORKING-STORAGE SECTION.
       01 MyDate TYPE Date.

       PROCEDURE DIVISION.
      *G-Date is not accessible in StackedProgram
Line 107[17,22] <30, Error, Semantics> - Semantic error: Symbol G-Date is not referenced
           MOVE G-Date TO MyDate.

       END PROGRAM StackedProg.
