       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 myName PIC X(20) value "domi".
       01 result TYPE Bool.
       PROCEDURE DIVISION.
       INIT-LIBRARY.
           exit.
          declare procedure IsPersonValid public
               input  Name PIC X(20).
               output IsOk Type Bool.
          data division.
          working-storage section.
          procedure division.
               display "proc" Name
               SET IsOk TO True
               .
          end-declare.
        p1.
           call IsPersonValid
                input myName
                output result
           end-call
           display "result=" result
           GOBACK.
       END PROGRAM Pgm.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 myName PIC X(20) value "domi".
       01 result TYPE Bool.
       PROCEDURE DIVISION.
       DECLARATIVES.
           READY-TRACE SECTION.
           USE FOR DEBUGGING ON ALL PROCEDURES.
                DISPLAY 'DVZBTES4:' DEBUG-ITEM
           .
       END DECLARATIVES.
       INIT-LIBRARY.
           exit.
          declare procedure IsPersonValid public
               input  Name PIC X(20).
               output IsOk Type Bool.
          data division.
          working-storage section.
          procedure division.
               display "proc" Name
               SET IsOk TO True
               .
           end-declare.
       p1.
           call IsPersonValid
                input myName
                output result
           end-call
           display "result=" result
           GOBACK.
       END PROGRAM Pgm1.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 myName PIC X(20) value "domi".
       01 result TYPE Bool.
       PROCEDURE DIVISION.
       INIT-LIBRARY.
           exit.
          declare procedure IsPersonValid public
               input  Name PIC X(20).
               output IsOk Type Bool.
          data division.
          working-storage section.
          procedure division.
               display "proc" Name
               SET IsOk TO True
               .
          end-declare.
       s1 SECTION.
           .
       p1.
           call IsPersonValid
                input myName
                output result
           end-call
           display "result=" result
           GOBACK.
       END PROGRAM Pgm2.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 myName PIC X(20) value "domi".
       01 result TYPE Bool.
       PROCEDURE DIVISION.
       INIT-LIBRARY.
           exit.
          declare procedure IsPersonValid public
               input  Name PIC X(20).
               output IsOk Type Bool.
          data division.
          working-storage section.
          procedure division.
               display "proc" Name
               SET IsOk TO True
               .
          end-declare.
           call IsPersonValid
                input myName
                output result
           end-call
           display "result=" result
           GOBACK.
       END PROGRAM Pgm3.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 myName PIC X(20) value "domi".
       01 result TYPE Bool.
       PROCEDURE DIVISION.
          declare procedure IsPersonValid public
               input  Name PIC X(20).
               output IsOk Type Bool.
          data division.
          working-storage section.
          procedure division.
               display "proc" Name
               SET IsOk TO True
               .
          end-declare.
           call IsPersonValid
                input myName
                output result
           end-call
           display "result=" result
           GOBACK.
       END PROGRAM Pgm4.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm5.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 myName PIC X(20) value "domi".
       01 result TYPE Bool.
       PROCEDURE DIVISION.
           declare procedure IsPersonValid public
               input  Name PIC X(20).
               output IsOk Type Bool.
           data division.
           working-storage section.
           procedure division.
               display "proc" Name
               SET IsOk TO True
               .
           end-declare.
        p1.
           call IsPersonValid
                input myName
                output result
           end-call
           display "result=" result
           GOBACK.
       END PROGRAM Pgm5.
      