       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVECORR.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 var2 PIC X(10).

       01 groupA-1.
         02 groupA-2.
           03 varA type Date.
       01 groupB-1.
         02 groupB-2.
           03 varB type Bool.

       PROCEDURE DIVISION.


           MOVE CORR var2 TO var2.

           MOVE CORR groupA-1::groupA-2::varA
                  To groupB-1::groupB-2::varB
           MOVE CORR groupA-1::varA
                  To groupB-1::groupB-2::varB
           MOVE CORR groupA-1::groupA-2::varA
                  To groupB-1::varB
           MOVE CORR groupA-1::varA
                  To groupB-1::varB

           MOVE CORR undefinedVariable
                  To undefinedVariable2


           .
       END PROGRAM MOVECORR.