       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVECORR.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 var2 PIC X(10).

       01 groupA-1.
         02 groupA-2.
           03 varA type Date.
       01 groupB-1.
         02 groupB-2.
           03 varB type Bool.

       01 MyGroup1.
           05 Data1 PIC 9(10).
           05 Data2 TYPE Date.
           05 Data5 PIC 9(10).
       01 MyGroup2.
           05 Data1 PIC 9(10).
           05 Data2 TYPE Date.
       01 MyGroup3.
           05 Data1 PIC 9(10).
           05 Data2 TYPE Bool.
           05 Data4 TYPE Date.
       01 MyGroup4.
           05 Data1 PIC X(10).
           05 Data2 TYPE Bool.
           05 Data3 TYPE Date.
       01 MyGroup5.
           05 Data1 PIC 9(10).
           05 Data2 TYPE Date.
           05 Data2 TYPE Date.

       PROCEDURE DIVISION.


           MOVE CORR var2 TO var2.

           MOVE CORR groupA-1::groupA-2::varA
                  To groupB-1::groupB-2::varB
           MOVE CORR groupA-1::varA
                  To groupB-1::groupB-2::varB
           MOVE CORR groupA-1::groupA-2::varA
                  To groupB-1::varB
           MOVE CORR groupA-1::varA
                  To groupB-1::varB

           MOVE CORR undefinedVariable
                  To undefinedVariable2

           MOVE CORR MyGroup1 TO MyGroup2.
           MOVE CORR MyGroup1 TO MyGroup3.
           MOVE CORR MyGroup1 TO MyGroup4.
           MOVE CORR MyGroup3 TO MyGroup4.
           MOVE CORR MyGroup1 TO MyGroup5.


           .
       END PROGRAM MOVECORR.