       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVECORR.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 var2 PIC X(10).

       01 groupA-1.
         02 groupA-2.
           03 varA type Date.
       01 groupB-1.
         02 groupB-2.
           03 varB type Bool.

       01 MyGroup1.
           05 Data1 PIC 9(10).
           05 Data2 TYPE Date.
           05 Data5 PIC 9(10).
       01 MyGroup2.
           05 Data1 PIC 9(10).
           05 Data2 TYPE Date.
       01 MyGroup3.
           05 Data1 PIC 9(10).
           05 Data2 TYPE Bool.
           05 Data4 TYPE Date.
       01 MyGroup4.
           05 Data1 PIC X(10).
           05 Data2 TYPE Bool.
           05 Data3 TYPE Date.
       01 MyGroup5.
           05 Data1 PIC 9(10).
           05 Data2 TYPE Date.
           05 Data2 TYPE Date.

       PROCEDURE DIVISION.


           MOVE CORR var2 TO var2.

           MOVE CORR groupA-1::groupA-2::varA
Line 43[42,45] <30, Error, Semantics> - Semantic error: Cannot write DATE to strongly typed variable groupB-1.groupB-2.varB:BOOL.
                  To groupB-1::groupB-2::varB
           MOVE CORR groupA-1::varA
Line 45[42,45] <30, Error, Semantics> - Semantic error: Cannot write DATE to strongly typed variable groupB-1.groupB-2.varB:BOOL.
                  To groupB-1::groupB-2::varB
           MOVE CORR groupA-1::groupA-2::varA
Line 47[32,35] <30, Error, Semantics> - Semantic error: Cannot write DATE to strongly typed variable groupB-1.varB:BOOL.
                  To groupB-1::varB
           MOVE CORR groupA-1::varA
Line 49[32,35] <30, Error, Semantics> - Semantic error: Cannot write DATE to strongly typed variable groupB-1.varB:BOOL.
                  To groupB-1::varB

Line 51[22,38] <30, Error, Semantics> - Semantic error: Symbol undefinedVariable is not referenced
           MOVE CORR undefinedVariable
Line 52[22,39] <30, Error, Semantics> - Semantic error: Symbol undefinedVariable2 is not referenced
                  To undefinedVariable2

           MOVE CORR MyGroup1 TO MyGroup2.
Line 55[12,41] <27, Error, Syntax> - Syntax error : Symbol MOVECORR.MyGroup1.Data2 of type DATE do not match symbol MOVECORR.MyGroup3.Data2 of type BOOL
           MOVE CORR MyGroup1 TO MyGroup3.
Line 56[12,41] <27, Error, Syntax> - Syntax error : Symbol MOVECORR.MyGroup1.Data2 of type DATE do not match symbol MOVECORR.MyGroup4.Data2 of type BOOL
           MOVE CORR MyGroup1 TO MyGroup4.
           MOVE CORR MyGroup3 TO MyGroup4.
Line 58[12,41] <27, Error, Syntax> - Syntax error : Multiple symbol "data2" detected in MOVE CORR
           MOVE CORR MyGroup1 TO MyGroup5.


           .
       END PROGRAM MOVECORR.
