       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVEQUA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1. 
	       05 var2 PIC x.
       PROCEDURE DIVISION.
      * KO
           move 'val' to type::var1.
      * KO
           move 'val' to var1::type.                                            
      * KO 
           move 'val' to var1::var2::type. 
      * KO
           move 'val' to var1::type::undefinedVar. 
      * KO
           move 'val' to var1::9.
      * KO
           move var2::9 to var1.
      * OK 
           move 'val' to var1::var2. 
      * illegal intrinsic function after TO
           MOVE var2 TO FUNCTION RANDOM.
           MOVE var2 TO FUNCTION LENGTH (var1).
       END PROGRAM MOVEQUA.