       id division.
       program-id. PgmA.
      *OK
       namespace banking::currentaccount.
      *Warning, same namespace as the current program
       using banking::currentaccount.
      *Warning, same namespace as the current program
      *Also same namespace as another using clause 
       using banking::currentaccount.
       data division.
       working-storage section.
       01 MyType typedef strict public pic X .  



       id division.
       program-id. PgmA1.
      *KO no namespace allowed on nested program
       namespace banking::currentaccount::bill.
      *OK
       using banking::currentaccount.
       end program PgmA1.

       end program PgmA.



       id division.
       program-id. PgmB.
      *KO no namespace allowed on stacked program
       namespace banking::currentaccount::bill.

      *KO namespace doesn't exists
       using banking::currentaccount::bill.
      *Warning, same namespace as the current program
       using banking::currentaccount.
      *Warning, same namespace as the current program
      *Also same namespace as another using clause 
       using banking::currentaccount.
       
       id division.
       program-id. PgmB1.
      *KO no namespace allowed on nested program
       namespace banking::currentaccount::bill.
       end program PgmB1.

       end program PgmB.
       
      

       id division.
       program-id. PgmC.
      *KO no namespace allowed on stacked program
       namespace banking::currentaccount::bill.
       
       end program PgmC.
