       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       Working-Storage Section.
       01 Person typedef strict public.
          05 LastName  pic X(80).
          05 FirstName pic X(80).
          05 CAddress.
             10 AddressTab occurs 5 indexed by AdrIdx.
                15 AdressLine    pic X(50).
       01 myPerson type Person.
       01 myName PIC X(20) VALUE "mammouth".
       01 myNbr  PIC 99 VALUE 20.
       01 result TYPE bool.
          01 myvar1 PIC X value 'X'.
      
       PROCEDURE DIVISION.
       INIT-LIBRARY.
           exit.
       DECLARE PROCEDURE IsPersonValid
           input  pperson TYPE Person
                  pname PIC X(20)
           in-out pnbr PIC 99
           output IsOk Type Bool.
       DATA DIVISION.
       Working-Storage Section.
       01 personPtr          PIC X(16).
       PROCEDURE DIVISION.
Line 29[35,42] <27, Error, Syntax> - Syntax error : Input variable 'pperson' is modified by an instruction
           move "ppp" to pperson::LastName
Line 30[26,33] <27, Error, Syntax> - Syntax error : Input variable 'pperson' is modified by an instruction
           move "ppp" to LastName
Line 31[26,30] <27, Error, Syntax> - Syntax error : Input variable 'pname' is modified by an instruction
           move "ggg" to pname
Line 32[26,30] <27, Error, Syntax> - Syntax error : Input variable 'pname' is modified by an instruction
           move "hh"  to PName
Line 33[26,34] <27, Error, Syntax> - Syntax error : Input variable 'pperson' is modified by an instruction
           move "jj"  to firstName of pperson
           move 30    to pnbr
           Set IsOk   to true
      *ok pperson is not modified
           Set address of pperson to address of personPtr
      *ko pperson is modified
Line 39[47,52] <27, Error, Syntax> - Syntax error : Input variable 'pperson' is modified by an instruction
           Set pperson::CAddress::AddressTab::AdrIdx    to 1
           .
       END-DECLARE.
      
       declare procedure Foo input var1 pic X.
       procedure division.
      * Ok, 1st param is also input in Foo2
           call Foo2 input var1
      * Ko, 1st param is also in-out in Foo3
Line 48[29,32] <27, Error, Syntax> - Syntax error : Input variable 'var1' is modified by an instruction
           call Foo3 in-out var1
           goback
           .
       end-declare.
      
       declare procedure Foo2 public
           input var1 pic X.
       procedure division.
           goback.
       end-declare.
      
       declare procedure Foo3 public
           in-out var1 pic X.
       procedure division.
           goback.
       end-declare.
      
      %<<<
           Description InvalidParamProc.
           @Params:
               - var1 pic X
      %>>>
       declare InvalidParamProc private
Line 71[32,37] <27, Error, Syntax> - Syntax error : 'occurs' is not supported yet
              input var1 pic X occurs 5.
       end-declare.
      
       declare InvalidParamProc2 private
Line 75[33,38] <27, Error, Syntax> - Syntax error : 'occurs' is not supported yet
               input var1 pic X occurs 5.
       end-declare.
      
       Traitement.
           call IsPersonValid
                INPUT myPerson, myName
                IN-OUT myNbr
                OUTPUT result
                 call Foo input myvar1
           GOBACK.
       END PROGRAM Pgm.
