       IDENTIFICATION DIVISION.
       PROGRAM-ID. Pgm.
       DATA DIVISION.
       Working-Storage Section.
       01 Person typedef strict public.
          05 LastName  pic X(80).
          05 FirstName pic X(80).
       01 myPerson type Person.
       01 myName PIC X(20) VALUE "mammouth".
       01 myNbr  PIC 99 VALUE 20.
       01 result TYPE bool.
          01 myvar1 PIC X value 'X'.
      
       PROCEDURE DIVISION.
       INIT-LIBRARY.
      
       DECLARE PROCEDURE IsPersonValid
           input  pperson TYPE Person
                  pname PIC X(20)
           in-out pnbr PIC 99
           output IsOk Type Bool.
       DATA DIVISION.
       Working-Storage Section.
       PROCEDURE DIVISION.
Line 25[35,42] <27, Error, Syntax> - Syntax error : Input variable 'pperson' is modified by an instruction
           move "ppp" TO pperson::LastName
Line 26[26,33] <27, Error, Syntax> - Syntax error : Input variable 'pperson' is modified by an instruction
           move "ppp" TO LastName
Line 27[26,30] <27, Error, Syntax> - Syntax error : Input variable 'pname' is modified by an instruction
           move "ggg" to pname
Line 28[25,29] <27, Error, Syntax> - Syntax error : Input variable 'pname' is modified by an instruction
           move "hh" to PName
Line 29[25,33] <27, Error, Syntax> - Syntax error : Input variable 'pperson' is modified by an instruction
           move "jj" to firstnAme OF PPErson
           move 30 to pnbr
           SET IsOk TO True
           .
       END-DECLARE.
      
       declare procedure Foo input var1 pic X.
       procedure division.
      * Ok, 1st param is also input in Foo2
           call Foo2 input var1
      * Ko, 1st param is also in-out in Foo3
Line 40[29,32] <27, Error, Syntax> - Syntax error : Input variable 'var1' is modified by an instruction
           call Foo3 in-out var1
           goback
           .
       end-declare.
      
       declare procedure Foo2 public
           input var1 pic X.
       procedure division.
           goback.
       end-declare.
      
       declare procedure Foo3 public
           in-out var1 pic X.
       procedure division.
           goback.
       end-declare.
      
       Traitement.
           call IsPersonValid
                INPUT myPerson, myName
                IN-OUT myNbr
                OUTPUT result
                 call Foo input myvar1
           GOBACK.
       END PROGRAM Pgm.
      
