       IDENTIFICATION DIVISION.
       PROGRAM-ID. GlobalStorageTest.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 myPointerThatIsWayTooLong POINTER.
       COPY SetUpDownPointerCpyData.


       PROCEDURE DIVISION.
Line 12[8,44] <27, Error, Syntax> - Syntax error : Pointer name 'myPointerThatIsWayTooLong' is over 22 characters.
       SET myPointerThatIsWayTooLong UP BY 1.

Line 14[8,28] <27, Error, Syntax> - Syntax error : Pointer 'myPointer' belongs to a copy.
       SET myPointer UP BY 1.
      

       END PROGRAM StackedProg.
