       IDENTIFICATION DIVISION.
       PROGRAM-ID. TYPEPGM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  typeOfDaysPublic TYPEDEF STRICT PUBLIC pic X(01).
       01  typeOfDaysPrivate TYPEDEF STRICT PRIVATE pic X(01).
       01  typeOfDaysNoModifier TYPEDEF STRICT pic X(01).
       01  NewGlobalType TYPEDEF STRICT pic X GLOBAL.
       PROCEDURE DIVISION.                                        
           GOBACK.
 
      *** Nested Program ***
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Tester.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  var1 Type TYPEPGM::typeOfDaysPublic.
       01  var1 Type TYPEpgm::typeOFDAYSPUBLIC.
       01  var1 Type typepgm::typeofdayspublic.
      *OK Type is declared Global
       01  var1 Type NewGlobalType.

       END PROGRAM Tester.
       END PROGRAM TYPEPGM.

      *** Stacked Program ***
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Stacked.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  var1 Type TYPEPGM::typeOfDaysPublic.
       01  var1 Type TYPEpgm::typeOFDAYSPUBLIC.
       01  var1 Type typepgm::typeofdayspublic.
      *KO Type is declared Global
       01  var1 Type NewGlobalType.

       END PROGRAM Stacked.