       IDENTIFICATION DIVISION.
       PROGRAM-ID. TYPEPGM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  typeOfDays TYPEDEF STRICT PUBLIC pic X(01).
       01  typeOfDaysPrivate TYPEDEF STRICT PRIVATE pic X(01).
       01  typeOfDaysNoModifier TYPEDEF STRICT pic X(01).
       01  NewType TYPEDEF STRICT pic X GLOBAL.
       PROCEDURE DIVISION.                                        
           GOBACK.
 
      *** Nested Program ***
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Tester.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  var1 Type TYPEPGM::typeOfDays.
       01  var1 Type TYPEpgm::typeOFDAYS.
       01  var1 Type typepgm::typeofdays.
      *OK Type is declared Global
       01  var1 Type NewType.

       END PROGRAM Tester.
       END PROGRAM TYPEPGM.

      *** Stacked Program ***
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Stacked.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  var1 Type TYPEPGM::typeOfDays.
       01  var1 Type TYPEpgm::typeOFDAYS.
       01  var1 Type typepgm::typeofdays.
      *KO Type is declared Global
       01  var1 Type NewType.

       END PROGRAM Stacked.