IDENTIFICATION DIVISION.
  PROGRAM-ID. Tables.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 mysize PIC 9 VALUE 99.
01 X PIC X.
01 T-Level01.
  02 T-fixed-1         OCCURS 100.
    05 T-fixed-2       OCCURS 100.
      10 E             PIC X(8).
  02 T-variable        OCCURS 100 DEPENDING ON mysize.
    05 E               PIC X(8).
  02 T-nobounds        OCCURS UNBOUNDED DEPENDING ON mysize.
    05 E               PIC X(8).

PROCEDURE DIVISION.

* correct
MOVE X     TO E OF T-fixed-2 OF T-fixed-1 (1 1)
*MOVE X     TO T-fixed-1 (1) :: T-fixed-2 (1) :: E
* T-fixed-2,T-fixed-1: missing subscripting
MOVE X     TO E OF T-fixed-2 OF T-fixed-1
MOVE X     TO T-fixed-1 :: T-fixed-2 :: E
* E: too few subscripts
MOVE X     TO E OF T-fixed-2 OF T-fixed-1 (1)
*MOVE X     TO T-fixed-1 (1) :: T-fixed-2 :: E
*MOVE X     TO T-fixed-1 :: T-fixed-2 (1) :: E
* E: too many subscripts
MOVE X     TO E OF T-fixed-2 OF T-fixed-1 (1 1 1)
*MOVE X     TO T-fixed-1 (1) :: T-fixed-2 (1) :: E (1)
* X: unexpected subscripting
MOVE X (1) TO E OF T-fixed-2 OF T-fixed-1 (1 1)
*MOVE X (1) TO T-fixed-1 (1) :: T-fixed-2 (1) :: E
.

* T-nobounds: missing subscripting
MOVE X TO   E OF T-nobounds
MOVE X TO   T-nobounds :: E
* correct
MOVE X TO   E OF T-nobounds (9999)
*MOVE X TO   T-nobounds (9999) :: E
MOVE X TO   E OF T-variable (99)
*MOVE X TO   T-variable (99) :: E
* TODO? can we see 100 > mysize?
MOVE X TO   E OF T-variable (100)
*MOVE X TO   T-variable (100) :: E
* T-variable: out of bounds
MOVE X TO   E OF T-variable (101)
*MOVE X TO   T-variable (101) :: E
.