000000*This test is in fact handled by the rule:
000000*        TCLIMITATION_NO_CE_ACROSS_SOURCES
000000*But if one day this rule is removed, 
000000*this test will be useful to control 
000000*the rule TCRFUN_NO_COPY_IN_PARAMETERS
000000 ID DIVISION.
000000 PROGRAM-ID. TCRFUN_NO_COPY_IN_PARAMETERS.
000000 
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000 01 DateJulian    TYPEDEF STRONG.
000000          10 YYYY PIC 9(04).
000000          10 DDD  PIC 9(03).     
000000 01 DateDB2 TYPEDEF STRONG.
000000          10  YYYY PIC 9(04).
000000          10  filler-X PIC X.
000000          10  MM PIC 9(02).
000000          10  filler-X PIC X.
000000          10  DD PIC 9(02).
000000 
000000 PROCEDURE DIVISION.
000000 
000000*OK
000000 DECLARE FUNCTION currentDate PRIVATE RETURNING result TYPE Date.
000000 PROCEDURE DIVISION.
000000     ACCEPT result FROM DATE YYYYMMDD.
000000 END-DECLARE.
000000 
000000*KO: TCRFUN_NO_COPY_IN_PARAMETERS this function use a COPY to 
      *describe its parameters
000000 DECLARE FUNCTION badFunc1 PRIVATE
000000     INPUT     COPY TCRFUN_NO_COPY_IN_PARAMETERS-copy01.
000000     RETURNING y   PIC 9(08).
000000 PROCEDURE DIVISION.
000000 END-DECLARE.
000000 
000000*KO: TCRFUN_NO_COPY_IN_PARAMETERS this function use a COPY to 
      *describe its parameters
000000 DECLARE FUNCTION badFunc2 PRIVATE
000000     COPY TCRFUN_NO_COPY_IN_PARAMETERS-copy02.
000000     RETURNING y   PIC 9(08).
000000 PROCEDURE DIVISION.
000000 END-DECLARE.
000000 
000000*KO: TCRFUN_NO_COPY_IN_PARAMETERS this function use a COPY to 
      *describe its parameters
000000 DECLARE FUNCTION badFunc3 PRIVATE
000000     INPUT     COPY TCRFUN_NO_COPY_IN_PARAMETERS-copy03 
                     replacing ==:prefix:== by ==prefix==.
000000     RETURNING y   PIC 9(08).
000000 PROCEDURE DIVISION.
000000 END-DECLARE.
000000 
000000 
000000 .
000000 END PROGRAM TCRFUN_NO_COPY_IN_PARAMETERS.