       IDENTIFICATION DIVISION.
       PROGRAM-ID. TYPEPGM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  typeOfDaysPublic  TYPEDEF STRICT PUBLIC pic X(01).
       01  typeOfDaysPrivate TYPEDEF STRICT PRIVATE pic X(01).
       01  typeOfDaysLocal   TYPEDEF STRICT pic X(01).
       PROCEDURE DIVISION.                                        
           GOBACK. 

       IDENTIFICATION DIVISION.
       PROGRAM-ID. Tester.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 Type TYPEPGM::typeOfDaysPublic.
       01 var1 Type TYPEpgm::typeOFDAYSPUBLIC.
       01 var1 Type typepgm::typeofdayspublic.

       01 var2 Type typepgm::typeOfDaysPrivate.
       01 var2 Type typepgm::typeOFDAYSPRIVATE.
       01 var2 Type typepgm::typeofdaysprivate.

      *KO : local typedef not accessible
       01 var3 Type typepgm::typeOfDaysLocal.

       END PROGRAM Tester.

       END PROGRAM TYPEPGM.