       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.


      *OK
       01 var1.
         05 var2.
           10 var3   pic X.
         05 var4     pic 9.

      *KO because var1 contains a child
Line 14[8,21] <27, Error, Syntax> - Syntax error : Group item var1 contained the "PICTURE" clause.
       01 var1 pic X.
         05 var2 pic X.

      *Should be KO because var1 contains child with incompatible 
      *picture.
      *But outside the scope of #729 
      *so for now it's unchecked then it's OK
       01 var1 comp.
         05 var2 pic XX.
         05 var3 pic 9.
         05 var4 pic X(2).

      *OK
       01 toto comp-2.
           05 titi.
      *OK
       01 toto comp-2.
           05 titi comp-2.
      *KO
       01 toto comp-2.
           05 titi pic 9.

      *OK
       01 var1 comp.
         05 var3 pic 9.

      *KO because var1 contains a child
Line 41[8,23] <27, Error, Syntax> - Syntax error : Elementary item USAGE var1 seen has Group Item.
       01 var1 pointer.
         05 var2 pic X.

      *KO because var1 contains a child
Line 45[8,32] <27, Error, Syntax> - Syntax error : Elementary item USAGE var1 seen has Group Item.
       01 var1 usage is pointer.
         05 var2 pic X.

      *KO because var1 contains a child
Line 49[8,25] <27, Error, Syntax> - Syntax error : Item var1 is a TYPE that does not allow Group Item definition.
       01 var1 type Date.
         05 var2 pic X.




       01 var1.
      *KO because var2 contains a child
Line 57[10,23] <27, Error, Syntax> - Syntax error : Group item var2 contained the "PICTURE" clause.
         05 var2 pic X.
           10 var3   pic X.


       01 var1.
      *Should be KO because var2 contains a child with pic X
      *But outside the scope of #729 
      *so for now it's unchecked then it's OK
         05 var2 comp.
           10 var3   pic X.

       01 var1.
      *KO because var2 contains a child (only 1 error expected)
Line 70[10,34] <27, Error, Syntax> - Syntax error : Elementary item USAGE var2 seen has Group Item.
         05 var2 usage is pointer.
           10 var3 pic X.
           10 var4 pic 9.
           10 var5 pic X(2).

       01 var1.
      *KO because var2 contains a child
Line 77[10,27] <27, Error, Syntax> - Syntax error : Item var2 is a TYPE that does not allow Group Item definition.
         05 var2 type Date.
           10 var3   pic X.


      *KO because var1 contains a child
Line 82[8,21] <27, Error, Syntax> - Syntax error : Group item var1 contained the "PICTURE" clause.
       01 var1 pic X.
         05 var2.
           10 var3   pic X.

      *Should be KO because var1 contains a child with a pic X
      *But outside the scope of #729 
      *so for now it's unchecked then it's OK
       01 var1 comp.
         05 var2.
           10 var3   pic X.

      *KO because var1 contains a child
Line 94[8,32] <27, Error, Syntax> - Syntax error : Elementary item USAGE var1 seen has Group Item.
       01 var1 usage is pointer.
         05 var2.
           10 var3   pic X.

      *KO because var1 contains a child
Line 99[8,25] <27, Error, Syntax> - Syntax error : Item var1 is a TYPE that does not allow Group Item definition.
       01 var1 type Date.
         05 var2.
           10 var3   pic X.


       01 var1 pic X(100).
      *KO because var1 contains a child
Line 106[8,41] <27, Error, Syntax> - Syntax error : Group item var2 contained the "PICTURE" clause.
       01 var2 redefines var1 pic X(100).
          05 var3   pic X.

       01 var1.
          05 var2 pic X(10).
      *KO because var3 contains children (only 1 error expected)
Line 112[11,43] <27, Error, Syntax> - Syntax error : Group item var3 contained the "PICTURE" clause.
          05 var3 redefines var2 pic X(10).
            10 var4   pic X.
            10 var5   pic X(09).


       END PROGRAM DVZF0OSM.
