       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVZF0OSM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.



      *KO because var1 contains a child
Line 9[11,14] <27, Error, Syntax> - Syntax error : Group item  var1 cannot have a "TYPE"
       01 var1 type Date.
         05 var2 pic X.

       01 var1.
      *KO because var2 contains a child
Line 14[13,16] <27, Error, Syntax> - Syntax error : Group item  var2 cannot have a "TYPE"
         05 var2 type Date.
           10 var3   pic X.

      *KO because var1 contains a child
Line 18[11,14] <27, Error, Syntax> - Syntax error : Group item  var1 cannot have a "TYPE"
       01 var1 type Date.
         05 var2.
           10 var3   pic X.

       END PROGRAM DVZF0OSM.
