       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
       data division.
       global-storage section.
       01 dataMainGlobalStorage pic X.
       working-storage section.
       01 dataMainLocal  pic X.
       01 dataMainGlobal pic X global.
      
       procedure division.
      *In Main all dataMain* variables are visible
      *Variables declared in Nested or Procs are not visible
      *OK
           move dataMainGlobalStorage to dataMainLocal
           display dataMainGlobal
      *KO
           move dataProcMain to dataNestedLocal
           move dataNestedGlobal to dataProcNested
           move dataSubNestedLocal to dataSubNestedGlobal
           display dataProcSubNested
           .
      
       declare procedure procInMain private
               input paramMain pic X.
       data division.
       working-storage section.
       01 dataProcMain pic X.
       procedure division.
      *Procedure has access to GlobalStorage and its local variables
      *OK
           move paramMain to dataProcMain
           display dataMainGlobalStorage
      *
           move dataMainLocal to dataMainGlobal
           move dataNestedLocal to dataNestedGlobal
           move dataProcNested to dataSubNestedLocal
           move dataSubNestedGlobal to dataProcSubNested
           .
       end-declare.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nested.
       data division.
       working-storage section.
       01 dataNestedLocal  pic X.
       01 dataNestedGlobal pic X global.
      
       PROCEDURE DIVISION.
      *Nested pgm has access to :
      * - its own local and global variables
      * - global variables from parent
      * - variables in global-storage
      *OK
           move dataNestedLocal to dataNestedGlobal
           move dataMainGlobal to dataMainGlobalStorage
      *KO
           move dataMainLocal to dataProcMain
           move dataProcNested to dataSubNestedLocal
           move dataSubNestedGlobal to dataProcSubNested
           .
      
       declare procedure procInNested private
               input paramNested pic X.
       data division.
       working-storage section.
       01 dataProcNested pic X.
       procedure division.
      *Same as procInMain (own local + GS)
      *OK
           move paramNested to dataProcNested
           display dataMainGlobalStorage
      *KO
           move dataMainLocal to dataMainGlobal
           move dataProcMain to dataNestedLocal
           move dataNestedGlobal to dataSubNestedLocal
           move dataSubNestedGlobal to dataProcSubNested
           .
       end-declare.
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SubNested.
       data division.
       working-storage section.
       01 dataSubNestedLocal  pic X.
       01 dataSubNestedGlobal pic X global.
      
       PROCEDURE DIVISION.
      *SubNested has access to
      * - its own local and global variables
      * - global variables from both Nested and Main
      * - variables from GlobalStorage
      *OK
           move dataSubNestedLocal to dataSubNestedGlobal
           move dataNestedGlobal to dataMainGlobal
           display dataMainGlobalStorage
      *KO
           move dataMainLocal to dataProcMain
           move dataNestedLocal to dataProcNested
           display dataProcSubNested
           .
      
       declare procedure procInSubNested private
               input paramSubNested pic X.
       data division.
       working-storage section.
       01 dataProcSubNested pic X.
       procedure division.
      *Same as procInMain (own local + GS)
      *OK
           move paramSubNested to dataProcSubNested
           display dataMainGlobalStorage
      *KO
           move dataMainLocal to dataMainGlobal
           move dataProcMain to dataNestedLocal
           move dataNestedGlobal to dataProcNested
           move dataSubNestedLocal to dataSubNestedGlobal
           .
       end-declare.
      
       END PROGRAM SubNested.
       END PROGRAM Nested.
       END PROGRAM MainProgram.