       IDENTIFICATION DIVISION.
       PROGRAM-ID. FunDeclare.
       PROCEDURE DIVISION.
           move a to move
       
       END PROGRAM FunDeclare.