000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. SourceAcrossFiles2.
000000 ENVIRONMENT DIVISION.
000000 CONFIGURATION SECTION.
000000 SOURCE-COMPUTER. IBM-370.
000000 DATA DIVISION.
000000 WORKING-STORAGE section.
000000 01 a pic X.
000000 01 b pic X.
000000    
000000
000000 PROCEDURE DIVISION.
           move a copy SourceAcrossFiles2ToA.
000000     GOBACK
000000     .
000000 END PROGRAM SourceAcrossFiles2.