       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyIntrinsicFunctions.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 Vect..This is an Error..

       PROCEDURE DIVISION.
       
       declare procedure dump public
          input message pic X(80)
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM MyIntrinsicFunctions.
