       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHAPELIB.
       AUTHOR. JCM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370
           .
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DECLARE PROCEDURE InitShape PUBLIC
               INPUT     InputData         Type SHAPETYP::POINT
               OUTPUT    RC                PIC 9
               .
       END-DECLARE.
       DECLARE PROCEDURE InitShape PUBLIC
               INPUT     InputData        Type SHAPETYP::LINEAR
               OUTPUT    RC                PIC 9
               .
       END-DECLARE.
       DECLARE PROCEDURE InitShape PUBLIC
               INPUT     InputData         Type SHAPETYP::TRIANGLE
               OUTPUT    RC                PIC 9
               .
       END-DECLARE.
       DECLARE PROCEDURE InitShape PUBLIC
               INPUT     InputData        Type SHAPETYP::RECTANGLE
               OUTPUT    RC                PIC 9
               .
       END-DECLARE.
       DECLARE PROCEDURE Transform PUBLIC
               INPUT     InputData        Type SHAPETYP::LINEAR
                         Kind Type SHAPEFCT::TRANSFORM
               OUTPUT    RC                Type Bool
               .
       END-DECLARE.
       END PROGRAM SHAPELIB.
