       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHAPETYP.
       AUTHOR. JCM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370
           .
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 POINT TYPEDEF STRICT PUBLIC.
           05 X PIC 9(4) COMP-5.
           05 Y PIC 9(4) COMP-5.
      
       01 LINEAR TYPEDEF STRICT PUBLIC.
           05 P1 TYPE POINT.
           05 P2 TYPE POINT.
      
       01 TRIANGLE TYPEDEF STRICT PUBLIC.
           05 P1 TYPE POINT.
           05 P2 TYPE POINT.
           05 P3 TYPE POINT.
      
       01 RECTANGLE TYPEDEF STRICT PUBLIC.
           05 P1 TYPE POINT.
           05 P2 TYPE POINT.
           05 P3 TYPE POINT.
           05 P4 TYPE POINT.
       PROCEDURE DIVISION.
       DECLARE PROCEDURE Validate PUBLIC
               INPUT    InputData         Type POINT
               OUTPUT    RC               Type Bool
               .
       END-DECLARE.
       DECLARE PROCEDURE Validate PUBLIC
               INPUT    InputData         Type LINEAR
               OUTPUT    RC               Type Bool
               .
       END-DECLARE.
       DECLARE PROCEDURE Validate PUBLIC
               INPUT    InputData         Type TRIANGLE
               OUTPUT    RC               Type Bool
               .
       END-DECLARE.
       DECLARE PROCEDURE Validate PUBLIC
               INPUT    InputData         Type RECTANGLE
               OUTPUT    RC               Type Bool
               .
       END-DECLARE.
      
       END PROGRAM SHAPETYP.