       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyPgm.
       PROCEDURE DIVISION.
       01 OutOfPerimeter2.
          02 OutOfPerimeter2-var1 PIC X.
          02 OutOfPerimeter2-var2 PIC X.
