       IDENTIFICATION DIVISION.
       PROGRAM-ID. DocGen.

       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       
000000%<<< 
          @ description : inline typedef
          @ params:
            - none: Type doesn't have any params
          @deprec
          @Restriction : Do not Use BOOL var 
          @Params:
            - Typedefs: should not have any params
000000%>>>
       01 myType TYPEDEF STRICT PUBLIC pic X(01).

000111%<<
           a multiline comment
000112%>>

      %<<< Vect2D
      %>>>
       01 Vect2D TYPEDEF STRICT PUBLIC.
         02 Coord2d.
           03 X PIC 9(4).
           03 Y PIC 9(4).


      %<<< This type is private
      %>>>
       01 PrivateType TYPEDEF STRICT pic XXX.


      %<<< My program 
          @ Description  description
          @deprecated
          @    replacedBy  MyFonction2
          @ rEsTrIcTiOn Do not Use BOOL var
          @ need  some needs
              - description
          @ see  Thank you for your attention
          @ todo 
              - Add BOOL support 
              - implement a call counter
      %>>>
       PROCEDURE DIVISION.

      %<<< MyProc info
          @ deprec : It is
       deprecated
               @           need : long need
          @ todo:
              - todo1
              - todo 2
        @ params:
          - myDate: just a date
          - bla: bla < 2
          - toto: toto 
          -blu: will be ignored
      %>>>
       DECLARE PROCEDURE MyProc PUBLIC
           INPUT    myDate      TYPE Date
                    bla         Pic S9(1)V9(12)
           IN-OUT   myBool      TYPE BOOL
           OUTPUT   toto        TYPE BOOL
                    bli         Pic PPP999PPP.
       PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       END PROGRAM DocGen.