       01 three-levels.
          05 root-table-3 OCCURS 1000.
             10 table-level1-2 OCCURS 200.
                15 table-level2-1 OCCURS 30.
                   20 var5 PIC X.
                   20 var6 PIC X.