       IDENTIFICATION DIVISION.
       PROGRAM-ID. DebugMultiLines.
000000D This is a debug line 1
000000D This is a debug line 2
000000D This is a debug line 3
       END PROGRAM DebugMultiLines.
