       IDENTIFICATION DIVISION.
       PROGRAM-ID. Callee.

       DATA DIVISION.
       working-storage section.

       01 CopiesInsideTypeDef TYPEDEF STRICT PUBLIC.
            04 CONTAINER. COPY YCONVEA.
            05 MyVar1 PIC X.
            COPY YPRTD20 REPLACING CHARACTERS 
                BY i CHARACTERS BY j CHARACTERS BY k.
      
       01 CopyInsideContainerInsideTypeDef TYPEDEF STRICT PUBLIC.
            04 CONTAINER. COPY YCONVEA REPLACING 
            ==:Foo:==
           BY
                ==Too
               ==.
               
       01 OneLinerTypeDef TYPEDEF STRICT PUBLIC.
            04 CONTAINER. 
                05 DATA1 PIC X. 
                   COPY YCONVEA. COPY YPRTD20. 05 DATA2 PIC X.
            
       01 ConventionalTypeDefInDependency TYPEDEF STRICT PRIVATE.
            05 firstname PIC X(20).
            05 lastname PIC X(20).
            
       01 MyCopyInsideContainerInsideTypeDef
            TYPE CopyInsideContainerInsideTypeDef.
       PROCEDURE DIVISION.
           CONTINUE.
       END PROGRAM Callee.