           05  xxxENT3::-FCT01.
               10 xxxENT3::-FCT01-Var1            PIC X(05).
           01  xxxENT2. COPY YxxxENT2 REPLACING ==::== BY ====.