       IDENTIFICATION DIVISION.
       PROGRAM-ID. Callee.

       PROCEDURE DIVISION.

       DECLARE PROCEDURE MyPublicProcedure PUBLIC
           INPUT mydate        TYPE Date
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       DECLARE PROCEDURE MySecondPublicProcedure PUBLIC
           INPUT vect2        TYPE Vect2
         .
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       END PROGRAM Callee.
