       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM2.

       DATA DIVISION.
       Working-STORAGE SECTION.

       01  somedate     TYPE Date.
       01  message      PIC X(80).
       01  vect2        TYPE Vect2.
       01  vect2b       TYPE Vect2.
       01  MyVar        TYPE TechnicalContext.

       PROCEDURE DIVISION.
           move vect2::Coord2d to Vect2b::Coord2d.
           move MyVar::Site::SiteName to message.
           .
       declare procedure check private
          input mydate        TYPE Date.
         PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.


       TRAITEMENT.
      * __________________________________________________
      * OK public procedures declared in "dependencies" file
           CALL Callee::MyPublicProcedure
                    INPUT      somedate

           CALL Callee::MySecondPublicProcedure
                    INPUT      vect2   
      * __________________________________________________
      *procedure declared in this program
           CALL PGM2::check INPUT      somedate

      *procedure declared in this program
          CALL check         INPUT      somedate

      * __________________________________________________
      *procedure declared as intrinsic in MyIntrinsicFunctions
          call dump input message
      
      *procedure declared as intrinsic in MyIntrinsicFunctions
          call MyIntrinsicFunctions::dump input message
        .
       END PROGRAM PGM2.

